{"custom_id": "ddSwitchToSL", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Create a table showing the depreciation and book value for each year (i.e., from EOY 0 through EOY 10) for a milling machine purchased for 20000 USD with a salvage value of 2000 USD and a useful life of 10 years using double declining balance depreciation and switching to straight-line depreciation.\n\nWhat is the book value at EOY 1, EOY 5, and EOY 10?\n\n- Book Value at EOY 1 = \n- Book Value at EOY 5 = \n- Book Value at EOY 10 = "}}
{"custom_id": "doubleDecline", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Create a table showing the depreciation and book value for each year (i.e., from EOY 0 through EOY 10) for a milling machine purchased for 50000 USD with a salvage value of 5000 USD and a useful life of 10 years using double declining balance depreciation.\n\nWhat is the book value at EOY 1, EOY 5, and EOY 10?\n\n- Book Value at EOY 1 = 45000\n- Book Value at EOY 5 = 25000\n- Book Value at EOY 10 = 5000"}}
{"custom_id": "MARCSDeduction5year", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Using the MACRS deduction method for a large tape-drive system purchased for 50,000 USD classified as 5-year property, calculate the depreciation expense and the book value of the system at the end of each year for its 7-year useful life.\n\nCalculate the following:\n- Book Value at End of Year 1 \n- Book Value at End of Year 2 \n- Book Value at End of Year 3 \n- Book Value at End of Year 4 \n- Book Value at End of Year 5 \n- Book Value at End of Year 6 \n- Book Value at End of Year 7."}}
{"custom_id": "MARCSDeduction7year", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Using the MACRS deduction method for a large tape-drive system purchased for {{params.cost}} USD, classified as {{params.propertyClass}}-year property, calculate the depreciation expense and the book value of the system at the end of each year for its {{params.usefulLife}}-year useful life.\n\n### Book Value Calculations:\n- **Book Value at End of Year 1:**  {{bookValueEndYear1}}\n- **Book Value at End of Year 2:**  {{bookValueEndYear2}}\n- **Book Value at End of Year 3:**  {{bookValueEndYear3}}\n- **Book Value at End of Year 4:**  {{bookValueEndYear4}}\n- **Book Value at End of Year 5:**  {{bookValueEndYear5}}\n- **Book Value at End of Year 6:**  {{bookValueEndYear6}}\n- **Book Value at End of Year {{params.endend}}:**  {{bookValueEndYearendend}}\n- **Book Value at End of Year {{params.end}}:**  {{bookValueEndYearend}}"}}
{"custom_id": "straightLineMethod", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A milling machine is purchased for 15,000 USD at EOY 0. The machine is expected to have a 10-year life and a salvage value of 2,000 USD.\n\nCreate a table showing the depreciation and book value for each year (i.e., from EOY 0 through EOY 10) using straight-line depreciation. What is the book value at EOY 5 and EOY 10?"}}
{"custom_id": "AmountOfPayments", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "You purchase a home with a 3%/year fixed-rate, 30-year mortgage. Interest is compounded monthly. The amount borrowed is $250,000. Every 3 months, you make an additional quarter payment which is used to pay off principal (e.g., at EOM 1 payment = A, at EOM 2 payment = A, at EOM 3 payment = 1.25A).\n\nCalculate how many months it will take to pay off the mortgage considering both the monthly payments and the additional quarterly payments."}}
{"custom_id": "CarPurchase", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "You are considering purchasing a new car from Slimy’s Sports Car Emporium. The car costs 25,000 USD, and you put a down payment of 5,000 USD. Slimy is offering Henry a 60 month loan with an interest rate of 6% per year compounded monthly with a payment of 500 USD.  \n\nSomething feels off about the monthly payment. Do some investigating and figure out what the monthly payment should be. How much money are they overcharging you per month?"}}
{"custom_id": "FutureSavings", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "If you deposit 500 USD every other month into an account that pays 5% per year compounded monthly, how much will you have after 10 years? The first payment is made at the end of month 2.\n\nHint: compute an effective interest rate."}}
{"custom_id": "InterestRateConversions", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A loan has a nominal interest rate of 5% per year compounded monthly. What is the effective annual interest rate?\n\n---\n\nA loan with interest that is compounded monthly has an effective annual interest rate of 8% . What is the nominal interest rate?"}}
{"custom_id": "IntrestPayed", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "You purchase a home with a **{{params.interestRate}}%** per year fixed-rate, **{{params.loanTerm}}-year** mortgage. Interest is compounded monthly. The amount borrowed is **${{params.amountBorrowed}} USD**.\n\nWhat is the total amount of interest paid over the life of the loan?"}}
{"custom_id": "loanIntrest", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "If a loan amount of 1000 is received at t=0, and is repaid with a single payment of 1100 at t=6 months, what is the interest rate for the single 6-month compounding period?\n\nIf the borrower is unable to pay off the loan until t = 12 weeks, how much would be owed?\n\nFor the payday loan problem, what is the effective annual interest rate? Don't be shocked — the answer is big."}}
{"custom_id": "ERR", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Jonny Appleseed invests $10,000 USD in an investment fund. After one year, he receives $1,200 USD annually for 5 years. After 10 years from the initial investment, he receives a lump sum of $15,000 USD. Assuming a minimum attractive rate of return (MARR) of 7%. \n\nCalculate the External Rate of Return (ERR)."}}
{"custom_id": "ERRcalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "What is the external rate of return for Washington Mill Works if they purchase a resawing band saw for 25000 USD with a useful life of 10 years, a salvage value of 5000 USD, annual income of 15000 USD, and annual operating expenses of 3000 USD, assuming a minimum attractive rate of return (MARR) of 8%. \n\nExternal Rate of Return = "}}
{"custom_id": "FirstPayment", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "An injection molding press is purchased for 15,000 USD. It is agreed that the press will be paid for over a 5 year period with annual payments using a 7% annual compound interest rate. Each payment is to be $200 less than the previous payment.\n\nWhat is the size of the first payment?"}}
{"custom_id": "InvestmentLargeBandSaw", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Washington Mill Works is considering the purchase of a large resawing band saw for 25000 USD. The saw is expected to have a useful life of 10 years, after which it will have an estimated salvage value of $5000. Each year, the annual income is estimated to be 8000, while the annual operating expenses are 3000. Assuming a minimum attractive rate of return (MARR) of 8%:\n\n1. Calculate the equivalent present worth of the cash flows over the seven-year period.\n2. Calculate the equivalent annual worth of the cash flows over the seven-year period.\n3. Calculate the equivalent future worth of the cash flows over the seven-year period.\n4. Calculate the internal rate of return (IRR)."}}
{"custom_id": "IRRCalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Jonny Appleseed invests $10,000 USD in an investment fund. After one year, she receives $1,200 USD annually for 5 years. After 10 years from the initial investment, he receives a lump sum of $15,000 USD. Assuming a minimum attractive rate of return (MARR) of 5%.\n\n1. Calculate the equivalent present worth of these cash flows. Include a cash flow diagram in your solution.\n\n2. Calculate the Internal Rate of Return (IRR)."}}
{"custom_id": "IRRTable", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A company would like to pick the best option out of the three described in the table below. The table shows the net cash flow for each year of the 10-year planning horizon. MARR is 10%.\n\n| Year (EOY) | Option 0 | Option 1 | Option 2 |\n|------------|-----------|-----------|-----------|\n| 0          | 0         | {{params.cost1}} | {{params.cost2}} |\n| 1          | 0         | {{params.A1}} | {{params.A21}} |\n| 2          | 0         | {{params.A1}} | {{params.A22}} |\n| 3          | 0         | {{params.A1}} | {{params.A23}} |\n| 4          | 0         | {{params.A1}} | {{params.A24}} |\n| 5          | 0         | {{params.A1}} | {{params.A25}} |\n\n**Tasks:**  \n1. Compute the present worth of option zero.  \n2. Compute the present worth of option one.  \n3. Compute the present worth of option two."}}
{"custom_id": "EarlyMortgageSell", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "You take out a 30-year fixed-rate mortgage for a house. The amount borrowed is 300,000 USD. The interest rate is 3.5% per year compounded monthly. You decide to sell the house immediately after the 12th payment.\n\n1. How much do you still owe on the loan?\n2. What is the total amount you have paid the lender by the time you sell the house?\n3. How much principal have you paid the lender by the time you sell the house?\n4. How much interest have you paid the lender by the time you sell the house?"}}
{"custom_id": "MortgageCalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Juan takes out a $250,000 USD 30-year fixed rate mortgage to purchase a home. The interest rate is 5% per year compounded monthly. \n\nCalculate the month in which the interest portion of the payment is less than one third of the total monthly payment."}}
{"custom_id": "NationalDebt", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "The national debt is 31 trillion dollars. The total tax revenue collected by the US government from individual income tax returns was 5 trillion dollars. Assume that the interest on the debt is 3% and that the annual revenue from individual income tax returns remains constant.\n\nDetermine **n**, the number of years it would take to pay off the current national debt if all of the tax revenue from personal income tax returns were applied to the debt each year.\n\nAssuming that all revenue from personal income tax returns were applied to the debt, what is the smallest interest rate for which the debt will never be paid off?"}}
{"custom_id": "PresentWorth", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Alice Smith invests $10,000 USD in an investment fund. After one year, she receives $1,200 USD annually for 5 years. After 10 years from the initial investment, she receives a lump sum of $15,000 USD. Assuming a minimum attractive rate of return (MARR) of 5%, calculate the equivalent present worth of these cash flows. Include a cash flow diagram in your solution."}}
{"custom_id": "PresentWorthCalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Washington Mill Works is considering the purchase of a large resawing band saw for 50,000 USD. The saw is expected to have a useful life of 10 years, after which it will have an estimated salvage value of $5,000. Each year, the annual income is estimated to be 20,000 USD, while the annual operating expenses are 8,000 USD. Assuming a minimum attractive rate of return (MARR) of 10%, calculate the equivalent present worth of the cash flows over the seven-year period."}}
{"custom_id": "CompundedInterest", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A sum of ${{params.principal}} is borrowed at an interest rate of {{params.interestRate}}% per year.\n\n**Calculations:**\n1. Calculate the amount owed after 1 year if the interest is compounded monthly.\n   - Amount owed (Monthly Compounding) = \n\n2. Calculate the amount owed after 1 year if the interest is compounded weekly.\n   - Amount owed (Weekly Compounding) = \n\n3. Calculate the amount owed after 1 year if the interest is compounded daily.\n   - Amount owed (Daily Compounding) ="}}
{"custom_id": "CreditCard", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "How long will it take for Sam Bigscreen to pay off his credit card debt of 5000 USD, with an interest rate of 15% per year compounded monthly, if he pays a minimum payment of 200 USD per month?  \n\n1. What is the time (in months) to pay off the debt?  \n2. How much interest will he pay?  \n3. What is the largest monthly payment for which Sam Bigscreen will never pay off the debt?"}}
{"custom_id": "HousePayment", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "You would like to purchase a house. You plan to make a down payment equal to 20% of the purchase price and take out a 30-year, fixed-rate mortgage for the remaining 80%. You would like to select a house such that your monthly payment, including mortgage and taxes, does not exceed 2000 USD. The annual tax rate is 1.25% of the purchase price and there is a special assessment for the local school district of 500 USD per year. You can assume that 1/12th of the tax and assessment is paid each month. If the interest rate is 4%/year compounded monthly, what is the most expensive house you can afford?"}}
{"custom_id": "LoanPaymentCalculation", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A loan of 15000 USD is to be paid off in 5 equal annual payments. The interest rate is 5% per year compounded annually. If the first payment is made at the end of Year 1, what is the annual payment?"}}
{"custom_id": "MortgagePayment", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A 30-year mortgage has an interest rate of 3.5% per year compounded monthly. The initial principal is 250,000 USD.  \n\nCalculate the monthly payment and the total interest paid over the life of the mortgage."}}
{"custom_id": "PaymentCalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A loan of 5000 USD is to be paid off in 10 equal annual payments. The interest rate is 5% per year compounded annually. If the first payment is made at the end of Year 0, what is the annual payment?"}}
{"custom_id": "PrincipleCalc", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "How much should be deposited at \\( t = 0 \\) into a fund paying 5\\% compounded per period in order to withdraw 100$ at \\( t = 1 \\), 150$ at \\( t = 2 \\), and 200$ at \\( t = 3 \\) such that the fund is depleted at the last withdrawal?"}}
{"custom_id": "RetirementSavings", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "How much can Taylor withdraw each month during retirement if she deposits 500 USD monthly for 30 years into an account that pays 5% per year compounded monthly, and then after the last deposit, the interest rate increases to 6% per year compounded monthly? The withdrawals will occur monthly for 20 years.\n\nWhat is the monthly withdrawal amount (in USD)?"}}
{"custom_id": "saleTax", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A specialized autoclave for curing carbon fiber airplane parts is purchased for 100,000 USD in 2024. The autoclave is depreciated using the appropriate MACRS schedule, which follows a 7-year deduction period. The tax rate is 30%.\n\nThe autoclave is sold during year 10 for a salvage value of 15,000 USD. How much tax is paid on the salvage at EOY 10?\n\n**Tax paid in EOY 10:**\n\nThe autoclave is sold during year 10 for a salvage value of 15,000 USD. How much tax is paid on the salvage at EOY 10?\n\n**Tax paid in EOY 10:**\n\nThe autoclave is sold during year 10 for a salvage value of 10,000 USD. How much tax is paid on the salvage at EOY 10?\n\n**Tax paid in EOY 10:**"}}
{"custom_id": "taxableIncome", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "Given the following cash flow details for the year 2018:\n\n- Before-Tax-and-Loan Cash Flow = 100,000\n- Payment on loan principal = 10,000\n- Payment on loan interest = 5,000\n- MACRS Depreciation Deduction = 15,000\n- Tax Rate = 30%\n\n1. What is the taxable income for ACME Inc?\n2. What is the tax paid?\n3. What is the after-tax cash flow (ATCF)?"}}
{"custom_id": "TaxTable", "method": "POST", "url": "/v1/embeddings", "body": {"model": "text-embedding-3-small", "input": "A machine specialized for use in the manufacture of motor vehicles is purchased for 50,000 USD. The machine is purchased with a 30,000 USD loan and 20,000 USD of equity.\n\nThe loan has an interest rate of 5% and is paid off in five years. The machine is depreciated using the MACRS 3-year schedule. The revenue minus cost for each of the five years of operation is 15,000 USD. The tax rate is 30%. Complete the table below.\n\n\\[\n    \\small % Reduce font size for the table\n    \\begin{array}{|c|c|c|c|c|c|c|c|c|c|}\n    \\hline\n    \\textbf{EOY} & \\textbf{BTLCF} & \\textbf{MACRS Deduction} & \\textbf{Book Value} & \\textbf{Loan Principal Payment} & \\textbf{Loan Interest Payment} & \\textbf{Remaining Principal} & \\textbf{Taxable Income} & \\textbf{Tax} & \\textbf{ATCF} \\\\\n    \\hline\n    0 & & & & & & & & & \\\\ \\hline\n    1 & & & & & & & & & \\\\ \\hline\n    2 & & & & & & & & & \\\\ \\hline\n    3 & & & & & & & & & \\\\ \\hline\n    4 & & & & & & & & & \\\\ \\hline\n    5 & & & & & & & & & \\\\ \\hline\n    \\end{array}\n\\]\n\n**Loan Payments**  \nMonthly Loan Payment = \n\n**EOY 1**  \nInterest Paid at EOY1 =  \nRemaining Principal at EOY1 =  \nTaxable Income at EOY 1 =  \nAfter Tax Cash Flow (AFCF) at EOY 1 =  \n\n**EOY 3**  \nInterest Paid at EOY3 =  \nRemaining Principal at EOY3 =  \nTaxable Income at EOY 3 =  \nAfter Tax Cash Flow (AFCF) at EOY 3 =  \n\n**EOY 5**  \nInterest Paid at EOY5 =  \nRemaining Principal at EOY5 =  \nTaxable Income at EOY 5 =  \nAfter Tax Cash Flow (AFCF) at EOY 5 =  \n"}}
