[
    {
        "Lecture_02_03": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Fluid Dynamics: Stability and Motion",
                    "lecture_subtitle": "Analyzing Stability in Fluids and Motion of Containers",
                    "summary": "The lecture focuses on the principles of fluid dynamics, particularly examining stability and motion in fluids and containers. It begins with the analysis of buoyancy and stability in floating objects, exploring the conditions for stability based on the center of gravity and buoyancy. The lecture continues with the study of accelerating containers, deriving the equations of motion and the effects of acceleration on fluid surfaces. It introduces the concept of pressure distribution in rotating fluids and the resulting parabolic surfaces. The volumetric flow rate equation is also discussed, highlighting units and conversion.",
                    "key_concepts": [
                        {
                            "keyword": "Buoyancy and Stability",
                            "description": "The stability of a floating object depends on the relative positions of the center of gravity (G) and the center of buoyancy (B). The metacentric height (GM) must be positive for stability."
                        },
                        {
                            "keyword": "Accelerating Containers",
                            "description": "The surface of a fluid in an accelerating container tilts, which is described by the slope equation $\\frac{dz}{dx} = \\frac{-a_x}{a_z + g}$."
                        },
                        {
                            "keyword": "Rotating Fluids",
                            "description": "In a rotating fluid, the pressure distribution leads to a parabolic surface described by $z - z_0 = \\frac{\\omega^2 r^2}{2g}$."
                        },
                        {
                            "keyword": "Volumetric Flow Rate",
                            "description": "The volumetric flow rate is given by $Q = Av$, where $A$ is the cross-sectional area and $v$ is the velocity. It is measured in $m^3/s$ or $L/s$."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Center of Gravity and Buoyancy",
                            "description": "The center of gravity is the point where the weight is evenly distributed. The center of buoyancy is the center of mass of the displaced fluid volume."
                        },
                        {
                            "keyword": "Pressure and Fluid Dynamics",
                            "description": "Pressure in a fluid is influenced by external forces such as acceleration and rotation, affecting stability and motion."
                        },
                        {
                            "keyword": "Basic Calculus",
                            "description": "Differential equations and integration are used to derive the equations governing fluid motion and stability."
                        }
                    ],
                    "search_keywords": [
                        "fluid dynamics stability",
                        "accelerating fluid containers",
                        "pressure distribution in rotating fluids"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses the stability of a cylindrical log floating in water. The densities of wood and oil are given as 0.6 and 0.8 respectively. The slide analyzes the stability condition by calculating the submerged length of the log and applying Archimedes' principle to equate the weight of the log with the buoyant force. The greatest length for stability is derived as \\( L < \\frac{\\sqrt{2}}{3} D \\), relating the length and diameter of the log for stability. The metacentric height (GM) is used as a criterion for stability, requiring it to be greater than zero. The calculations involve the moment of inertia and the submerged volume of the log.",
                                    "text": "\\[ \\rho_{wood} = 0.6 \\quad \\rho_{oil} = 0.8 \\] \\[ \\Sigma F_y = 0; \\quad W_{log} = F_{buoyancy} \\] \\[ \\rho_{wood} \\frac{\\pi D^2}{4} L = \\rho_{oil} \\left( \\frac{\\pi}{4} D^2 \\right) L_s \\] \\[ L_s = \\frac{\\rho_{wood}}{\\rho_{oil}} L = \\frac{0.6}{0.8} L = \\frac{3}{4} L \\] \\[ BG = \\frac{L}{2} - \\frac{3}{8} L = \\frac{L}{8} \\] \\[ GM = \\frac{I_c}{V} - BG \\] \\[ \\text{Submerged volume} \\] \\[ GM > 0 \\quad \\text{for stability} \\] \\[ \\frac{I_c}{V} - BG > 0 \\Rightarrow \\frac{\\pi}{64} D^4 \\cdot \\frac{1}{\\frac{\\pi}{4} D^2 L_s} - \\frac{L}{8} > 0 \\] \\[ \\Rightarrow \\frac{D^2}{16 L_s} - \\frac{L}{8} > 0 \\Rightarrow \\frac{D^2}{3L} - \\frac{L}{8} > 0 \\] \\[ \\Rightarrow D^2 > 3L^2 \\Rightarrow D > L \\frac{\\sqrt{2}}{2} \\] \\[ \\text{Greatest length for stability:} \\quad L < \\frac{\\sqrt{2}}{3} D \\]",
                                    "image_description": "The image shows a vertical cylindrical log floating in a liquid. The diagram illustrates the log's diameter \\(D\\) and length \\(L\\), with centers of gravity \\(G\\) and buoyancy \\(B\\) marked. The submerged length \\(L_s\\) is indicated, along with the positions \\(L/2\\) and \\(3L/8\\). Equations and notes are handwritten around the diagram, explaining the conditions for stability and the calculation of metacentric height (GM)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses the effect of acceleration on the pressure distribution within a fluid in a container. The pressure gradient in the fluid is described by partial differential equations: \\( \\frac{\\partial p}{\\partial x} = -\\rho a_x \\), \\( \\frac{\\partial p}{\\partial y} = -\\rho a_y \\), \\( \\frac{\\partial p}{\\partial z} = -\\rho (az + g) \\). The slide explains how the pressure at the surface equals atmospheric pressure, and how this leads to a relationship between the slopes of the surface, expressed through the equation \\( \\frac{dz}{dx} = \\frac{-a_x}{az + g} \\).",
                                    "text": "\\( \\frac{\\partial p}{\\partial x} = -\\rho a_x \\) \\( \\frac{\\partial p}{\\partial y} = -\\rho a_y \\) \\( \\frac{\\partial p}{\\partial z} = -\\rho (az + g) \\) \\( p @ \\text{surface} = p_a \\) \\( ax \\) \\( dp = \\frac{\\partial p}{\\partial x} dx + \\frac{\\partial p}{\\partial z} dz \\) \\( dp = 0 \\Rightarrow \\frac{\\partial p}{\\partial x} dx + \\frac{\\partial p}{\\partial z} dz = 0 \\Rightarrow \\frac{dz}{dx} = \\frac{-\\partial p / \\partial x}{\\partial p / \\partial z} \\) \\( \\frac{dz}{dx} = \\frac{-\\rho a_x}{-\\rho (az + g)} \\Rightarrow \\frac{dz}{dx} = \\frac{-a_x}{az + g} \\)",
                                    "image_description": "The image contains two diagrams. The first diagram shows a container filled with a fluid, with an indication that pressure at the surface is atmospheric (p@surface = pa). The second diagram illustrates the fluid container accelerating to the right with acceleration ax, causing the surface to tilt at an angle θ, demonstrating the slope of the surface with a triangle indicating height z and length x."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the concept of a changing volume within a rectangular prism as it tilts at an angle \\(\\theta\\). It begins with the equation \\(\\frac{dz}{dx} = -\\frac{ax}{g}\\) and examines the effects of acceleration \\(a_x\\) on the system. The slide illustrates different scenarios with \\(a_x > 0\\) and \\(a_x < 0\\), showing how the volume calculation changes. It describes the relationship between the heights \\(H_1\\), \\(H_2\\), and \\(H_3\\) in the prism and provides formulas to calculate these heights based on the prism's tilt. The volume is expressed in terms of these heights and the base dimensions \\(W\\) and \\(L\\).",
                                    "text": "Let \\( a_x \\to \\infty \\).\n\\[ \\frac{dz}{dx} = -\\frac{ax}{g} \\]\n- \\(a_x > 0\\)\n- \\(a_x < 0\\)\n\nDiagram shows a rectangular prism with dimensions \\(W\\), \\(H_1\\), \\(L\\), and tilting to an angle \\(\\theta\\).\n\n\\[ \\text{Volume} = WH_1L \\] \n\nFor tilt:\n\\[ \\text{Volume} = W\\left( L H_2 + \\frac{1}{2}(H_3-H_2)L \\right) = WL \\frac{H_2 + H_3}{2} \\]\n\nEquations for heights:\n\\[ H_1 = \\frac{H_2 + H_3}{2} \\] \n\\[ H_2 + H_3 = 2H_1 \\] \n\\[ H_3 - H_2 = L \\tan \\theta \\]\n\nSolving:\n\\[ H_3 = \\frac{2H_1 + L \\tan \\theta}{2} \\]\n\\[ H_2 = \\frac{2H_1 - L \\tan \\theta}{2} \\]\n\\[ \\text{where } \\tan \\theta = \\frac{a_x}{g} \\]\n\\[ H_3 = \\frac{2H_1 + L \\frac{a_x}{g}}{2} \\]\n\\[ H_2 = \\frac{2H_1 - L \\frac{a_x}{g}}{2} \\]",
                                    "image_description": "The image shows two scenarios of a rectangular prism with acceleration \\(a_x\\) in different directions: positive and negative. There are diagrams illustrating the prism's tilt angle \\(\\theta\\) and how it affects the heights \\(H_1\\), \\(H_2\\), and \\(H_3\\). Equations for volume and height are written alongside these diagrams, indicating the relationships and changes in volume due to the tilt."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The slide presents a derivation of pressure difference using integrals and assumptions about constants. It starts with the differential form of pressure and integrates it to find the expression for pressure, assuming certain variables are constant. The final expression for the pressure difference \\( p - p_a \\) is derived, highlighting the effect of constants \\( \\rho a_x \\) and \\( \\rho (a_z + g) \\).",
                                    "text": "dp = \\frac{\\partial p}{\\partial x} dx + \\frac{\\partial p}{\\partial z} dz \n\\int dp = \\int \\frac{\\partial p}{\\partial x} dx + \\int \\frac{\\partial p}{\\partial z} dz \np = \\int -\\rho a_x dx + \\int -\\rho (a_z + g) dz \\text{ (Assuming } a_x, a_z \\text{ are constant)}\n= -\\rho a_x x - \\rho (a_z + g) z + c\n\\text{At } (x = 0, z = H_1) \\quad p = p_a\n\\text{or } (0, H_1)\n\\Rightarrow p_a = -\\rho a_x (0) - \\rho (a_z + g) H_1 + c\nc = p_a + \\rho (a_z + g) H_1\np = -\\rho a_x x - \\rho (a_z + g) (z - H_1) + p_a\n\\boxed{p - p_a = -\\rho a_x x - \\rho (a_z + g) (z - H_1)}",
                                    "image_description": "The image contains handwritten notes and equations. It details the derivation of pressure difference starting from a differential equation for pressure \\( dp \\). The integration steps are shown along with assumptions about constants (\\( a_x, a_z \\)). The final boxed equation shows the expression for pressure difference \\( p - p_a \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the dynamics of water spillage from a container under acceleration. It begins by considering a rectangular container with initial height $H_1$ and dimensions $L$ and $W$. The volume $V$ of the rectangular container is given by $V = L H_1 W$. When the container is accelerated horizontally with acceleration $a_x$, the water's surface tilts, forming an angle $\\theta$. The new height $H_2$ at the lower end is determined by $H_2 = 2H_1 - H_0$, where $H_0$ is the height at the higher end. The tangent of the angle $\\theta$ is given by $\\tan \\theta = \\frac{H_0 - H_2}{L}$, which simplifies to $\\tan \\theta = \\frac{2(H_0 - H_1)}{L}$. The horizontal acceleration $a_x$ is related to the gravitational acceleration $g$ by $\\frac{a_x}{g} = \\frac{2(H_0 - H_1)}{L}$, leading to the condition $a_x > 2\\frac{(H_0 - H_1)}{L}g$. The volume of water spilled is given by the difference $(L H_1 W - \\frac{1}{2} L H_0 W)$.",
                                    "text": "V = L H_1 W = \\frac{1}{2} L W (H_0 + H_2)\\\\ H_1 = \\frac{1}{2}(H_0 + H_2) \\implies H_2 = 2H_1 - H_0\\\\ \\tan \\theta = \\frac{H_0 - H_2}{L}\\\\ = \\frac{H_0 - (2H_1 - H_0)}{L} = \\frac{2(H_0 - H_1)}{L}\\\\ \\frac{a_x}{g} = \\frac{2(H_0 - H_1)}{L} \\implies a_x = 2\\frac{(H_0 - H_1)}{L}g\\\\ a_x > 2\\frac{(H_0 - H_1)}{L}g\\\\ \\tan \\theta = \\frac{H_0}{L}\\\\ \\frac{a_x}{g} = \\frac{H_0}{L} \\implies a_x = g\\frac{H_0}{L}\\\\ \\text{Volume of water spilled}\\\\ (L H_1 W - \\frac{1}{2} L H_0 W)",
                                    "image_description": "The image consists of two diagrams. The first diagram shows a rectangular container with a certain height $H_1$ and dimensions $L$ and $W$. The second diagram shows the container tilted with an angle $\\theta$ and heights $H_0$ and $H_2$ at two ends. The tilt is due to horizontal acceleration $a_x$. There's also a smaller diagram illustrating a right triangle with angle $\\theta$, base $L$, and height $H_0$, which represents the tilted water surface profile."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The slide appears to illustrate concepts related to pressure and expansion in a mechanical or thermodynamic context. It shows diagrams representing initial and expanded states of a system, with annotations indicating pressures and horizontal expansions.",
                                    "text": "Top left diagram: A square shape with a diagonal line indicating expansion. Annotated with 'p_a' and an arrow pointing to the right labeled 'αx'.\n\nTop right diagram: A similar shape as the top left but with more pronounced expansion. The same label 'αx' is present, suggesting continued emphasis on horizontal expansion.\n\nBottom left diagram: A square with no additional lines or annotations, possibly representing an initial state or a different scenario.\n\nBottom right diagram: A similar shape as the bottom left but with a diagonal line indicating expansion and a dashed line at the top. The annotation 'p_i > p_a' suggests a pressure comparison between an initial pressure 'p_i' and another pressure 'p_a'.",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: The image consists of four hand-drawn diagrams. Top left: A square with a diagonal expansion line and annotations 'p_a' and 'αx'. Top right: A similar square with more pronounced expansion and the label 'αx'. Bottom left: A simple square with no expansion markings. Bottom right: A square with a diagonal expansion line, a dashed line at the top, and the annotation 'p_i > p_a', indicating a pressure difference."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The slide illustrates the concept of a rotating cylindrical object with angular velocity \\( \\omega \\). The diagrams depict a 3D view of the cylinder, a cross-sectional side view showing a parabolic surface due to rotation, and a differential element for integration purposes. The differential element is described with cylindrical coordinates \\( (r, \\theta, z) \\) indicating small changes \\( dr \\), \\( d\\theta \\), and \\( dz \\).",
                                    "text": "The slide contains diagrams related to the rotation of a cylindrical object. The first diagram on the left shows a 3D view of a cylinder with radius \\( R \\) and an angular velocity \\( \\omega \\). The middle diagram presents a side view cross-section of the cylinder, illustrating a parabolic surface inside the cylinder due to the rotation. The rightmost diagram shows a differential volume element in cylindrical coordinates with dimensions \\( dr \\), \\( d\\theta \\), and \\( dz \\). This element is shaded in red, indicating its use in integration over the cylindrical volume.",
                                    "image_description": "The image consists of three hand-drawn diagrams: 1. A 3D view of a cylinder with radius \\( R \\) and angular velocity \\( \\omega \\). 2. A cross-sectional side view showing a parabolic surface inside the cylinder. 3. A differential volume element in cylindrical coordinates \\( (r, \\theta, z) \\) with small changes \\( dr \\), \\( d\\theta \\), and \\( dz \\), shaded in red."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the pressure at the center of an element in a cylindrical coordinate system, represented as \\( p(r, \\theta, z) \\). It involves the application of Newton's second law for radial, tangential, and axial components, leading to equations of motion in cylindrical coordinates. The equations are derived by considering small increments in the radial, tangential, and axial directions, resulting in expressions for the pressure gradient in each direction. The formulas incorporate density \\( \\rho \\), angular velocity \\( \\omega \\), and gravitational acceleration \\( g \\).",
                                    "text": "Pressure at center of element is \\( p(r, \\theta, z) \\).\n\\[ \\sum F_r = ma_r \\Rightarrow p(r-\\frac{\\delta r}{2}, \\theta, z) \\ d\\theta \\, ds - p(r+\\frac{\\delta r}{2}, \\theta, z) \\ d\\theta \\, ds = - \\int_0^{\\delta r} \\rho \\delta r \\delta z \\delta s \\omega^2 r \\\\\n\\left(p(r, 0, z) - \\frac{\\partial p}{\\partial r} \\frac{\\delta r}{2}\\right) d\\theta \\, ds - \\left(p(r, \\theta, z) + \\frac{\\partial p}{\\partial r} \\frac{\\delta r}{2}\\right) d\\theta \\, ds = - \\rho \\delta r \\delta z \\delta s \\omega^2 r \\\\\n\\left(-\\frac{\\partial p}{\\partial r} \\right) = -\\rho \\omega^2 r\\]\n\\[\\sum F_\\theta = ma_\\theta \\Rightarrow p(r, s-\\frac{\\delta s}{2}, z) dr \\, dz - p(r, s+\\frac{\\delta s}{2}, z) dr \\, dz = \\rho \\delta r \\delta z \\delta s a_\\theta \\\\\n\\left(-\\frac{\\partial p}{\\partial s} \\right) = \\rho a_\\theta\\]\n\\[\\sum F_z = ma_z \\Rightarrow p(r, s, z-\\frac{\\delta z}{2}) \\delta s \\, dr - p(r, s, z+\\frac{\\delta z}{2}) \\delta s \\, dr = \\rho \\delta r \\delta z \\delta s g \\\\\n\\left(-\\frac{\\partial p}{\\partial z} \\right) - \\rho g = \\rho a_z \\Rightarrow \\left(-\\frac{\\partial p}{\\partial z} \\right) = \\rho (a_z + g)\\]",
                                    "image_description": "The image shows a cylindrical element with small increments \\( \\delta r \\), \\( \\delta \\theta \\), and \\( \\delta z \\) marked on it. The pressure at different points on the element is labeled, such as \\( p(r-\\frac{\\delta r}{2}, \\theta, z) \\), \\( p(r+\\frac{\\delta r}{2}, \\theta, z) \\), and \\( p(r, s-\\frac{\\delta s}{2}, z) \\). The diagram illustrates the element's orientation in a cylindrical coordinate system with the radial, tangential, and axial directions."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The slide illustrates the concept of calculating the volume of a rotating liquid in a cylindrical container by considering the effects of angular velocity. It includes diagrams depicting the liquid surface shape and mathematical derivations for the volume calculation using integrals. The key equations involve the relationship between radius, angular velocity, and gravitational acceleration, culminating in the expression for the volume of the liquid.",
                                    "text": "The page contains drawings and mathematical equations related to the volume of liquid in a rotating cylindrical container. It describes how the liquid surface forms a parabolic shape due to rotation. The key equations are derived as follows:\n\n1. The equation for the surface is given by \\( z = \\frac{\\omega^2 r^2}{2g} \\), where \\( \\omega \\) is the angular velocity, \\( r \\) is the radius, and \\( g \\) is the gravitational acceleration.\n2. From this, \\( r^2 = \\frac{z}{\\omega^2/2g} \\).\n3. The differential volume \\( dV \\) is expressed as \\( \\pi r^2 dz \\).\n4. The total volume \\( V \\) is calculated by integrating: \\( V = \\int_0^H \\pi r^2 dz \\).\n5. Substituting the expression for \\( r^2 \\), we get: \\( V = \\int_0^H \\frac{\\pi}{(\\omega^2/2g)} z \\, dz \\).\n6. This evaluates to: \\( V = \\frac{\\pi}{\\omega^2/2g} \\frac{H^2}{2} \\).\n\nAnother equation shows the volume of the circumscribing cylinder: \\( \\pi R^2 H \\), and a comparison is made to show how the volume of the rotating liquid relates to this.\n\nThe handwriting notes: \"\\( \\pi R^2 H = \\text{volume of circumscribing cylinder}\".",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: The image contains three diagrams of a cylindrical container with liquid. The first diagram shows a cross-section of the container with a parabolic liquid surface due to rotation. The second diagram illustrates the height differences in the liquid surface. The third diagram is a 3D representation of the container, highlighting the parabolic surface shape. Mathematical equations and calculations are handwritten around the diagrams, showing the derivation of the volume formula for the liquid in the container. Key variables like \\( \\omega \\), \\( r \\), \\( g \\), and \\( z \\) are labeled."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_9.png"
                            }
                        ]
                    },
                    {
                        "10": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the equilibrium of a rotating fluid, focusing on how pressure and height change in a cylindrical coordinate system. It derives the equation for the shape of the free surface of the fluid, showing that it forms a paraboloid of revolution.",
                                    "text": "dp = \\frac{\\partial p}{\\partial r} dr + \\frac{\\partial p}{\\partial z} dz = 0 \\\\\np = p_0 \\Rightarrow dp = 0 \\\\\n\\omega = \\text{constant} \\quad a_z = \\frac{g}{\\rho} = 0 \\\\\n\\Rightarrow \\frac{\\partial p}{\\partial r} dr + \\frac{\\partial p}{\\partial z} dz = 0 \\Rightarrow \\frac{dz}{dr} = -\\frac{\\partial p / \\partial r}{\\partial p / \\partial z} \\\\\n\\Rightarrow \\frac{dz}{dr} = -\\frac{\\rho \\omega^2 r}{g} - \\rho g \\\\\n\\Rightarrow \\frac{dz}{dr} = \\frac{\\omega^2 r}{g} \\\\\n\\Rightarrow \\int_{z_0}^{z} dz = \\int_{0}^{r} \\frac{\\omega^2 r}{g} dr \\Rightarrow z - z_0 = \\frac{\\omega^2 r^2}{2g} \\\\\n\\text{Paraboloid of revolution}",
                                    "image_description": "The image is a sketch showing a rotating container with fluid, illustrating the free surface as a parabolic curve. The surface is labeled \"free surface\" and \"p=p_0\". It demonstrates the derivation of the equation for the shape of the surface. DESCRIPTION OF THE IMAGE OR CHART"
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_10.png"
                            }
                        ]
                    },
                    {
                        "11": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses fluid dynamics in a rotating system. It explains how the fluid level changes due to rotation, with a formula for the height difference from the center to the edge given as \\( z - z_0 = \\frac{\\omega^2 r^2}{2g} \\). The condition for fluid spilling is derived, showing that if the angular velocity \\( \\omega \\) exceeds \\( \\sqrt{\\frac{4gH}{R^2}} \\), the fluid will spill.",
                                    "text": "z - z_0 = \\frac{\\omega^2 r^2}{2g} \\newline When \\ r = R, \\newline z - z_0 = 2H \\newline 2H = \\frac{\\omega^2 R^2}{g} \\newline \\Rightarrow \\omega = \\sqrt{\\frac{4gH}{R^2}} \\newline \\text{If } \\omega > \\sqrt{\\frac{4gH}{R^2}}, \\text{ fluid spills.}",
                                    "image_description": "There are three diagrams illustrating the fluid surface in a container. The first shows a static fluid with height \\( H_0 \\). The second shows the fluid surface as a parabola when rotating at angular velocity \\( \\omega \\) with the height difference \\( z - z_0 \\). The third diagram shows the parabolic profile with a marked central axis, representing the fluid's shape during rotation."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_11.png"
                            }
                        ]
                    },
                    {
                        "12": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide explains the concept of volume calculation before and after rotation. It first shows the volume of a cylinder before rotation with height \\(H_0\\), and then the volume of a paraboloid after rotation with height \\(H_1\\). The volume of the cylinder is given by \\(\\frac{\\pi D^2}{4} H_0\\), while the volume of the paraboloid is \\(\\frac{1}{2} \\left(\\frac{\\pi D^2}{4} H_2\\right)\\). It concludes with the relation \\(H_1 = \\frac{H_2}{2}\\).",
                                    "text": "The slide contains two main parts. The first part shows the volume of a cylinder before rotation. The height of the cylinder is denoted by \\(H_0\\), and its volume is calculated as \\(\\frac{\\pi D^2}{4} H_0\\). The second part shows the volume of a paraboloid after rotation. It is given by \\(\\frac{1}{2} \\left(\\frac{\\pi D^2}{4} H_2\\right)\\). Additionally, the relationship between the heights is shown as \\(H_1 = \\frac{H_2}{2}\\).",
                                    "image_description": "The image contains two diagrams. The first diagram shows a cylinder with a height \\(H_0\\) and a volume formula \\(\\frac{\\pi D^2}{4} H_0\\). The second diagram depicts a paraboloid with a volume formula \\(\\frac{1}{2} \\left(\\frac{\\pi D^2}{4} H_2\\right)\\) and a relationship \\(H_1 = \\frac{H_2}{2}\\). There's an additional sketch showing a cross-section with a shaded area representing the region of rotation."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_12.png"
                            }
                        ]
                    },
                    {
                        "13": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses the concept of volumetric flow rate, represented by \\( Q \\) and defined as \\( Q = Av \\), where \\( A \\) is the cross-sectional area and \\( v \\) is the velocity of the fluid. It explains the units of volumetric flow rate, which can be cubic meters per second (m^3/s) or liters per second (liters/s). It also covers the conversion between liters and cubic meters, and mentions other units such as gallons per minute (gpm) and cubic feet per minute (cfm).",
                                    "text": "Volumetric flow rate \\( \\dot{V} = Av \\) \\( Q = Av \\) (volumetric flow rate) \\([Q] = \\text{m}^3/\\text{s}, \\text{liters/s}\\) 1 liter = \\frac{1}{1000} \\text{m}^3 (1 \\text{m}^3 = 1000 \\text{L}) \\([Q] = \\text{gallons per minute (gpm)} \\text{cubic feet per minute (cfm)}\\)",
                                    "image_description": "The image shows a diagram of a pipe with cross-sectional area \\( A \\) and fluid velocity \\( v \\), illustrating the concept of volumetric flow rate. The equation \\( Q = Av \\) is highlighted, and the units of \\( Q \\) are listed, including m^3/s, liters/s, gallons per minute (gpm), and cubic feet per minute (cfm)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_03\\Lecture_02_03_page_13.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_02_06": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Fluid Flow and Conservation Principles",
                    "lecture_subtitle": "Understanding Mass, Momentum, and Energy Balances in Fluid Dynamics",
                    "summary": "The lecture focuses on the fundamental principles of fluid dynamics, specifically exploring the conservation of mass, momentum, and energy within a control volume. It begins by introducing the concept of mass flow rate, emphasizing the relationship between density, velocity, and cross-sectional area. The lecture then covers the general balance equation for various quantities such as mass, energy, and momentum, detailing how these can be transferred, generated, or consumed within a system. The steady-state assumption is introduced, simplifying the balance equations under certain conditions. Applications of these principles are demonstrated through examples involving incompressible flow, the behavior of gases in a tank, and the use of tools like the Venturi meter and Pitot tube. The energy balance is further illustrated using Bernoulli's equation, which is then applied to practical situations like siphons and fluid discharge, including Torricelli's equation for velocity.",
                    "key_concepts": [
                        {
                            "keyword": "Mass Flow Rate",
                            "description": "The mass flow rate $\\dot{m}$ is calculated as $\\rho Q$ or $\\rho AV$, where $\\rho$ is the fluid density, $Q$ is the volumetric flow rate, and $A$ is the cross-sectional area."
                        },
                        {
                            "keyword": "Balance Equation",
                            "description": "The general form of the balance equation is $\\dot{X}_{in} + \\dot{X}_{transf} + \\dot{X}_{gen} - \\dot{X}_{out} = \\frac{dX_{cv}}{dt}$, applicable to mass, energy, and momentum."
                        },
                        {
                            "keyword": "Steady State",
                            "description": "In steady-state conditions, the change of a quantity within the control volume over time is zero, simplifying balance equations."
                        },
                        {
                            "keyword": "Bernoulli's Equation",
                            "description": "Bernoulli's equation relates pressure, velocity, and elevation in a flowing fluid, expressed as $\\frac{P}{\\rho} + \\frac{V^2}{2} + gz = \\text{constant}$."
                        },
                        {
                            "keyword": "Venturi Meter",
                            "description": "A device used to measure the flow rate of fluid by observing the pressure difference between two sections of a pipe."
                        },
                        {
                            "keyword": "Pitot Tube",
                            "description": "An instrument that measures fluid flow velocity by converting the kinetic energy of the flow into potential energy."
                        },
                        {
                            "keyword": "Torricelli's Equation",
                            "description": "Used to determine the exit velocity of fluid under gravity, expressed as $V = \\sqrt{2gH}$."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Density",
                            "description": "Density $\\rho$ is the mass per unit volume of a substance and is crucial in calculating the mass flow rate."
                        },
                        {
                            "keyword": "Control Volume",
                            "description": "An imaginary boundary used to analyze the behavior of fluid within a certain area, essential in applying balance equations."
                        },
                        {
                            "keyword": "Conservation of Mass",
                            "description": "A principle stating that mass cannot be created or destroyed in a closed system, forming the basis of mass balance equations."
                        },
                        {
                            "keyword": "Conservation of Energy",
                            "description": "Energy cannot be created or destroyed, only transferred or converted, forming the basis of energy balance equations."
                        },
                        {
                            "keyword": "Fluid Dynamics",
                            "description": "The study of fluids in motion, involving the analysis of velocity, pressure, and flow patterns."
                        }
                    ],
                    "search_keywords": [
                        "Fluid dynamics conservation principles",
                        "Bernoulli's equation applications",
                        "Venturi and Pitot tube flow measurement"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The slide explains the concept of mass flow rate in fluid dynamics. It describes the relationship between mass flow rate (\\( \\dot{m} \\)), volumetric flow rate (\\( Q \\)), velocity (\\( V \\)), and cross-sectional area (\\( A \\)). The mass flow rate is given by \\( \\dot{m} = \\rho Q = \\rho AV \\), where \\( \\rho \\) is the fluid density. The slide also describes a scenario where fluid is allowed to flow for a time \\( \\Delta t \\), leading to the calculation of the collected fluid mass as \\( \\Delta m = \\rho (V\\Delta t)A \\) and ultimately, \\( \\dot{m} = \\rho VA \\).",
                                    "text": "Mass flow rate \\( \\dot{m} = \\rho Q \\) where \\( Q \\) is the volumetric flow rate. \\( \\dot{m} = \\rho AV \\).\\n\\nVolumetric flow rate \\( Q = AV \\).\\n\\nWait for time \\( \\Delta t \\). How much fluid is collected?\\n\\n\\( \\Delta m = \\rho (V\\Delta t)A \\).\\n\\n\\( \\frac{\\Delta m}{\\Delta t} = \\rho VA \\).\\n\\nTherefore, \\( \\dot{m} = \\rho VA \\).",
                                    "image_description": "The diagram shows a cylindrical pipe with fluid flowing through it at velocity \\( V \\) and cross-sectional area \\( A \\). It illustrates the concept of volumetric flow rate \\( Q = AV \\) and mass flow rate \\( \\dot{m} = \\rho Q = \\rho AV \\). There is a depiction of fluid moving through a length of \\( V\\Delta t \\) over time \\( \\Delta t \\), with the collected fluid represented in a container. Equations related to mass flow rate and volumetric flow are annotated around the diagrams."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the concept of balances within a control volume, focusing on the rate at which a quantity \\( \\dot{X} \\) enters, transfers, generates, and exits the volume. The general balance equation is \\( \\dot{X}_{in} + \\dot{X}_{transf} + \\dot{X}_{gen} - \\dot{X}_{out} = \\frac{dX_{cv}}{dt} \\). Different quantities such as mass, energy, linear momentum, angular momentum, entropy, and chemical species are considered for this balance.",
                                    "text": "\\dot{X}_{in} = \\text{rate at which quantity X enters the volume} \\newline \\dot{X}_{transf} = \\text{transferred at boundary} \\newline \\dot{X}_{gen} = \\text{rate at which X is generated in the control volume} \\newline \\dot{X}_{in} + \\dot{X}_{transf} + \\dot{X}_{gen} - \\dot{X}_{out} = \\frac{dX_{cv}}{dt} \\newline X: \\text{mass, energy, linear momentum, angular momentum, entropy, chemical species}",
                                    "image_description": "The image shows a control volume with arrows indicating \\( \\dot{X}_{in} \\), \\( \\dot{X}_{out} \\), \\( \\dot{X}_{transf} \\), and \\( \\dot{X}_{gen} \\). It visually represents the process of balancing the quantities entering, transferring, being generated, and leaving the control volume."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the concept of mass balance in a fluid flow system. It explains that for a steady state, the change in mass within the control volume is zero, leading to constant mass in the control volume. The assumption is made that the generation of mass is zero, so the mass entering equals the mass leaving the system. An example is provided with a diagram of a flow system, illustrating the principle of incompressible flow where the density remains constant and the product of area and velocity at one point equals the product of area and velocity at another point.",
                                    "text": "Mass balance: \\[ \\dot{m}_{in} - \\dot{m}_{out} + \\dot{m}_{gen} = \\frac{dm_{cv}}{dt} \\] Steady state: \\[ \\frac{dm_{cv}}{dt} = 0 \\Rightarrow m_{cv} = \\text{constant} \\] Assume: \\[ \\dot{m}_{gen} = 0 \\] \\[ \\dot{m}_{in} = \\dot{m}_{out} \\] Example: \\[ \\dot{m}_{in} = \\dot{m}_{out} \\] \\[ \\rho_1 A_1 V_1 = \\rho_2 A_2 V_2 \\] Assume incompressible flow \\[ \\rho_1 = \\rho_2 \\] \\[ A_1 V_1 = A_2 V_2 \\]",
                                    "image_description": "The image shows a diagram of a fluid flow system with a narrowing section. It includes labels for velocities (V1, V2) and diameters (d1, d2) at two different points in the flow."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The slide explains the process of determining the resulting pressure of air in a tank after a valve is opened for a certain period. It uses the principles of fluid dynamics and thermodynamics, assuming an isothermal process. The initial conditions include pressure $p_i$ and temperature $T_i$. The mass flow equations are set up with the assumption that the mass is conserved and no mass is generated. The main equation derived is $p(t) = p_i e^{-\\frac{Q}{V}t}$, where $Q$ is the rate of flow and $V$ is the volume.",
                                    "text": "\\dot{m}_{in} - \\dot{m}_{out} + \\dot{m}_{gen} = \\frac{dm_{cv}}{dt} \\\\\n\\dot{m}_{in} = 0 \\\\\n\\dot{m}_{out} = \\rho Q \\\\\n\\dot{m}_{gen} = 0 \\\\\nm_{cv} = \\frac{PV}{RT} \\\\\n\\frac{d}{dt}\\left(\\frac{pV}{RT}\\right) = -\\rho_{i}Q \\\\\n\\frac{V}{RT} \\frac{dp}{dt} = -\\frac{p}{RT} Q \\\\\np(t) \\int_{p_i}^{p(t)} \\frac{dp}{p} = -\\int_{0}^{t} \\frac{Q}{V} dt \\\\\n\\ln p(t) \\Big|_{p_i}^{p(t)} = -\\frac{Q}{V} t \\\\\n\\ln p(t) - \\ln p_i(t) \\\\\n\\ln \\frac{p(t)}{p_{i}(t)} = -\\frac{Q}{V} t \\\\\n\\Rightarrow \\quad p(t) = p_i e^{-\\frac{Q}{V} t} \\\\\nQ/V = \\text{rate}",
                                    "image_description": "The image is a sketch of a tank containing gas with initial pressure $p_i$. It includes a valve that can be opened to let gas out. There are equations and notes around the sketch describing the mass flow and pressure changes."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide covers the concept of energy balance within a control volume, focusing on the equation for the rate of energy input, output, transfer, and generation. The equation is given as \\( \\dot{E}_{\\text{in}} - \\dot{E}_{\\text{out}} + \\dot{E}_{\\text{transf}} + \\dot{E}_{\\text{gen}} = \\frac{dE_{cv}}{dt} \\). It breaks down the energy terms into specific components, such as specific energy, kinetic energy, potential energy, and flow work. There is also a consideration of volumetric flow rates and power work equations, with a diagram illustrating a control volume with an inflow and outflow system.",
                                    "text": "\\( \\dot{E}_{\\text{in}} - \\dot{E}_{\\text{out}} + \\dot{E}_{\\text{transf}} + \\dot{E}_{\\text{gen}} = \\frac{dE_{cv}}{dt} \\)\n\n\\( \\dot{E}_{\\text{in}} = \\dot{m}_{\\text{in}} e_i \\quad (e_i = \\text{specific energy}) \\)\n\\( = m_i \\left[ \\frac{1}{2} v_i^2 + g z_i + u_i \\right] \\)\n\\( \\dot{E}_{\\text{out}} = m_o \\left[ \\frac{1}{2} v_o^2 + g z_o + u_o \\right] \\)\n\\( \\dot{E}_{cv} = \\dot{m}_{cv} \\left[ \\frac{1}{2} v^2 + g z + U \\right] \\)\n\n\\( \\dot{W} = \\dot{W}_{\\text{flow}} + \\dot{W}_{\\text{non-flow}} \\)\n\\( W_{\\text{power}} = P \\Delta V \\rightarrow \\text{change in volume} \\rightarrow \\text{volumetric flow rate} \\)\n\\( = P Q \\Delta t \\)\n\\( W_{\\text{flow}} = \\dot{W}_{\\text{flow}} = PQ \\)\n\\( \\frac{W}{\\Delta t} = \\frac{P \\dot{m}}{\\rho} \\)\n\\( \\dot{m} = \\rho Q \\Rightarrow Q = \\frac{\\dot{m}}{\\rho} \\)",
                                    "image_description": "The image is a diagram showing a control volume with an inflow and outflow system. It includes labels such as pressure \\( P \\), volumetric flow rate \\( Q \\), and various energy terms."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide focuses on energy analysis in thermodynamics, particularly under steady-state conditions. It presents various forms of the energy equation for a control volume, with assumptions such as steady-state and no energy generation. The equations consider mass flow rates, specific internal energy, pressure, velocity, gravitational potential energy, heat transfer, and work done by non-flow processes. Friction heating is also introduced as a factor in the energy balance.",
                                    "text": "Assume Steady State: \\( \\frac{dE_{cv}}{dt} = 0 \\), \\( \\dot{E}_{gen} = 0 \\) \n\n\\( \\dot{m}_i \\left[ \\frac{1}{2} v_i^2 + g z_i + u_i \\right] - \\dot{m}_o \\left[ \\frac{1}{2} v_o^2 + g z_o + u_o \\right] + \\dot{Q} + \\dot{m}_i \\frac{P_i}{\\rho_i} - \\dot{m}_o \\frac{P_o}{\\rho_o} + \\dot{W}_{non-flow} = 0 \\)\n\n\\( \\dot{m}_i \\left[ u_i + \\frac{P_i}{\\rho_i} + \\frac{1}{2} v_i^2 + g z_i \\right] - \\dot{m}_o \\left[ u_o + \\frac{P_o}{\\rho_o} + \\frac{1}{2} v_o^2 + g z_o \\right] + \\dot{Q} + \\dot{W}_{non-flow} = 0 \\)\n\n\\( \\dot{m}_i \\left[ \\frac{P_i}{\\rho_i} + \\frac{1}{2} v_i^2 + g z_i \\right] - \\dot{m}_o \\left[ \\frac{P_o}{\\rho_o} + \\frac{1}{2} v_o^2 + g z_o \\right] + (\\dot{Q} + \\dot{m}_i u_i - \\dot{m}_o u_o) + \\dot{W}_{non-flow} = 0 \\)\n\n\\( \\dot{Q} + \\dot{m}_i u_i - \\dot{m}_o u_o \\triangleq \\mathcal{F} \\) (friction heating)\n\n\\( \\dot{m}_i \\left[ \\frac{P_i}{\\rho_i} + \\frac{1}{2} v_i^2 + g z_i \\right] - \\dot{m}_o \\left[ \\frac{P_o}{\\rho_o} + \\frac{1}{2} v_o^2 + g z_o \\right] + \\dot{W}_{non-flow} - \\mathcal{F} = 0 \\)",
                                    "image_description": "The image is a handwritten slide with equations related to energy analysis in thermodynamics. It includes terms for steady-state assumptions, mass flow rates, specific internal energy, pressure, velocity, gravitational potential energy, heat transfer, and work done by non-flow processes. There is also a mention of friction heating in one of the equations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "This slide discusses the application of the Bernoulli equation and energy equation in fluid dynamics. It starts with the assumption that the mass flow rate \\( \\dot{m} \\) is constant. The energy equation is formulated by dividing by \\( \\dot{m} \\), leading to a form that includes pressure, velocity, elevation, turbine/pump head, and head loss terms. The slide further simplifies the equations into the 'head form' by dividing by gravitational acceleration \\( g \\), resulting in terms for pressure head, velocity head, elevation, turbine/pump head, and head loss. The energy equation and Bernoulli's equation are highlighted as key concepts.",
                                    "text": "Let \\( \\dot{m} = \\dot{m}_i = \\dot{m}_o = \\dot{m} \\). Divide by \\( \\dot{m} \\).\n\\[\n\\left( \\frac{P_i}{\\rho_i} + \\frac{1}{2}v_i^2 + gz_i \\right) - \\left( \\frac{P_o}{\\rho_o} + \\frac{1}{2}v_o^2 + gz_o \\right) + \\frac{\\dot{W}}{\\dot{m}} - \\frac{F}{\\dot{m}} = 0\n\\] with \\( \\omega \\to 0 \\) and \\( F \\to 0 \\).\n\\[\n\\frac{P_i}{\\rho_i} + \\frac{1}{2}v_i^2 + gz_i = \\frac{P_o}{\\rho_o} + \\frac{1}{2}v_o^2 + gz_o \\] \\( \\Leftarrow \\) Bernoulli's equation.\n\\[\n\\frac{P_i}{\\rho_i} + \\frac{1}{2}v_i^2 + gz_i + \\frac{\\dot{W}}{\\dot{m}} - \\frac{F}{\\dot{m}} = \\frac{P_o}{\\rho_o} + \\frac{1}{2}v_o^2 + gz_o\n\\]\nHead form: Divide by \\( g \\).\n\\[\n\\left( \\frac{P_i}{\\rho g} + \\frac{1}{2}\\frac{v_i^2}{g} + z_i \\right) + \\frac{\\dot{W}}{\\dot{m}g} - \\frac{F}{\\dot{m}g} = \\frac{P_o}{\\rho g} + \\frac{1}{2}\\frac{v_o^2}{g} + z_o\n\\]\nPressure head, velocity head, elevation, turbine/pump head, head loss.",
                                    "image_description": "The slide contains handwritten equations related to fluid dynamics. It begins with the energy equation, showing terms for pressure, velocity, and gravitational potential energy, divided by mass flow rate. It transitions to Bernoulli's equation and simplifies the equations to head form by dividing by gravitational acceleration. The head form identifies different types of 'head': pressure head, velocity head, elevation, turbine/pump head, and head loss, each annotated with arrows. The slide is labeled 'F7' in the upper right corner."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "This slide explains the principles of fluid flow measurement using a Pitot tube and a Venturi meter. It begins with the Bernoulli equation applied to a Pitot tube setup to determine fluid velocity. It then extends the analysis to a Venturi meter, considering mass balance and energy conservation to find the flow rate. The equations detail how pressure differences and cross-sectional areas relate to velocity and flow rate in these devices.",
                                    "text": "Pitot tube: \\frac{p_1}{\\rho} + \\frac{V_1^2}{2} + gz_1 = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + gz_2 \\\\\n\\frac{p_1}{\\rho} + \\frac{V^2}{2} = \\frac{p_2}{\\rho} \\Rightarrow \\\\\nv_1 = \\sqrt{\\frac{(p_2 - p_1)}{\\rho}} \\\\\n\nVenturi meter: \\frac{p_1}{\\rho} + \\frac{V_1^2}{2} = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} \\quad \\text{<- Energy} \\\\\n\\text{Mass Balance: } Q = A_1v_1 = A_2v_2 \\\\\nv_1 = Q/A_1 , \\; v_2 = Q/A_2 \\\\\n\\frac{p_1}{\\rho} + \\frac{Q^2}{2A_1^2} = \\frac{p_2}{\\rho} + \\frac{Q^2}{2A_2^2} \\\\\nQ^2\\left[\\frac{1}{2A_2^2} - \\frac{1}{2A_1^2}\\right] = \\frac{p_1 - p_2}{\\rho} \\\\\nQ = \\sqrt{\\frac{p_1 - p_2}{\\rho \\left(\\frac{1}{2A_2^2} - \\frac{1}{2A_1^2}\\right)}}",
                                    "image_description": "The image contains diagrams of a Pitot tube and a Venturi meter, illustrating fluid flow through these devices. The Pitot tube is shown with a manometer connected to measure pressure differences. The Venturi meter diagram shows a constricted section where velocity and pressure changes occur. Equations are provided next to each diagram to explain the calculations for velocity and flow rate based on pressure differences."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses fluid dynamics focusing on Torricelli's law for fluid outflow from a tank. It derives the velocity of fluid exiting a hole at the bottom of a tank using Bernoulli's equation and mass balance, assuming the second area is much smaller than the first, leading to simplifications. Torricelli's equation is introduced, and the coefficient of discharge is defined as the ratio of actual to theoretical velocity. Diagrams illustrate the flow from the tank through an opening.",
                                    "text": "\\begin{align*}\n&\\text{Mass balance:} \\quad A_1V_1 = A_2V_2 \\implies V_1 = \\left(\\frac{A_2}{A_1}\\right)V_2 \\\\\n&\\text{If } A_2 \\ll A_1, \\quad V_1 \\ll V_2 \\implies V_1^2 \\ll V_2^2 \\implies V_1^2 \\approx 0 \\\\\n&\\frac{p_1}{\\rho} + \\frac{V_1^2}{2} + g z_1 = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + g z_2 \\\\\n&\\frac{p_0}{\\rho} + \\frac{V_1^2}{2} + g(0) = \\frac{p_0}{\\rho} + \\frac{V_2^2}{2} + g(-H) \\\\\n&\\frac{V_1^2}{2} + \\frac{V_2^2}{2} = -gH \\\\\n&0 = \\frac{V_2^2}{2} - gH \\\\\n&\\Rightarrow V_2 = \\sqrt{2gH} \\quad \\leftarrow \\text{Torricelli's equation} \\\\\n&\\text{Define } C_D \\triangleq \\frac{V_a}{\\sqrt{2gH}} \\quad \\text{coefficient of discharge} \\\\\n\\end{align*}",
                                    "image_description": "The image contains a diagram of a fluid tank with a hole at the bottom, illustrating the fluid flow. Equations derived are shown, leading to Torricelli's equation. There are sketches showing different stages of fluid flow through an opening, depicting the concept of discharge."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_9.png"
                            }
                        ]
                    },
                    {
                        "10": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide explains the concept of a siphon, using Bernoulli's equation to derive the velocity of liquid flow. It describes the pressure and velocity changes along the siphon, equating the conditions at two points in the system. The final expression shows the velocity at point 2 as a function of gravitational acceleration and height difference.",
                                    "text": "Siphon \\( \\frac{P_1}{\\rho} + \\frac{v_1^2}{2} + gz_1 = \\frac{P_2}{\\rho} + \\frac{v_2^2}{2} + gz_2 \\) \\( \\frac{P_a}{\\rho} + 0 + 0 = \\frac{P_a}{\\rho} + \\frac{v_2^2}{2} - g(H_1) \\) \\( (v_1 \\approx 0) \\) \\( \\Rightarrow v_2 = \\sqrt{2gH_1} \\)",
                                    "image_description": "The image shows a siphon diagram with two containers at different heights. It labels various heights and points along the siphon, including \\( H_0 \\), \\( H_1 \\), and \\( H \\). The diagram is used to illustrate the application of Bernoulli's equation."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_06\\Lecture_02_06_page_10.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_02_08": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Fluid Flow and Energy Balance in Pipelines",
                    "lecture_subtitle": "Analyzing Mass and Energy Conservation Equations in Fluid Systems",
                    "summary": "This lecture focuses on the principles of mass and energy balance in fluid systems, specifically within the context of pipelines. It begins with the fundamental mass balance equation, emphasizing the steady-state condition where the mass flow rate in equals the mass flow rate out. The lecture then transitions to the energy balance equation, incorporating terms for work and heat transfer. Through practical examples and diagrams, the lecture explores the application of Bernoulli’s equation, the concept of vapor pressure, and the calculation of fluid velocity in various scenarios. Key considerations include the distinction between major and minor losses in pipelines, calculated using the Darcy-Weisbach equation and minor loss coefficients. Additionally, the lecture discusses flow regimes characterized by the Reynolds number and the associated friction factor calculations using Colebrook’s equation.",
                    "key_concepts": [
                        {
                            "keyword": "Mass Balance",
                            "description": "The mass balance equation is expressed as $\\dot{m}_{in} - \\dot{m}_{out} + \\dot{m}_{gen} = \\frac{dm_{cv}}{dt}$. For steady state with no generation, $\\dot{m}_{in} = \\dot{m}_{out}$."
                        },
                        {
                            "keyword": "Energy Balance",
                            "description": "The energy balance equation for steady state is shown as $\\frac{\\dot{Q} + \\dot{W}}{\\dot{m}} + \\dot{E}_{gen} = \\frac{d\\dot{E}_{cv}}{dt}$. It incorporates changes in pressure, velocity, and height."
                        },
                        {
                            "keyword": "Bernoulli's Equation",
                            "description": "Derived from the energy balance, Bernoulli’s equation for fluid flow is $\\frac{P_1}{\\rho} + \\frac{V_1^2}{2} + g z_1 = \\frac{P_2}{\\rho} + \\frac{V_2^2}{2} + g z_2$."
                        },
                        {
                            "keyword": "Vapor Pressure",
                            "description": "The vapor pressure is the pressure at which a fluid changes phase. It is considered in energy balance to prevent cavitation."
                        },
                        {
                            "keyword": "Darcy-Weisbach Equation",
                            "description": "Used to calculate major losses in pipelines, expressed as $h_{major} = f \\frac{L}{D} \\frac{V^2}{2g}$, where $f$ is the friction factor."
                        },
                        {
                            "keyword": "Reynolds Number",
                            "description": "A dimensionless number used to predict flow regimes, given by $Re = \\frac{\\rho VD}{\\mu}$, indicating laminar or turbulent flow."
                        },
                        {
                            "keyword": "Colebrook's Equation",
                            "description": "An empirical relation used to calculate the friction factor $f$ for turbulent flows, expressed as $\\frac{1}{\\sqrt{f}} = -2 \\log_{10} \\left( \\frac{\\epsilon/D}{3.7} + \\frac{2.51}{Re \\sqrt{f}} \\right)$."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Continuity Equation",
                            "description": "A principle stating that mass is conserved in a fluid flow system, leading to $A_1V_1 = A_2V_2$ for incompressible flow."
                        },
                        {
                            "keyword": "Conservation of Energy",
                            "description": "The principle that energy cannot be created or destroyed, only transformed, forming the basis of Bernoulli’s and energy balance equations."
                        },
                        {
                            "keyword": "Fluid Dynamics",
                            "description": "The study of fluid flow behavior, including velocity, pressure, and viscosity, essential for understanding the balance equations."
                        }
                    ],
                    "search_keywords": [
                        "mass and energy balance in fluid systems",
                        "Darcy-Weisbach equation applications",
                        "Reynolds number and flow regimes"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses mass and energy balance equations for steady-state conditions with no mass generation. It starts with the mass balance equation, stating that the rate of mass entering a system equals the rate of mass leaving it, with no generation or accumulation. The energy balance equation follows, incorporating terms for kinetic and potential energy, work, and heat transfer. For steady-state conditions, the equation simplifies to equate incoming and outgoing energy terms, accounting for non-flow work and frictional losses. The equations use standard symbols for pressure, velocity, gravity, and elevation.",
                                    "text": "Balance \\newline \\text{Mass Balance} \\newline \\dot{m}_{in} - \\dot{m}_{out} + \\dot{m}_{gen} = \\frac{d m_{cv}}{dt} \\newline \\text{For steady state: } \\dot{m}_{in} = \\dot{m}_{out} \\newline \\text{with no generation} \\newline \\dot{m}_{in} = \\rho A V \\newline \\text{Energy Balance} \\newline \\dot{m}_{i} e_{i} - \\dot{m}_{o} e_{o} + \\dot{E}_{gen} = \\frac{d \\dot{E}_{cv}}{dt} \\newline \\left( \\frac{P_1}{\\rho_1} + \\frac{V_1^2}{2} + g z_1 \\right) - \\left( \\frac{P_2}{\\rho_2} + \\frac{V_2^2}{2} + g z_2 \\right) + \\frac{\\dot{W}_{non-flow}}{\\dot{m}} - \\frac{F}{\\dot{m}} = 0 \\newline (\\text{Steady state}) \\newline \\left( \\frac{P_1}{\\rho_1} + \\frac{V_1^2}{2} + g z_1 \\right) + \\frac{\\dot{W}_{non-flow}}{\\dot{m}} - \\frac{F}{\\dot{m}} = \\rho \\left( \\frac{P_2}{\\rho} + \\frac{V_2^2}{2} + g z_2 \\right)",
                                    "image_description": "The image contains handwritten equations related to mass and energy balance. There are sections labeled 'Mass Balance' and 'Energy Balance.' The mass balance equation includes terms for mass flow rates in and out, with a generation term and derivative of mass with respect to time. The energy balance section includes terms for pressure, velocity, gravitational potential energy, non-flow work, and frictional losses. The equations are set for steady-state conditions, where the rate of change is zero."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "The lecture focuses on fluid dynamics principles, particularly mass balance and Bernoulli's equation applied to a siphon-like system. It discusses the velocity and pressure relations between different points in the system and derives equations for those values using assumptions such as negligible initial velocity and large area differences between sections of the system.",
                                    "text": "\\frac{p_a}{\\rho} + \\frac{V_1^2}{2} + g(0) + 0 - 0 = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + g(-H) \\\\\n\\text{Mass Balance: } A_1 V_1 = A_2 V_2 \\\\\nV_1 = \\frac{A_2}{A_1} V_2 \\\\\n\\text{Since } A_1 \\gg A_2, \\\\\n\\frac{A_2}{A_1} \\ll 1 \\\\\n\\Rightarrow V_1 \\ll V_2 \\\\\n\\Rightarrow V_1 \\approx 0. \\\\\n\\frac{V_2^2}{2} - g H = 0 \\Rightarrow V_2 = \\sqrt{2gH} \\\\\n\\text{1-3; } \\frac{p_a}{\\rho} + \\frac{V_1^2}{2} + g(0) = \\frac{p_3}{\\rho} + \\frac{V_3^2}{2} + g H_1 \\\\\nV_1 \\approx 0 \\\\\n\\frac{p_a - p_3}{\\rho} = \\frac{V_3^2}{2} + g H_1 \\\\\n= \\frac{2gH}{2} + gH_1 \\\\\n= g(H+H_1) \\\\\n\\frac{p_a}{\\rho} - g(H+H_1) = \\frac{p_3}{\\rho} \\\\\n\\text{Vapor pressure} \\\\\n\\bar{p_3} = p_{vapor}\\\\text{ @temperature of fluid}",
                                    "image_description": "The image depicts a siphon system with three points labeled 1, 2, and 3. Point 1 is inside a container, point 2 is at the bottom of the siphon outside the container, and point 3 is at the top of the siphon. The diagram includes variables such as $H$, $H_1$, $A_1$, $A_2$, and indicates the flow direction. Equations and annotations related to fluid dynamics are written around the diagram."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The slide addresses the problem of calculating the time it takes for a fluid to drop from an initial height $H_0$ to a height $H_1$. It uses concepts from fluid dynamics, including mass flow rate, density, and cross-sectional area. The equation for the change in mass over time is equated to the difference between inflow and outflow rates. The outflow rate is derived using the equation $V = \\sqrt{2gH}$, and the final expression for time involves integrating the equation $\\frac{dh}{dt} = -\\frac{\\rho A_p \\sqrt{2g}}{A_t} \\sqrt{h}$. The resulting time equation is $H_1^{1/2} - H_0^{1/2} = -\\frac{A_p}{A_t} \\sqrt{\\frac{2g}{t}}$.",
                                    "text": "The problem given is to find the time it takes for a fluid to drop from an initial height $H_0$ to a lower height $H_1$. The flow velocity is given by $V = \\sqrt{2gH}$. The initial height of the fluid is $H_0$. The goal is to calculate the time for the fluid to drop to $H_1$. The mass flow rates are considered: \\( \\dot{m}_{in} - \\dot{m}_{out} = \\frac{dm_{cv}}{dt} \\), where \\( \\dot{m}_{in} = 0 \\) and \\( \\dot{m}_{out} = \\rho A_p V_r = \\rho A_p \\sqrt{2gH} \\). The mass in the control volume is \\( m_{cv} = \\rho A_t h \\). The rate of change of mass in the control volume is \\( \\frac{dm_{cv}}{dt} = \\rho A_t \\frac{dh}{dt} \\). By equating the mass flow rates, we derive \\( \\frac{dh}{dt} = -\\frac{\\rho A_p \\sqrt{2g}}{A_t} \\sqrt{h} \\). This equation is integrated to obtain \\( H_1^{1/2} - H_0^{1/2} = -\\frac{A_p}{A_t} \\sqrt{2g} t \\).",
                                    "image_description": "The image shows a diagram of a fluid container with a fluid height labeled as $h$, initial height $H_0$, and a target height $H_1$. The flow rate is indicated with arrows, and there are mathematical equations written by hand to derive the time it takes for the fluid to drop to $H_1$. There are annotations such as $A_p$ for the cross-sectional area of the pipe and $A_t$ for the cross-sectional area of the tank."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The lecture material is about fluid mechanics, specifically focusing on flow over a notch-weir. It uses Bernoulli's equation to derive the expression for velocity and discharge over a weir. The process involves integrating the flow rate across the depth of the fluid.",
                                    "text": "p_1/\\rho + \\frac{v_1^2}{2} + gz_1 = p_2/\\rho + \\frac{v_2^2}{2} + gz_2 \n\\\\\n\\frac{pgh}{\\rho} + gh = 0 + \\frac{v_2^2}{2} + gh \\Rightarrow v_2 = \\sqrt{2gh}\n\\\\\ndQ = v_2 dA = v_2 dhL\n\\\\\ndQ = \\sqrt{2gh} dhL\n\\\\\nQ = \\int_0^H \\sqrt{2gh} dh L = \\sqrt{2g} L \\int_0^H h^{1/2} dh\n\\\\\n= \\sqrt{2g} L \\frac{H^{3/2}}{3/2}\n\\\\\n= \\frac{2}{3} \\sqrt{2g} L H^{3/2}",
                                    "image_description": "The image consists of three diagrams labeled 1, 2, and 3. Diagram 1 shows a side view of a notch-weir with water flowing over it. Diagram 2 shows a cross-section of the weir. Diagram 3 shows a 3D view of the weir setup."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the calculation of the required power to move a fluid through a system, using Bernoulli's equation and considering the head difference. The power needed is calculated using the flow rate and the gravitational constant, leading to a result of approximately 1.1 kW.",
                                    "text": "\\frac{p_1}{\\rho} + \\frac{v_1^2}{2} + g\\, z_1 + \\frac{\\dot{W}_{nf}}{\\dot{m}} = \\frac{p_2}{\\rho} + \\frac{v_2^2}{2} + g\\, z_2 \\\\\np_1 = p_2 = p_0 \\\\\nv_1 \\approx v_2 \\approx 0 \\\\\n\\frac{\\dot{W}_{nf}}{\\dot{m}} = g\\,(z_2 - z_1) \\\\\n= g\\,(H_d + H_s) \\\\\n\\dot{W}_{nf} = \\dot{m}\\,g\\,(H_d + H_s) \\\\\n\\dot{\\hat{W}}_{nf} = (\\rho Q)\\,g\\,(H_d + H_s) \\\\\n= (10^3)(10 \\times 10^{-3})(9.81)(10+1) \\\\\n\\approx 1.1 \\text{ kW} \\\\\nH_d = 10 \\text{ m} \\\\\nH_s = 1 \\text{ m} \\\\\nQ = 10 \\text{ liter/s} \\\\\n1 \\text{ m}^3 = 10^3 \\text{ liter} \\\\\n1 \\text{ liter} = 10^{-3} \\text{ m}^3",
                                    "image_description": "The diagram shows a fluid system with a pump, labeled as 1, and a reservoir, labeled as 2. The height difference between the pump and the reservoir is shown as H_d, and a smaller height difference at the pump's location is shown as H_s. The diagram is used to illustrate the calculation of power needed to move the fluid."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the concept of losses in fluid flow, specifically major and minor losses. Major losses occur due to flow through ducts or pipes and are calculated using the Darcy-Weisbach friction factor. Minor losses are associated with bends, joints, fittings, valves, and contractions or expansions in the flow path. The losses are proportional to the velocity squared, $\\frac{V^2}{2}$. The major loss is given by the equation $(gh_{\\text{major}}) = f \\frac{L}{D} \\left(\\frac{V^2}{2}\\right)$, where $f$ is the Darcy-Weisbach friction factor. The minor loss is given by $gh_{\\text{minor}} = k \\frac{V^2}{2}$, where $k$ is the minor loss coefficient.",
                                    "text": "Losses are categorized into major and minor losses. Major losses occur during flow through ducts or pipes, while minor losses are associated with bends, joints, fittings, valves, and contractions or expansions. Losses are proportional to $\\frac{V^2}{2}$. Major loss is given by the equation $(gh_{\\text{major}}) = f \\frac{L}{D} \\left(\\frac{V^2}{2}\\right)$, where $f$ is the Darcy-Weisbach friction factor. Minor loss is given by $gh_{\\text{minor}} = k \\frac{V^2}{2}$, where $k$ is the minor loss coefficient.",
                                    "image_description": "The slide contains handwritten notes explaining the concept of fluid flow losses. It includes equations for major and minor losses, with annotations for the Darcy-Weisbach friction factor and minor loss coefficients. There are arrows and underlines emphasizing key points in the explanation."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses flow in pipes, focusing on different types of flow: laminar, transition, and turbulent. It introduces the Reynolds number \\( Re \\) as a key parameter for characterizing flow regimes, defined as \\( Re = \\frac{\\rho VD}{\\mu} = \\frac{VD}{\\nu} \\), where \\( \\nu \\) is the kinematic viscosity. The slide specifies the ranges for different flow types: laminar flow for \\( 0 < Re < 2000 \\) and turbulent flow for \\( Re > 4000 \\). It also covers the friction factor \\( f \\), providing the formula \\( f = \\frac{64}{Re} \\) for laminar flow and introduces Colebrook's equation for turbulent flow: \\( \\frac{1}{\\sqrt{f}} = -2 \\log_{10} \\left( \\frac{\\epsilon/D}{3.7} + \\frac{2.51}{Re\\sqrt{f}} \\right) \\). An approximation for \\( f \\) is given as \\( f = \\left[ 0.25 / \\left( \\log_{10} \\left( \\frac{\\epsilon/D}{3.7} + \\frac{5.74}{Re^{0.9}} \\right) \\right)^2 \\right] \\).",
                                    "text": "Flow in pipes: Laminar, Transition, Turbulent. Reynolds number \\( Re = \\frac{\\rho VD}{\\mu} = \\frac{VD}{\\nu} \\) (since \\( \\nu = \\mu / \\rho \\), kinematic viscosity). Laminar for \\( 0 < Re < 2000 \\), Turbulent for \\( Re > 4000 \\). Friction factor \\( f = \\frac{64}{Re} \\) for laminar flow. Colebrook's equation: \\( \\frac{1}{\\sqrt{f}} = -2 \\log_{10} \\left( \\frac{\\epsilon/D}{3.7} + \\frac{2.51}{Re\\sqrt{f}} \\right) \\). Approximation: \\( f = \\left[ 0.25 / \\left( \\log_{10} \\left( \\frac{\\epsilon/D}{3.7} + \\frac{5.74}{Re^{0.9}} \\right) \\right)^2 \\right] \\). \\( D \\) is the diameter of the pipe, and \\( \\epsilon \\) is the surface roughness.",
                                    "image_description": "The image contains handwritten notes on flow in pipes, focusing on laminar, transition, and turbulent flow. It includes equations for the Reynolds number, friction factor, and Colebrook's equation. There are annotations explaining terms like kinematic viscosity and variables such as diameter and surface roughness."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The slide provides a detailed analysis of fluid flow through pipes, focusing on major loss calculations using the Bernoulli equation and Reynolds number. It includes calculations for flow rate, velocity, and friction factor, indicating turbulent flow.",
                                    "text": "\\frac{p_1}{\\rho} + \\frac{v_1^2}{2} + gz_1 + \\frac{\\dot{W}_{\\text{sh}}}{\\dot{m}} = \\frac{p_2}{\\rho} + \\frac{v_2^2}{2} + gz_2 \\\\\nH_f = 10 \\\\\n\\frac{\\dot{W}_{\\text{sh}}}{\\dot{m}} = (gh)_l + g(z_2 - z_1) \\\\\n\\text{Major Loss }\\quad (gh)_{\\text{major}} = f\\frac{L}{D} \\frac{V^2}{2} \\\\\nRe = \\frac{\\rho VD}{\\mu} = \\frac{VD}{\\nu} \\\\\nQ = 10 \\text{ liter/s} \\\\\nD = 25 \\text{ mm} \\\\\n\\varepsilon = 1 \\mu m \\\\\n\\nu = 10^{-6} \\text{ m}^2/\\text{s} \\\\\nA = \\frac{\\pi}{4} \\times (0.025)^2 = 4.91 \\times 10^{-4} \\text{m}^2 \\\\\nQ = AV \\Rightarrow V = \\frac{Q}{A} = \\frac{10 \\times 10^{-3}}{4.91 \\times 10^{-4}} = 20.4 \\text{ m/s} \\\\\nRe = \\frac{(60.4)(25 \\times 10^{-3})}{10^{-6}} = 509296 > 2300 \\quad \\Rightarrow \\text{turbulent} \\\\\nf = 0.25 \\left[\\log_{10}\\left(\\frac{1 \\times 10^{-6}}{25 \\times 10^{-3} \\times 3.7} + \\frac{5.74}{509296^{0.9}}\\right)\\right]^{-2} = 0.021",
                                    "image_description": "A diagram showing a fluid flow system with labeled dimensions and variables such as K=0.5, H_s, and distances. Equations and calculations are neatly organized around it."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide provides a calculation of major and minor losses in fluid flow and the subsequent determination of power requirements. Major loss is calculated using the formula involving a friction factor, pipe length, pipe diameter, and velocity. Minor losses are calculated using a sum of loss coefficients multiplied by the velocity head. The total head loss is then used to calculate the power requirement, considering both the total head loss and the gravitational potential energy. The final power requirement is calculated to be 34.58 kW.",
                                    "text": "Major \\text{ loss} = \\left(0.021\\right)\\left(15\\right)\\frac{\\left(20.4\\right)^2}{\\left(25\\times10^{-3}\\right)\\left(2\\right)} = 2641.8 \\\\\n\\text{Minor loss} = \\frac{K\\frac{V^2}{2}}{z} = \\left(1+0.5+0.5+0.5+1\\right)\\left(\\frac{\\left(20.4\\right)^2}{2}\\right) = \\left(3.5\\right)\\left(\\frac{\\left(20.4\\right)^2}{2}\\right) = 728.3 \\\\\n\\left(gh\\right) = 2641.8 + 728.3 = 3350.1 \\\\\n\\frac{\\dot{W}_{nf}}{\\dot{m}} = \\left(3350.1\\right) + \\left(9.81\\right)\\left(11\\right) = 3458 \\\\\n\\dot{W}_{nf} = \\left(\\dot{m}\\right)\\left(3458\\right) = \\left(10^3\\right)\\left(10\\times10^{-3}\\right)\\left(3458\\right) = 34.58 \\, \\text{kW}",
                                    "image_description": "The image contains handwritten calculations showing the steps to determine the major and minor losses in a fluid system, and how these losses contribute to the total head loss and power requirement. The calculations involve using formulas with variables like friction factor, velocity, and pipe dimensions. The final result is a power requirement of 34.58 kW."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_9.png"
                            }
                        ]
                    },
                    {
                        "10": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the calculation of vapor pressure and height difference in a vacuum pump system. It shows how to calculate the height \\( H_1 \\) given the vapor pressure at a certain temperature using the formula \\( \\frac{P_a}{\\rho} - g(H + H_1) = \\frac{P_b}{\\rho} \\). The temperature of the water is given as 30°C, and the vapor pressure \\( P_{vap} \\) is 0.04246 bar, equivalent to 4.246 kPa (absolute). By setting \\( H = 1 \\) m, the equation is solved to find \\( H_1 = 9.1 \\) m.",
                                    "text": "Temperature of water = 30°C\\nP_{vap} = 0.04246 \\text{ bar} = 4.246 \\text{ kPa (abs)}\\n\\n\\frac{P_a}{\\rho} - g(H + H_1) = \\frac{P_b}{\\rho}\\n\\n\\text{Let } H = 1 \\text{ m}\\n\\n101.3 - (9.81)(1 + H_1) = 4.246\\n\\n\\frac{101.3 - 4.246}{9.81} = H_1 + 1 \\Rightarrow H_1 = 9.1 \\text{ m}",
                                    "image_description": "The image shows a diagram of a vacuum pump system with vapor coming off a liquid surface. The system is connected to a vacuum pump. There are handwritten notes indicating the vapor pressure and calculations for determining the height \\( H_1 \\). The diagram is labeled with variables and their respective values used in the calculations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_08\\Lecture_02_08_page_10.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_02_13": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Fluid Mechanics: Pipe Flow and Momentum Balance",
                    "lecture_subtitle": "Analyzing flow dynamics, head loss, and forces in pipes and control volumes",
                    "summary": "This lecture focuses on the principles of fluid flow in pipes and the momentum balance in control volumes. It starts with analyzing the flow of diesel through a pipe, calculating velocity, Reynolds number, and friction factors. Using Bernoulli's equation, it explores head loss due to major and minor losses, and calculates the total energy required to maintain flow. The lecture also covers the momentum balance in control volumes, exploring forces acting on fluids as they interact with boundaries and move through control volumes. Detailed calculations illustrate the application of these principles in real-world scenarios, emphasizing the importance of understanding fluid behavior to design efficient fluid systems.",
                    "key_concepts": [
                        {
                            "keyword": "Bernoulli's Equation",
                            "description": "A principle in fluid dynamics that describes the conservation of mechanical energy in fluid flow, expressed as $\\frac{p}{\\rho} + \\frac{V^2}{2} + gz = \\text{constant}$ along a streamline."
                        },
                        {
                            "keyword": "Reynolds Number",
                            "description": "A dimensionless number used to predict flow patterns in different fluid flow situations, calculated as $Re = \\frac{VD}{\\nu}$, where $V$ is velocity, $D$ is diameter, and $\\nu$ is kinematic viscosity."
                        },
                        {
                            "keyword": "Head Loss",
                            "description": "The loss of energy in a fluid flow due to friction and turbulence, often calculated using the Darcy-Weisbach equation and expressed as $h_{loss} = h_{major} + h_{minor}$."
                        },
                        {
                            "keyword": "Momentum Balance in Control Volumes",
                            "description": "Analyzing the forces acting on a fluid as it flows through a control volume, using the equation $\\dot{L}_{in} - \\dot{L}_{out} + \\sum F_{external} = \\frac{dL_{cv}}{dt}$ to determine changes in momentum."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Fluid Statics",
                            "description": "The study of fluids at rest, providing essential principles for understanding pressure distribution in a fluid."
                        },
                        {
                            "keyword": "Continuity Equation",
                            "description": "A fundamental principle of fluid dynamics that states the mass flow rate must remain constant from one cross-section of a pipe to another, expressed as $A_1V_1 = A_2V_2$."
                        }
                    ],
                    "search_keywords": [
                        "Bernoulli's equation in pipe flow",
                        "Reynolds number and flow types",
                        "Momentum balance in fluid dynamics"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses pipe flow analysis for diesel with specific gravity 0.8 and kinematic viscosity $v = 2.5 \\times 10^{-6} \\text{m}^2/\\text{s}$. It applies the Bernoulli equation considering head losses, with calculations for velocity, Reynolds number, and friction factor. The flow is determined to be turbulent based on the Reynolds number.",
                                    "text": "Pipeflow Diesel\\nsp. gr. = 0.8, v = 2.5 \\text{mm}^2/\\text{s} = 2.5 \\times 10^{-6} \\text{m}^2/\\text{s}\\n\\n\\frac{p_1}{\\rho} + \\frac{V_1^2}{2} + gz_1 + \\frac{W}{m} - h_{\\text{loss}} = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + gz_2\\n\\n\\text{where } p_1 = p_2 = p_{\\text{atm}},\\nV_1 = V_2 = \\frac{Q}{A} = \\frac{30 \\times 10^{-3}}{60} \\big/ \\left(\\frac{\\pi}{4} \\times 0.025^2\\right) = 1.0186 \\text{ m/s} \\nz_1 = -1.5,\\nz_2 = +3.5\\n\\nh_{\\text{losses}} = h_{\\text{major}} + h_{\\text{minor}} = f \\frac{L}{D} \\frac{V^2}{2} + K \\frac{V^2}{2}\\n\\nRe = \\frac{VD}{v} = \\frac{(1.0186)(0.025)}{(2.5 \\times 10^{-6})} = 10186 \\quad > 4000 \\Rightarrow \\text{ flow is turbulent.}\\n\\nf = \\left[0.25 \\left(\\log_{10} \\left(\\frac{\\epsilon/D + \\frac{5.74}{Re^{0.9}}}{3.7} \\right)\\right)\\right]^2 = 0.0315",
                                    "image_description": "DESCRIPTION OF THE IMAGE: The image contains a diagram of a pipe system with annotations like elevations, diameters, and flow rates. It includes equations related to Bernoulli's principle and calculations for flow velocity, Reynolds number, and friction factor. The diagram illustrates a flow path with points 1, 2, and 3 marked, indicating directions and elevations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide provides calculations for head losses in a fluid system, including minor and major losses due to friction and fittings. It involves using the Darcy-Weisbach equation, calculating loss coefficients, and determining the total head loss. It also calculates the work done per unit mass using the elevation head and losses.",
                                    "text": "gh_{major} = 0 + f \\frac{L}{D} \\frac{V^2}{2} = (0.0315)\\left(\\frac{40}{0.025}\\right)\\frac{1.018^2}{2} = 26.1 \\\\\\ h_{major} = \\frac{26.1}{9.8} = \\frac{26.1}{9.8} = 2.66 \\\\\\ gh_{minor} = K \\frac{V^2}{2} = \\\\\\ = (2.5 + 2.5 + 2 + \\frac{2}{\\text{inlet}} + \\frac{\\text{outlet}}{\\text{of pump}})\\frac{1.018^2}{2} \\\\\\ = 4.663 \\\\\\ h_{minor} = \\frac{4.663}{9.81} = 0.475 \\\\\\ \\text{g total head loss} = (2.66 + 0.475) = 3.13 \\text{ m} \\\\\\ g h_{losses} = (9.81)(3.13) = 30.76 \\\\\\ \\frac{\\dot{W}}{\\dot{m}} = g(z_2 - z_1) + gh_{loss} \\\\\\ = (9.81)(3.5 - 61.5) + 30.76 + \\text{state elevator head.} \\\\\\ = 79.81 \\leftarrow \\text{work done per unit mass.}",
                                    "image_description": "The image is a handwritten calculation involving head losses in a fluid system. It includes equations for major and minor losses, using factors like friction factor (f), velocity (V), and pipe dimensions. The Darcy-Weisbach equation is used, with specific calculations for loss coefficients and total head loss. It ends with a calculation of work done per unit mass, involving elevation head and losses."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The slide calculates the power required for a process, starting with the expression for power: \\( \\dot{W} = \\dot{m}(79.81) \\). The mass flow rate \\( \\dot{m} \\) is calculated using the formula \\( \\dot{m} = \\rho Q = (0.8)(1000)\\left( \\frac{30 \\times 10^3}{60} \\right) = 0.4 \\text{ kg/s} \\). Consequently, the power \\( \\dot{W} \\) is calculated as \\( (0.4)(79.81) = 31.9 \\text{ W} \\). If the efficiency is 65%, the power input is calculated as \\( \\frac{31.9}{0.65} = 49 \\text{ W} \\).",
                                    "text": "Power \\( \\dot{W} = \\dot{m}(79.81) \\)\n\\( \\dot{m} = \\rho Q = (0.8)(1000)\\left( \\frac{30 \\times 10^3}{60} \\right) = 0.4 \\text{ kg/s} \\)\n\\( \\dot{W} = (0.4)(79.81) = 31.9 \\text{ W} \\)\nIf efficiency = 65%.\nPower input = \\( \\frac{31.9}{0.65} = 49 \\text{ W} \\)",
                                    "image_description": "The image contains handwritten notes with calculations related to power and efficiency. It includes equations for power \\( \\dot{W} \\), mass flow rate \\( \\dot{m} \\), and power input considering efficiency. The calculations are clear and organized, showing intermediate steps and final results."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide contains a derivation of fluid dynamics equations related to a pump system. It involves concepts such as pressure, velocity, gravitational potential energy, and head loss. The slide begins with the Bernoulli equation applied at various points in the system, accounting for losses and gains due to the pump. The relationships between pressures at different points and the conditions under which these apply are also discussed. The slide concludes with a simplified expression showing the relationship between variables at the final point in the system.",
                                    "text": "\\frac{p_1}{\\rho} + \\frac{V_1^2}{2} + gz_1 - gh_{loss} = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + gz_2 \\\\\n\\frac{p_2}{\\rho} = \\frac{p_1}{\\rho} - g h_s - gh_{loss} \\, \\frac{V_2^2}{2} \\\\\n\\Rightarrow p_2 < p_1 \\\\\n\\frac{p_2}{\\rho} + \\frac{V_2^2}{2} + gz_2 + \\frac{\\dot{\\omega}}{\\dot{m}} - gh_{loss} = \\frac{p_3}{\\rho} + \\frac{V_3^2}{2} + gz_3 \\\\\n\\text{to} \\quad \\frac{p_2}{\\rho} + \\frac{\\dot{\\omega}}{\\dot{m}} \\approx \\frac{p_3}{\\rho} \\quad \\Rightarrow \\quad p_3 > p_2 \\\\\n\\frac{p_3}{\\rho} + \\frac{V_3^2}{2} + gz_3 - gh_{loss} = \\frac{p_4}{\\rho} + \\frac{V_4^2}{2} + gz_4 \\\\\n\\frac{p_3}{\\rho} + \\frac{V_3^2}{2} - gH - gh_{loss} = \\frac{p_4}{\\rho} \\\\\n\\text{Pump} \\\\\n\\text{if inlet area @ pump = outlet area @ pump}",
                                    "image_description": "The image contains a hand-drawn diagram of a pump system with four labeled points (1, 2, 3, 4) connected by pipes, including a pump and a vertical lift denoted by H. Arrows indicate fluid flow direction. Equations and annotations surrounding the diagram relate to the pressure, velocity, and energy at these points."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The slide presents a fluid dynamics problem involving energy balance in a pipeline system. It involves calculating the loss per unit mass flow rate (ghlosses) using given values for major and minor losses. The equation is manipulated to find the pressure at point 3 (P3) in absolute terms, resulting in a value of 85.6 kPa. Key equations include terms for elevation head, velocity head, and pressure head, with losses due to friction and minor components.",
                                    "text": "\\frac{p_a}{\\rho} + \\frac{V^2}{2} + gz_1 + \\frac{\\omega^2 r^2}{n} - gh_{loss} = \\frac{p_3}{\\rho} + \\frac{V_3^2}{2} + gz_3 \\\\\n\\\\\ng_{hmajor} = \\frac{fL}{D}\\frac{V^2}{2} = (0.0315) \\frac{10}{0.015} \\frac{1.018^2}{2} = 6.53 \\\\\ng_{hminor} = k \\frac{V^2}{2} = (2.5 + 2) \\frac{1.018^2}{2} = 2.3282 \\approx 2.332 \\\\\ng_{hlosses} = (6.53 + 2.332) = 8.862 \\leftarrow \\text{loss per unit mass flow rate.} \\\\\n\\\\\n\\frac{p_a}{\\rho} + (-g)(1.5) - 8.862 = \\frac{p_3}{\\rho} + \\frac{1.018^2}{2} \\\\\n\\Rightarrow \\frac{p_a}{\\rho} - \\frac{p_3}{\\rho} = (1.5)(9.81) + 8.862 + \\frac{1.018^2}{2} = 19.6 \\\\\n\\\\\n\\Rightarrow \\frac{101.3 \\times 10^3}{.8 \\times 10^3} - \\frac{p_3}{800} = 19.6 \\Rightarrow p_3 = 85.6 \\text{ kPa (abs)}",
                                    "image_description": "The image shows handwritten calculations for a fluid dynamics problem involving energy losses in a pipeline. Equations for major and minor losses are written, including calculations for ghmajor and ghminor. The total loss ghosses is calculated as 8.862. The final equation rearranges terms to find the pressure at point 3 (P3) as 85.6 kPa."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The slide explains the calculation of Net Positive Suction Head (NPSH) for a fluid system. Atmospheric pressure is given as 101.3 kPa, with a gauge pressure of 85.6 kPa, and vapor pressure at 38°C as 10 kPa. The NPSH is calculated using the formula \\( \\frac{P_3 - P_{\\text{vap}}}{\\rho g} \\), resulting in a value of 9.63 meters.",
                                    "text": "Patm = 101.3 kPa\nPg = 85.6 kPa\nPvap @ 38°C = 10 kPa\n\\( \\frac{P_3 - P_{\\text{vap}}}{\\rho g} = \\frac{(85.6 - 10)(10^3)}{(.9 \\times 10^3)(9.81)} = 9.63 \\text{ m} \\)\nNet Positive Suction Head (NPSH)",
                                    "image_description": "The image contains a diagram with horizontal lines representing different pressure levels. The pressures are labeled as atmospheric pressure (Patm = 101.3 kPa), gauge pressure (Pg = 85.6 kPa), and vapor pressure at 38°C (Pvap = 10 kPa). An arrow indicates the difference \\( P_3 - P_{\\text{vap}} \\). Below the diagram, the calculation of Net Positive Suction Head (NPSH) is shown using the formula \\( \\frac{P_3 - P_{\\text{vap}}}{\\rho g} \\), and the result is 9.63 meters."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide explains the concept of momentum balance in a control volume. It starts with the general equation for momentum balance: \\(\\dot{L}_{in} - \\dot{L}_{out} + \\sum F_{external} = \\frac{dL_{CV}}{dt}\\), where \\(L = mv\\) and \\(CV\\) is the control volume. The slide breaks down the momentum balance in both x and y directions. In the x direction, the momentum entering the system is \\(\\dot{L}_{in} = \\dot{m}V\\) and the momentum leaving the system \\(\\dot{L}_{out} = 0\\). The external force \\(F\\) is found to be equal to \\(\\dot{m}V\\). Since \\(\\dot{m} = \\rho A V\\), the force \\(F\\) becomes \\(\\rho A V^2\\). In the y direction, the momentum inflow is zero and the outflow is described by \\(\\left(\\frac{\\dot{m}}{2}\\right)V - \\dot{m}\\frac{V}{2}\\), representing upward and downward movement respectively.",
                                    "text": "Momentum Balance\\n\\[\\dot{L}_{in} - \\dot{L}_{out} + \\sum F_{external \\ forces} = \\frac{dL_{CV}}{dt}\\] \\n\\[L = mv\\] \\n\\(L = \\text{momentum}\\) \\n\\(CV = \\text{control volume}\\)\\n\\n**x-direction:**\\n\\(\\dot{L}_{in} = \\dot{m}V\\)\\n\\(\\dot{L}_{out} = 0\\)\\n\\(\\dot{m}V - 0 - F = 0\\)\\n\\(\\Rightarrow F = \\dot{m}V\\)\\nSince \\(\\dot{m} = \\rho A V\\)\\n\\(F = \\rho A V^2\\)\\n\\n**In y direction:**\\n\\(\\dot{L}_{in} = 0\\)\\n\\(\\dot{L}_{out} = \\left(\\frac{\\dot{m}}{2}\\right)V - \\dot{m}\\frac{V}{2}\\)\\n(going up - going down)",
                                    "image_description": "The image contains handwritten notes with equations related to momentum balance. There is a sketch depicting a control volume with a force \\(F\\) acting to the left and velocity \\(V\\) to the right. The figure illustrates momentum entering and leaving the control volume in the x-direction, and also notes on the y-direction momentum balance."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide is focused on the dynamics of a plate moving at a constant speed 'u' through a fluid, examining the forces acting on the plate. It uses the conservation of linear momentum and equations of motion to derive expressions for the force on the plate in terms of mass flow rate and velocity difference. The key equation derived is for the force \\( F_x = \\rho A (V-u)^2 \\), where \\( \\rho \\) is the fluid density, \\( A \\) is the area, \\( V \\) is the flow velocity, and \\( u \\) is the plate velocity.",
                                    "text": "\\text{Plate moves at constant speed } u.\\\\ \\dot{L}_{in} = \\dot{m}V \\\\\\ \\dot{L}_{out} = \\dot{m}u \\\\\\ \\dot{L}_{in} - \\dot{L}_{out} + \\Sigma F = \\frac{dL_{CV}}{dt} \\\\\\ \\dot{m}V - \\dot{m}u - f_x = 0 \\\\\\ F_x = \\dot{m}(V-u) \\\\\\ \\dot{m} = (V-u) \\rho A \\\\\\ F_x = \\rho A (V-u)(V-u) \\\\\\ F_x = \\rho A (V-u)^2",
                                    "image_description": "Diagram showing a plate moving to the right with constant speed 'u' through a fluid flow with velocity 'V', with annotations for forces and mass flow rates acting on the plate. The force \\( F_x \\) is directed opposite to the flow."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the analysis of forces in a system with a velocity vector \\( V \\) inclined at an angle \\( \\beta \\). The forces in the x and y directions are calculated using mass flow rate \\( \\dot{m} \\) and velocity components. For the x-direction, the force \\( F_x \\) is derived as a function of \\( \\dot{m} \\), \\( V \\), and \\( \\beta \\), showing that \\( F_x = \\rho A V^2 (1 - \\cos \\beta) \\). In the y-direction, the force \\( F_y \\) is derived as \\( F_y = \\rho A V^2 \\sin \\beta \\).",
                                    "text": "X: \\newline \\dot{L}_{in} = \\dot{m}V \\newline \\dot{L}_{out} = \\dot{m}V \\cos \\beta \\newline \\sum F = \\dot{L}_{in} - \\dot{L}_{out} + \\sum F = \\frac{dL_{cv}}{dt} \\newline \\dot{m}V - \\dot{m}V \\cos \\beta - F_x = 0 \\newline F_x = \\dot{m}V(1 - \\cos \\beta) \\newline F_x = \\rho A V^2 (1 - \\cos \\beta) \\newline \\newline Y: \\newline \\dot{L}_{in} = 0 \\newline \\dot{L}_{out} = \\dot{m}V \\sin \\beta \\newline \\sum F = F_y \\newline 0 - \\dot{m}V \\sin \\beta + F_y = 0 \\Rightarrow F_y = \\dot{m}V \\sin \\beta \\newline = \\rho A V^2 \\sin \\beta",
                                    "image_description": "The image shows a diagram of a velocity vector \\( V \\) at an angle \\( \\beta \\) with respect to the horizontal axis. The diagram includes forces \\( F_x \\) and \\( F_y \\) acting in the x and y directions respectively. The vector is shown as an arrow pointing upwards and to the right."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_9.png"
                            }
                        ]
                    },
                    {
                        "10": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide focuses on analyzing the forces acting on a fluid flow in a bent pipe using momentum principles. It explores the forces in the x and y directions separately, considering both the input and output rates of momentum and the external forces. For the x-direction, the equation \\( \\dot{L}_{in} - \\dot{L}_{out} + \\Sigma F = \\frac{dL^b}{dt} \\) is used to find the force \\( F_x \\). For the y-direction, a similar approach is used to find \\( F_y \\), with attention to the downward velocity, leading to the equations \\( F_x = \\dot{m}V + pA \\) and \\( F_y = -\\left( \\dot{m}V + pA \\right) \\).",
                                    "text": "X:\\n\\[ \\dot{L}_{in} - \\dot{L}_{out} + \\Sigma F = \\frac{dL^b}{dt} \\] \\n\\[ \\dot{L}_{in} = \\dot{m} V \\] \\n\\[ \\dot{L}_{out} = 0 \\] \\n\\[ F = -F_x + pA \\] \\n\\[ \\dot{m}V - 0 - F_x + pA = 0 \\] \\n\\[ F_x = \\dot{m}V + pA \\] \\n\\nY:\\n\\[ \\dot{L}_{in} = 0 \\] \\n\\[ \\dot{L}_{out} = -\\dot{m}V \\] (negative because velocity is downward)\\n\\[ F = pA + F_y \\] \\n\\[ 0 + \\dot{m}V + pA + F_y = 0 \\] \\n\\[ F_y = -\\left( \\dot{m}V + pA \\right) \\]",
                                    "image_description": "The diagram depicts a bent pipe with fluid flow, showing forces acting in the x and y directions. In the x-direction, force \\( F_x \\) is shown acting to the left, opposite the flow direction. In the y-direction, force \\( F_y \\) is directed downwards. The pipe has an area \\( A \\) and pressure \\( P \\) at the inlet and outlet. Momentum flow rates \\( \\dot{L}_{in} \\) and \\( \\dot{L}_{out} \\) are indicated, along with mass flow rate \\( \\dot{m} \\) and velocity \\( V \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_13\\Lecture_02_13_page_10.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_02_27_(1)": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Fluid Dynamics in Turbomachinery",
                    "lecture_subtitle": "Understanding velocity triangles and Euler's equations",
                    "summary": "This lecture focuses on the principles of fluid dynamics as applied to turbomachinery, specifically analyzing velocity triangles and utilizing Euler's turbomachinery equations. It begins with examining the velocity components of fluid flow relative to moving blades, using graphical representations such as velocity triangles. The lecture proceeds to derive and apply Euler's equations to evaluate work done by or on the fluid in a rotating system, calculating essential parameters such as power, torque, and pump head. The concepts are illustrated with practical examples, including the calculation of velocities and angles using trigonometry and vector components.",
                    "key_concepts": [
                        {
                            "keyword": "Velocity Triangles",
                            "description": "Graphical representations used to resolve the velocity of fluid into components relative to the blade and the absolute frame of reference."
                        },
                        {
                            "keyword": "Euler's Turbomachinery Equations",
                            "description": "Equations that relate the change in angular momentum to the work done by the fluid in a turbomachine."
                        },
                        {
                            "keyword": "Pump Head",
                            "description": "The height equivalent of the energy imparted to the fluid, calculated using the velocity components."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Trigonometry",
                            "description": "Mathematical method used for solving angles and sides in triangles, essential for resolving velocity components."
                        },
                        {
                            "keyword": "Vector Analysis",
                            "description": "The study of vectors used to find resultant velocity and direction in fluid flow analysis."
                        }
                    ],
                    "search_keywords": [
                        "Velocity triangles in turbomachinery",
                        "Euler's equations for pumps and turbines",
                        "Fluid dynamics in rotating systems"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses the vector addition of velocities in the context of fluid dynamics or motion analysis. It involves calculating the resultant velocity $V_{W}$ by adding the velocities $V_{W/b}$ and $V_{b}$. The diagram shows a triangle representing the vector addition with angles and velocities labeled. Using the law of cosines, the magnitude of $V_{W/b}$ is calculated, and then the angle $\\beta_1$ is determined. The solutions involve using trigonometric identities and vector addition principles.",
                                    "text": "V_{W} = V_{W/b} + V_{b}\\\\ V_{b} = 2 \\, \\text{m/s}\\\\ V_{W} = 10 \\, \\text{m/s}\\\\ \\alpha_{1} = 20^\\circ\\\\ \\beta_{1} = ?\\\\ V_{W/b}^2 = V_{b}^2 + V_{W}^2 - 2 V_{b} V_{W} \\cos 20\\\\ = 2^2 + 10^2 - (2)(10)(2) \\cos 20\\\\ V_{W/b} = 8.15 \\, \\text{m/s}\\\\ \\cos \\beta_{1} = \\frac{2^2 + 8.15^2 - 10}{(2)(8.15)(2)} = 155\\\\ \\beta_{1} = 180 - 155 = 24.8^\\circ",
                                    "image_description": "The image contains vector diagrams depicting a situation involving the addition of velocities. There is a triangle showing the relationship between the velocities $V_{W}$, $V_{W/b}$, and $V_{b}$, with angles $\\alpha_1$ and $\\beta_1$ marked. The vectors are labeled with their respective magnitudes and directions, and arrows indicate the direction of the velocities."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide focuses on fluid dynamics, specifically calculating the velocity and force components in a system involving fluid flow through a bend. It uses vector decomposition and trigonometric functions to resolve velocities and angles. The calculations include determining the resultant velocity, angles, and mass flow rate, as well as the horizontal and vertical force components. The equations involve trigonometric identities, vector components, and flow rate formulas.",
                                    "text": "\\vec{V}_{w/b} = -V_{w/b} \\cos 40 \\hat{i} + V_{w/b} \\sin 40 \\hat{j} \\\\\n= -8.15 \\cos 40 \\hat{i} + 8.15 \\sin 40 \\hat{j} \\\\\n= -6.24 \\hat{i} + 5.23 \\hat{j} \\\\\n\nV_{w2} = V_{w2/6} + V_b \\\\\nV_{w2} = \\sqrt{V_{w2/6}^2 + V_b^2 - 2 V_{w/\\beta} V_b \\cos 40} \\\\\n= \\sqrt{8.15^2 + 2^2 - (2)(8.15)(2) \\cos 40} \\\\\n= 6.74 \\text{ m/s} \\\\\n\\alpha = \\cos^{-1} \\frac{6.74^2 + 2^2 - 8.15^2}{(2)(6.74)(2)} = 129^\\circ \\\\\n\\alpha_2 = 180 - 129 = 51^\\circ \\\\\n\n\\dot{m} = \\rho A V_r = (10^3) \\frac{\\pi}{4} (0.0.4)^2 \\times 8.15 = 10.23 \\text{ kg/s} \\\\\n\n\\text{Horizontal:} \\quad \\dot{m} V_{in-x} - \\dot{m} V_{out-x} - F_x = 0 \\implies F_x = (10.23)[10 \\cos 20 - 6.74 \\cos 129] = 39.5 \\text{ N} \\\\\n\n\\text{Vertical:} \\quad \\dot{m} V_{in-y} - \\dot{m} V_{out-y} - F_y = 0 \\implies F_y = (10.23)[10 \\sin 20 - 6.74 \\sin 129] = -18.6 \\text{ N}",
                                    "image_description": "The slide contains a diagram with two vectors labeled V_{w/b} and V_b, forming a triangle with angles indicated, including a 40-degree angle. There is a second diagram showing a vector triangle with sides labeled 6.74, 8.15, and an angle \\alpha of 129 degrees. The vectors and angles are used to illustrate the calculation of velocity components."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide appears to focus on the kinematics of a rotating machine, possibly a turbine or pump. It includes diagrams illustrating velocity triangles at the inlet and outlet, as well as the relationship between angular velocity (ω), radii (R1 and R2), and blade velocities (u1, u2). The velocity triangles depict the components of velocity: absolute velocity (V), relative velocity (Vr), and blade velocity (u) at both the inlet and outlet. The slide aims to explain the velocity relationships and flow dynamics in rotating machinery.",
                                    "text": "The slide includes the following content: \\( u_1 = R_1 \\omega \\) and \\( u_2 = R_2 \\omega \\), indicating the blade velocities at radii \\( R_1 \\) and \\( R_2 \\) due to the angular velocity \\( \\omega \\). There are two main velocity triangles labeled as 'Outlet triangle' and 'Inlet triangle'. The 'Outlet triangle' shows \\( V_{r2} \\) (relative velocity), \\( V_{u2} \\) (tangential velocity), and \\( V_{rr} \\) (resultant velocity) with angles \\( \\beta_2 \\) and \\( \\alpha_2 \\). The 'Inlet triangle' shows \\( V_{r1} \\), \\( V_{u1} \\), and \\( V_{rr} \\) with angles \\( \\beta_1 \\) and \\( \\alpha_1 \\). The note \"velocity of the jet/water relative to the blade\" indicates the focus on the dynamics of fluid flow relative to the moving blades.",
                                    "image_description": "The image contains several diagrams related to the velocity analysis in a rotating system. The main diagram shows a side view of a rotating machine with two radii, R1 and R2, and angular velocity \\( \\omega \\). Two velocity triangles are depicted: 'Outlet triangle' and 'Inlet triangle', which illustrate the relationships between different velocity components. The triangles include labels for velocities such as \\( V_{r} \\), \\( V_{u} \\), and angles \\( \\beta \\), \\( \\alpha \\). The diagrams are hand-drawn, with annotations describing the velocity components and angles."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the inlet velocity components in fluid dynamics, particularly focusing on tangential and normal components of velocity. It explains how these components are derived using trigonometric identities related to angles \\( \\beta_1 \\) and \\( \\beta_2 \\). The slide also introduces the concept of conservation of angular momentum, providing equations for the change in angular momentum over time. Key formulas include those for the tangential and normal velocity components, volumetric flow rate \\( Q \\), and torque \\( T \\).",
                                    "text": "V_{wt1} = V_{t1}, V_{n1} \\text{ = tangential & normal components of } V_w, \\\\\nV_{n1} = V_{w1} \\sin \\alpha = V_{r1} \\sin \\beta_1, \\\\\nV_{t1} = V_r \\cos \\beta_1 - u_1 \\\\\n\\\\\nV_{n2} = V_{r2} \\sin \\beta_2 = V_{w2} \\sin \\alpha_2 \\\\\nV_{t2} = u_2 - V_{r2} \\cos \\beta_2 \\\\\n\\\\\nQ = A V = 2 \\pi R_1 b_1 V_{n1} = 2 \\pi R_2 b_2 V_{n2} \\\\\n\\\\\n\\text{Conservation of Angular Momentum} \\\\\nH_{in} - H_{out} + \\Sigma T = \\frac{dH_{cv}}{dt} \\\\\nH_{cv} = \\dot{m} r_1 V_{t1} - \\dot{m} r_2 V_{t2} + I = 0 \\\\\nT = \\dot{m} (r_2 V_{t2} - r_1 V_{t1})",
                                    "image_description": "The image contains diagrams illustrating velocity triangles at the inlet of a fluid system. The triangles show the relationship between velocity components \\( V_{t1}, V_{n1}, V_{t2}, \\text{ and } V_{n2} \\) and angles \\( \\beta_1 \\) and \\( \\beta_2 \\). There is also a circular diagram with radius \\( R_1 \\) showing the tangential and normal velocity components \\( V_{t1} \\) and \\( V_{n1} \\). Equations related to these components and conservation of angular momentum are handwritten around the diagrams."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses Euler's Turbomachinery Equations, focusing on the calculation of power and pump head in turbomachinery systems. It explains the derivation of power (P) in terms of mass flow rate (\\(\\dot{m}\\)) and velocity components at different radii. Work done per unit mass (\\(\\omega\\)) is derived, and the specific equation for pump head (\\(h_{pump}\\)) is provided. A special case with radial entry is also considered, simplifying the expression for pump head.",
                                    "text": "Power \\( P = T \\omega \\) \n\\[ = \\dot{m} \\omega (r_2 \\, V_{t2} - r_1 \\, V_{t1}) \\]\n\\[ = \\dot{m} \\left[ V_{t2} (r_2 \\omega) - (r_1 \\omega) V_{t1} \\right] \\]\n\\[ P = \\dot{m} \\left[ V_{t2} u_2 - V_{t1} u_1 \\right] \\]\n\n\\[ \\omega = \\frac{P}{\\dot{m}} = \\left( V_{t2} u_2 - V_{t1} u_1 \\right) \\]\n\\text{work done per unit mass}\n\n\\[ h_{pump} = \\frac{\\omega}{g} = \\frac{P}{\\dot{m} g} = \\frac{V_{t2} u_2 - V_{t1} u_1}{g} \\]\n\\text{Pump head}\n\n\\text{Special Case: } \\alpha_1 = 90 \\Rightarrow \\text{radial entry} \\Rightarrow V_{t1} = 0\n\n\\[ h_{pump} = \\frac{V_{t2} u_2}{g} \\]",
                                    "image_description": "The image is a handwritten lecture slide titled 'Euler's Turbomachinery Equations.' It includes equations for power (P) in terms of mass flow rate (\\(\\dot{m}\\)) and velocity components \\(V_{t2}, V_{t1}\\) at radii \\(r_2, r_1\\). The concept of work done per unit mass (\\(\\omega\\)) is introduced, along with the equation for pump head (\\(h_{pump}\\)) using gravitational acceleration (g). A special case of radial entry where \\(\\alpha_1 = 90\\) is also shown, simplifying the pump head equation. Annotations accompany the equations, explaining each step."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the calculation of pump head for radial entry, expressed as \\( h_{\\text{pump}} = \\frac{v_{t2}u_2}{g} \\). The derivation involves several steps breaking down the velocity components and incorporating trigonometric identities. Ultimately, the equation is simplified to \\( h_{\\text{pump}} = a - bQ \\), where \\( a = \\frac{u_2^2}{g} \\) and \\( b = \\frac{u_2}{2 \\pi r_2 b_2} \\frac{\\cot \\beta_2}{g} \\). Conditions for shut-off head (\\( Q = 0 \\)) and maximum flow-rate (\\( h_{\\text{pump}} = 0 \\)) are discussed. A linear relationship between \\( h \\) and \\( Q \\) is depicted in a graph.",
                                    "text": "Assume Radial Entry \\( h_{\\text{pump}} = \\frac{v_{t2}u_2}{g} = \\frac{u_2}{g} (u_2 - v_{r2} \\cos \\beta_2) = \\frac{u_2}{g} \\left(u_2 - \\frac{v_{n2}}{\\sin \\beta_2} \\cos \\beta_2\\right) = \\frac{u_2}{g} \\left(u_2 - \\frac{Q}{2\\pi r_2 b_2} \\frac{\\cos \\beta_2}{\\sin^2 \\beta_2}\\right) = \\frac{u_2^2}{g} - Q \\left[\\frac{u_2}{2\\pi r_2 b_2} \\frac{\\cot \\beta_2}{g}\\right]\\) Let \\( a = \\frac{u_2^2}{g}, b = \\frac{u_2}{2\\pi r_2 b_2} \\frac{\\cot \\beta_2}{g} \\) \\( h_{\\text{pump}} = a - bQ \\) When \\( Q = 0 \\), \\( h_{\\text{pump}} = a = \\frac{u_2^2}{g} \\) Shut-off head. \\( Q = \\frac{a}{b} \\), \\( h_{\\text{pump}} = 0 \\) Maximum flow-rate.",
                                    "image_description": "The image contains handwritten equations and notes related to the calculation of pump head for radial entry. There is a graph in the bottom left corner illustrating a linear relationship between head (h) and flow rate (Q), with the head decreasing as the flow rate increases."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The slide details calculations related to fluid flow in a turbine, focusing on parameters at the inlet and outlet, including radius, blade width, and blade angle. The angular velocity \\( \\omega \\) is calculated as \\( 78.54 \\, \\text{rad/s} \\). Theoretical head and power are considered, but not calculated. Velocity components are derived using the inlet triangle, with equations for \\( u_1 \\), \\( u_2 \\), \\( V_{rn1} \\), \\( V_{ri} \\), and \\( V_{ti} \\).",
                                    "text": "Parameter Inlet Outlet\\nRadius (mm) 175 500\\nBlade width (b mm) 50 30\\nBlade angle \\( \\beta \\) 65 70\\n\\n\\( N = 750 \\text{ rpm} \\)\\n\\( Q = 0.75 \\text{ m}^3/\\text{s} \\)\\n\\nTheoretical head?\\n\\( P = ? \\)\\n\\( \\omega = \\frac{(750)2\\pi}{60} = 78.54 \\text{ rad/s} \\)\\n\\n\\( u_1 = (78.54)(0.175) = 13.74 \\text{ m/s} \\)\\n\\( u_2 = (78.54)(0.5) = 39.27 \\text{ m/s} \\)\\n\\nAssume radial entry\\n\\nInlet triangle\\n\\( u_1 = 13.74 \\)\\n\\n\\( V_{rn1} = \\frac{Q}{2\\pi R_1 b_1} = \\frac{0.75}{(2\\pi)(0.175)(0.05)} = 13.64 \\text{ m/s} \\)\\n\\( V_{ri} = \\frac{V_{rn1}}{\\sin \\beta_1} = \\frac{13.64}{\\sin 65} = 15.05 \\text{ m/s} \\)\\n\\( V_{ti} = u_1 - V_{ri} \\cos \\beta_1 \\)\\n\\( = 13.64 - 15.05 \\cos 65 \\)\\n\\( \\approx 7.28 \\text{ m/s} \\)",
                                    "image_description": "The image contains handwritten notes with calculations and diagrams related to fluid flow in a turbine. It includes parameters for inlet and outlet, equations for angular velocity, and velocity components. A diagram labeled 'Inlet triangle' shows the relationship between different velocity components \\( V_t, V_{rn}, V_{ri} \\) and angles."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses calculations related to the outlet triangle in fluid dynamics, specifically focusing on parameters such as flow rate, velocity, pump head, power, and torque. It includes equations for these parameters and applies them to an example with specific numerical values.",
                                    "text": "\\text{Outlet triangle}\\\\ Q = 2\\pi R_2 b_2 V_{n2}\\\\ V_{n2} = \\frac{Q}{2 \\pi R_2 b_2} = \\frac{0.75}{(2)(1.0)(0.03)} = 7.96 \\, \\text{m/s}\\\\ V_{t2} = \\frac{u_2 - V_{r2} \\cos \\beta_2}{g} = \\frac{99.27 - 2.9}{9.81} \\approx 36.37 \\, \\text{m/s}\\\\ h_{\\text{pump}} = \\frac{V_{t2} u_2 - V_{t1} u_1}{g} = \\frac{(36.37)(39.27) - (13.74) 7.28}{9.81} = 135 \\, \\text{m}\\\\ \\text{Power} = \\dot{m} \\, g \\, h_{\\text{pump}} = \\rho \\Omega \\, g \\, h_{\\text{pump}} = (10^3)(0.75)(9.81)(135) = 996 \\, \\text{kW}\\\\ \\text{Torque} = \\dot{m} (r_2 V_{t2} - r_1 V_{t1}) = (10^3)(0.75)[0.5(36.37) + (0.3)(7.28)] = 12.7 \\, \\text{kN} \\, \\text{m}",
                                    "image_description": "The image depicts a diagram of an outlet triangle with annotated vectors and angles. There are notes indicating specific velocities and angles such as V_{r2}, V_{n2}, and an angle of 70 degrees. The diagram is used to illustrate the relationships between the various components in the calculations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_02_27_(1)\\Lecture_02_27_(1)_page_8.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_03_01_(1)": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Centrifugal Pump Analysis",
                    "lecture_subtitle": "Understanding Flow Dynamics and Performance Metrics",
                    "summary": "This lecture provides a comprehensive analysis of centrifugal pumps, focusing on the flow dynamics and performance metrics. It starts with the fundamental principles of fluid dynamics, including inlet and outlet velocity triangles, which are essential for understanding the flow through the pump. The lecture delves into the angular momentum balance to derive the torque and power required to operate the pump. Calculations for pump head, work per unit mass, and special cases such as radial entry are explored. The concept of pump curves and the relationship between head and flow rate are illustrated, showing the impact of different operating conditions. The lecture also covers pressure calculations at the pump inlet, net positive suction head (NPSH), and the operating point of the pump system. Scaling laws for pumps are introduced, emphasizing the proportional relationships between key parameters, such as the flow rate, head, and power with respect to the pump's size and speed. Finally, practical examples are given to solidify understanding, including specific calculations and graphical representations of pump performance.",
                    "key_concepts": [
                        {
                            "keyword": "Inlet and Outlet Velocity Triangles",
                            "description": "Geometric representations used to analyze the flow velocities at the pump inlet and outlet. These triangles help in understanding the velocity components and their relation to the pump's performance."
                        },
                        {
                            "keyword": "Angular Momentum Balance",
                            "description": "A principle used to derive the torque and power needed for pump operation. It involves balancing the angular momentum at the inlet and outlet of the pump."
                        },
                        {
                            "keyword": "Pump Head",
                            "description": "The height to which a pump can raise water, calculated using the energy equation. It is a key performance metric of a pump."
                        },
                        {
                            "keyword": "Net Positive Suction Head (NPSH)",
                            "description": "The minimum pressure required at the pump inlet to prevent cavitation. It ensures that the pump operates efficiently without damage."
                        },
                        {
                            "keyword": "Pump Scaling Laws",
                            "description": "Mathematical relationships showing how pump performance parameters, such as flow rate, head, and power, change with scale, speed, and size of the pump."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Fluid Dynamics",
                            "description": "The study of fluids (liquids and gases) in motion. It is fundamental to understanding how pumps work."
                        },
                        {
                            "keyword": "Energy Equation",
                            "description": "A principle in fluid mechanics that relates the energy at different points in a fluid system, used to calculate parameters like pump head."
                        },
                        {
                            "keyword": "Cavitation",
                            "description": "The formation of vapor bubbles in a liquid due to a drop in pressure. It is an important consideration in pump design to avoid damage."
                        }
                    ],
                    "search_keywords": [
                        "centrifugal pump flow dynamics",
                        "angular momentum in pumps",
                        "pump performance metrics"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "This slide appears to be about fluid dynamics, specifically focusing on velocity triangles at the inlet and outlet of a rotating machinery, such as a pump or a turbine. It includes equations and diagrams illustrating the relationships between various velocity components, angles, and flow rates. The key equation is for flow rate \\( Q = A V = (2 \\pi R b_1) V_{r1} = (2 \\pi R_2 b_2) V_{in2} \\). There are vector diagrams showing velocity triangles, with components labeled \\( V, V_r, u \\) and angles \\( \\alpha, \\beta \\).",
                                    "text": "Q = A V = (2 \\pi R b_1) V_{r1} = (2 \\pi R_2 b_2) V_{in2} \\n\\nVelocity components and angles are defined:\\n- \\( V \\): Absolute velocity\\n- \\( V_r \\): Relative velocity\\n- \\( u \\): Peripheral velocity\\n- \\( \\alpha \\): Angle of absolute velocity\\n- \\( \\beta \\): Blade angle\\n\\nInlet triangle:\\n\\( V_{n1} = V_1 \\sin \\alpha_1 = V_{r1} \\sin \\beta_1 \\)\\n\\( V_{t1} = u_1 - V_{r1} \\cos \\beta_1 = u_1 - V_{r1} \\cot \\beta_1 \\)\\n\\nOutlet triangle:\\n\\( V_{2n} = V_2 \\sin \\alpha_2 = V_{r2} \\sin \\beta_2 \\)\\n\\( V_{t2} = u_2 - V_{r2} \\cos \\beta_2 = u_2 - V_{n2} \\cot \\beta_2 \\)",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: The image contains hand-drawn diagrams of velocity triangles and flow paths around a rotating element. There are two primary diagrams labeled 'Inlet triangle' and 'Outlet triangle,' showing velocity components and angles. The inlet and outlet sections depict velocity vectors \\( V, V_r, u \\) and angles \\( \\alpha, \\beta \\). Additional sketches show cross-sectional views of the rotating element, with radii \\( R_1, R_2 \\) and blade widths \\( b_1, b_2 \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "The slide focuses on the angular momentum balance in the context of fluid mechanics, particularly in pumps. It presents equations for torque, power, and work per unit mass, and discusses the pump head. Special attention is given to the radial entry case where the angle \\( \\alpha_f = 90^\\circ \\), simplifying some terms. The slide concludes with a formula for the pump curve showing the relationship between the pump head \\( h_p \\), initial pump head \\( H_0 \\), and a constant \\( A \\) related to flow rate \\( Q \\).",
                                    "text": "\\text{Angular momentum balance:} \\\\\n\\dot{m} V_{t1} r_1 - \\dot{m} V_{t2} r_2 + T = 0 \\\\\nT = \\dot{m} (V_{t2} r_2 - V_{t1} r_1) \\\\\n\\\\\n\\text{Power:} \\quad P = T \\omega \\\\\np = \\frac{\\dot{m}}{g} (V_{t2} u_2 - V_{t1} u_1) \\\\\n\\\\\n\\text{Work per kg:} \\quad \\omega = \\frac{P}{\\dot{m}} = \\frac{V_{t2} u_2 - V_{t1} u_1}{g} \\\\\n\\\\\n\\text{Pump head:} \\quad h_p = \\frac{\\omega}{g} = \\frac{P}{\\dot{m} g} \\\\\n\\\\\n\\text{Special case: Radial entry:} \\quad \\alpha_f = 90^\\circ \\Rightarrow V_1 = V_{ri} \\quad V_{tE} = 0 \\\\\nh_p = \\frac{V_{t2} u_2}{g} = \\frac{(u_2 - V_{m2} \\cot \\beta) u_2}{g} = \\frac{u_2^2}{g} - \\frac{V_{m2} \\cot \\beta u_2}{g} \\\\\nH_0 = \\frac{u^2}{g} \\\\\nA = \\frac{1}{2 \\pi R_2 b_2} \\frac{\\cot \\beta_2 u_2}{g} \\quad \\text{Pump curve} \\\\\nh_p = H_0 - A Q",
                                    "image_description": "The image contains several handwritten equations and notes related to angular momentum balance in fluid systems. Key components include equations for torque (T), power (P), work per unit mass, and pump head (h_p). It also addresses a special radial entry case where the angle is 90 degrees. The equations are organized in boxes and there are references to specific variables like V_{t1}, V_{t2}, r_1, r_2, u_1, u_2, and constants such as A, H_0, and Q, which are part of the pump curve equation."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide contains calculations related to fluid mechanics and turbine dynamics. It involves determining various parameters such as velocity components, torque, power, work per kilogram, and head for a turbine setup. Important calculations include using the flow rate (Q), radii (R1, R2), rotational speed (N), and blade angle (\\beta_2) to find velocities (V_{n1}, V_{n2}, U_1, U_2), and using these to determine torque, power, and head.",
                                    "text": "Q = 0.5 \\text{ m}^3/\\text{s}\\\\\nR_1 = 2.5 \\text{ cm}\\\\\nR_2 = 18 \\text{ cm}\\\\\nN = 1800 \\text{ rpm}\\\\\nb = 1 \\text{ cm}\\\\\n\\beta_2 = 75^\\circ\\\\\n\\\\\nQ = 0.5 = (2\\pi R_1 b_1) V_{n1} = (2\\pi R_2 b_2) V_{n2}\\\\\n= (2\\pi)(0.025)(0.01)V_{n1} = (2\\pi)(0.18)(0.01)V_{n2}\\\\\nV_{n1} = 318.3 \\text{ m/s}\\\\\nV_{n2} = 44.2 \\text{ m/s}\\\\\n\\\\\nN = 1800 \\text{ rpm} = 188.5 \\text{ rad/s}\\\\\nU_1 = R_1 \\omega_1 = (0.02)(188.5) = 4.7 \\text{ m/s}\\\\\nU_2 = R_2 \\omega_2 = (0.18)(188.5) = 33.9 \\text{ m/s}\\\\\n\\\\\n\\text{Inlet triangle:}\\\\\nV_1 = V_{n1} = 318.3 \\text{ m/s}\\\\\nV_{r1} = 318.3 \\text{ m/s}\\\\\n\\beta_1 = 89.15^\\circ\\\\\n\\\\\n\\text{Outer triangle:}\\\\\nV_{r2}\\\\\nV_2\\\\\nV_{nx} = 44.2 \\text{ m/s}\\\\\n33.9\\\\\nV_{t2} = 33.9 - 11.8 = 22.1 \\text{ m/s}\\\\\n\\\\\n\\text{Torque:}\\\\\n\\dot{m}(V_{t2}r_2) = (0.5)(10^3)(22.1)(0.18) = 1.98 \\text{ kN m}\\\\\n\\\\\n\\text{Power:}\\\\\nT\\omega = (1.98)(188.5) = 374 \\text{ kW}\\\\\n\\\\\n\\text{Work per kg:}\\\\\nP/\\dot{m} = \\frac{374 \\times 10^3}{(0.5) \\times 10^3} = 748 \\text{ J/kg}\\\\\n\\\\\n\\text{Head:}\\\\\nP/\\dot{m}g = 76.2 \\text{ m}",
                                    "image_description": "The image contains handwritten notes and calculations related to fluid mechanics and turbine dynamics. It includes equations for calculating flow rate, velocity components, and power. There are diagrams of inlet and outlet velocity triangles with annotations showing calculations of angles and velocity components."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the calculation of a pump head and flow rate for a pump system. It derives the initial head \\( H_0 \\) using the formula \\( H_0 = \\frac{u_2^2}{g} \\), where \\( u_2 = 39.9 \\) and \\( g = 9.81 \\). The calculated head \\( H_0 \\) is 117 m. The pump head \\( H \\) is then expressed as \\( H = 117 - 81.9Q \\), where \\( Q \\) is the flow rate. The coefficient \\( A \\) is calculated as 81.9 using given parameters. A pump curve is also depicted, showing the relationship between head and flow rate, with a maximum flow rate \\( Q_{max} = \\frac{117}{81.9} = 1.43 \\, \\text{m}^3/\\text{s} \\).",
                                    "text": "H = H_0 - AQ \\\\ H_0 = \\frac{u_2^2}{g} \\\\ = \\frac{(39.9)^2}{9.81} \\\\ = 117 \\, \\text{m} \\\\ H = 117 - 81.9Q \\\\ A = \\frac{Q}{2\\pi R_2 b_2} \\cot \\beta_2 \\frac{u_2}{g} \\\\ = \\frac{1}{(2\\pi)(0.18)(0.01)} \\frac{1}{\\tan 75} \\frac{33.9}{9.81} \\\\ = 81.9 \\\\ Q_{max} = \\frac{117}{81.9} = 1.43 \\, \\text{m}^3/\\text{s}",
                                    "image_description": "The image contains a hand-drawn graph labeled 'pump curve.' It shows a linear decrease from a head value of 117 to the x-axis, representing flow rate. The slope of the line is determined by the equation \\( H = 117 - 81.9Q \\). The maximum flow rate is marked as 1.43 \\( \\text{m}^3/\\text{s} \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "This slide discusses the pressure at the inlet of a pump, focusing on the Bernoulli equation and head loss calculations. It presents formulas and calculations to determine the pressure differential between atmospheric and suction conditions, and calculates the net positive suction head (NPSH).",
                                    "text": "\\frac{p_a}{\\rho} + \\frac{V_1^2}{2} + g z_1 - g h_L = \\frac{p_s}{\\rho} + \\frac{V_s^2}{2} + g z_2 \\\\\np_{ax} = \\frac{p_a - p_s}{\\rho} = \\frac{V_s^2}{2} + g h_L + g z_1 \\\\\nV_s = \\frac{Q}{A} = \\frac{0.611}{(\\frac{\\pi d^2}{4})(0.5)^2} = 3.1 \\text{ m/s} \\\\\nh_L = \\left( f \\frac{L}{D} + K \\right) \\frac{V_s^2}{2g} = \\left[ 0.03 \\times \\frac{8}{0.5} + 5 \\right] \\frac{(3.1)^2}{2 \\times 9.81} = 2.68 \\\\\n\\frac{p_a - p_s}{\\rho} = \\frac{(3.1)^2}{2 \\times 9.81} + (9.81)(-5) \\\\\n\\frac{p_a - p_s}{\\rho} = 80.1 \\\\\np_a - p_s = 80.1 \\text{ kPa} \\\\\np_s = 101.3 - 80.1 = 20.2 \\text{ kPa} \\\\\n\\text{Net positive suction head (available)} = (20.2 - 4.25) \\frac{g}{9.81} = 1.63 \\text{ m} \\\\\np_a = 101.3 \\text{ kPa} \\\\\np_s = 20.2 \\text{ kPa} \\\\\np_v = 4.25 \\text{ kPa} \\\\\n\\text{NPSH}",
                                    "image_description": "The image is a handwritten slide titled 'Pressure at inlet to pump' with equations and calculations related to fluid dynamics. It includes the Bernoulli equation for pressure differential, calculations for velocity and head loss, and a graph showing pressures such as atmospheric pressure (101.3 kPa), suction pressure (20.2 kPa), and vapor pressure (4.25 kPa). The slide also calculates the net positive suction head (NPSH) as 1.63 m."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses determining the operating point of a pump system. The operating point is found by equating the system equation \\( h_{sys} = 60 + 19.6Q^2 \\) with the pump equation \\( h_{pump} = 117 - 81.9Q \\). Solving these equations yields the flow rate \\( Q = 0.611 \\text{ m}^3/\\text{s} \\). The head is calculated to be 6.7 m. The power required is determined using the formula \\( \\frac{\\dot{m}gh}{\\rho g h} \\), resulting in a power of 401 kW.",
                                    "text": "The slide contains the following content: \\( h_{sys} = 60 + 19.6Q^2 \\); \\( h_{pump} = 117 - 81.9Q \\); Operating point: \\( 117 - 81.9Q = 60 + 19.6Q^2 \\) leads to \\( 19.6Q^2 + 81.9Q - 57 = 0 \\). Solving for \\( Q \\) using the quadratic formula, \\( Q = \\frac{-81.9 \\pm \\sqrt{(81.9)^2 + (4)(19.6)(57)}}{(2)(19.6)} \\) results in \\( Q = 0.611 \\text{ m}^3/\\text{s} \\). The head is calculated as \\( 117 - (0.611)81.9 = 6.7 \\text{ m} \\). Power is calculated as \\( \\frac{\\dot{m}gh}{\\rho g h} \\) with substitutions \\( (10^3)(0.611)(9.81)67 \\) equaling 401 kW.",
                                    "image_description": "The image contains a graph with two intersecting curves. The curve labeled \\( h_{sys} = 60 + 19.6Q^2 \\) is upward sloping. The curve labeled \\( h_{pump} = 117 - 81.9Q \\) is downward sloping. The intersection point is marked as the operating point. Below the graph, calculations are shown for finding the operating point, head, and power."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses fluid dynamics and flow through pipes, focusing on the energy equation and head loss calculations. It involves Bernoulli's principle and the Darcy-Weisbach equation to determine flow characteristics in pipes. Key parameters include friction factor \\(f\\), pipe length \\(L\\), diameter \\(D\\), and velocity \\(V\\). The slide provides calculations for head loss \\(h_L\\) and pump head \\(h_p\\) using given values.",
                                    "text": "f=0.03 \\\\\nL=80 \\\\\nD=50 \\text{ cm} \\\\\nK_m=10 \\\\\n\\frac{p_f}{\\rho} + \\frac{V_1^2}{2} + g z_1 + g h_p - g h_L = \\frac{p_f}{\\rho} + \\frac{V_2^2}{2} + g z_2 \\\\\np_1 = p_2 = p_a \\\\\nv_1 \\approx v_2 \\approx 0 \\quad (\\text{tanks are large}) \\\\\ng z_1 + g h_p - g h_L = g z_2 \\\\\nh_p = (z_2 - z_1) + h_L \\\\\nH_s = 60 \\\\\nh_L = \\frac{f L}{D} \\frac{V^2}{2g} + k \\frac{V^2}{2g} = f \\cancel{\\frac{L}{D}} \\cancel{\\frac{V^2}{2g}} \\left(\\frac{f L}{D} + k\\right) \\frac{V^2}{2g} \\\\\n= \\left(\\frac{f L}{D} + k\\right) \\frac{Q^2}{A^2 2g} = bQ^2 \\\\\nb = \\left(\\frac{f L}{D} + k\\right) \\frac{1}{A^2 2g} \\\\\n= \\left(0.03 \\frac{80}{0.5} + 10\\right) \\frac{1}{2(9.81)(0.196)^2} \\\\\n= 19.6 \\\\\nh_p = 60 + 19.6 Q^2 \\\\\nA = \\frac{\\pi}{4} D^2 = \\left(\\frac{\\pi}{4}(0.5)^2\\right) = 0.196",
                                    "image_description": "The image shows a simple diagram of a fluid system with a pipe and a pump. Parameters such as friction factor \\(f\\), pipe length \\(L\\), and diameter \\(D\\) are provided. The diagram includes a flow equation and calculations for head loss and pump head, displaying mathematical steps and results."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The slide covers pump scaling laws, focusing on how various parameters such as flow rate (Q), head (h), and power (P) scale with changes in pump speed (N) and diameter (D). It provides mathematical relationships and calculations to illustrate these scaling laws.",
                                    "text": "Pump Scaling Laws\n\\[ Q = 2 \\pi R_{b2} b_2 V_{n2} \\]\n\\[ Q \\sim D D D N \\]\n\\[ Q \\sim D^3N \\]\n\\[ \\frac{Q_2}{Q_1} = \\frac{N_2}{N_1} \\Rightarrow \\frac{0.5}{0.611} = \\frac{N_2}{1800} \\Rightarrow N_2 = 1473 \\text{ rpm} \\]\n\\[ h = \\frac{V_{t2} U_2}{g} \\]\n\\[ h \\sim (DN) DN \\]\nSince \\( V_{t2} \\sim DN \\), \\( V_{n2} \\sim DN \\)\n\\[ h \\sim D^2N^2 \\]\n\\[ \\frac{h_2}{h_1} = \\frac{N_2^2}{N_1^2} \\Rightarrow \\frac{h_2}{67} = \\left( \\frac{1473}{1800} \\right)^2 \\Rightarrow h_2 = 44.8 \\text{ m} \\]\n\\[ P = \\rho Q g H \\]\n\\[ p \\sim D^3N D^2N^2 \\Rightarrow P \\sim D^5N^3 \\]\n\\[ \\frac{P_2}{P_1} = \\left( \\frac{N_2}{N_1} \\right)^3 \\Rightarrow P_2 = \\left( \\frac{1473}{1800} \\right)^3 40 = 21.98 \\text{ kW} \\]",
                                    "image_description": "The image shows handwritten equations and calculations related to pump scaling laws. It includes mathematical relationships for flow rate (Q), head (h), and power (P) in terms of pump diameter (D) and speed (N). There are calculations for different scenarios, such as changing the speed from 1800 rpm to 1473 rpm, and corresponding changes in flow rate and head. The equations use symbols like \\( \\sim \\) to indicate proportionality, and there are boxed final results for certain calculations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The slide presents a graphical representation of a pump performance curve, illustrating the relationship between the head (hp) and the flow rate (Q). The shut-off head is noted as \\( H_0 \\), and the maximum flow rate \\( Q_{max} \\) is calculated using the equation \\( Q_{max} = \\frac{H_0}{A} \\).",
                                    "text": "A graph is shown with the y-axis labeled as 'hp' and the x-axis labeled as 'Q'. The graph depicts a straight line starting from \\( H_0 \\) on the y-axis to \\( Q_{max} \\) on the x-axis, representing the relationship between head and flow rate. To the right of the graph, it is noted that \\( H_0 \\) is the shut-off head, and \\( Q_{max} \\) is given by the formula \\( Q_{max} = \\frac{H_0}{A} \\).",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: The image contains a graph with a straight line sloping downwards from left to right, intersecting the y-axis at \\( H_0 \\) and the x-axis at \\( Q_{max} \\). The axes are labeled 'hp' and 'Q'. The annotations include the definitions and formula for shut-off head and maximum flow rate."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_01_(1)\\Lecture_03_01_(1)_page_9.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_03_08": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Analysis of Fluid Machinery and Rocket Dynamics",
                    "lecture_subtitle": "In-depth exploration of centrifugal machines and rocket momentum balance",
                    "summary": "The lecture covers the fundamental principles and calculations related to centrifugal and axial machines, focusing on momentum and angular momentum conservation. It explains the tangential components of velocity, the role of specific angles, and the computation of power and efficiency in fluid machinery. Detailed examples illustrate the practical application of these principles in engineering scenarios. The lecture also extends the analysis to rocket dynamics, explaining the momentum balance in stationary and moving rockets, including specific impulse and velocity changes during fuel burn. Mathematical formulations for thrust and pressure changes are provided, with examples of scaling laws for both fluid machinery and rockets.",
                    "key_concepts": [
                        {
                            "keyword": "Centrifugal Machines",
                            "description": "Centrifugal machines use rotational motion to increase fluid pressure. The lecture explains tangential velocity components and conservation principles."
                        },
                        {
                            "keyword": "Momentum Conservation",
                            "description": "The principle that the total momentum before and after a process remains constant. Used in calculating flow through machines."
                        },
                        {
                            "keyword": "Angular Momentum",
                            "description": "The rotational equivalent of linear momentum, essential for analyzing fluid flow in rotating systems."
                        },
                        {
                            "keyword": "Rocket Dynamics",
                            "description": "The study of forces and motion in rockets, focusing on momentum balance and specific impulse during flight."
                        },
                        {
                            "keyword": "Specific Impulse",
                            "description": "A measure of rocket propulsion efficiency, defined as thrust per unit weight flow rate."
                        },
                        {
                            "keyword": "Velocity Triangles",
                            "description": "Graphical representation of flow velocities at different stages in a fluid machine, crucial for understanding flow dynamics."
                        },
                        {
                            "keyword": "Scaling Laws",
                            "description": "Mathematical relationships that describe how changes in size or speed affect performance in fluid machinery and rockets."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Fluid Dynamics",
                            "description": "The study of fluid motion and forces, foundational for understanding flow in machines and rockets."
                        },
                        {
                            "keyword": "Newton's Laws",
                            "description": "Fundamental principles of motion and force that underpin the analysis of both fluid machinery and rockets."
                        },
                        {
                            "keyword": "Thermodynamics",
                            "description": "The branch of physics dealing with heat and temperature and their relation to energy and work, relevant for propulsion systems."
                        }
                    ],
                    "search_keywords": [
                        "Centrifugal machine analysis",
                        "Rocket momentum balance",
                        "Fluid dynamics in propulsion systems"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide focuses on the dynamics of fluid flow in turbomachinery, specifically centrifugal and axial machines. It covers the momentum equations and the tangential components of velocities in the context of these machines. The slide illustrates the velocity triangles, momentum equations, and how these relate to the operation and design of centrifugal and axial machines.",
                                    "text": "V_i = V_{ri} + u \\newline V_i' = V_{ri}' + u \\newline \\text{\\ensuremath{\\Sigma} X: Momentum} \\newline L_{\\text{in}} - L_{\\text{out}} + \\Sigma F = 0 \\newline \\dot{m} V_{t1} - \\dot{m} V_{t2} + F = 0 \\newline \\text{Tangential components of } V_i, V_2 \\newline \\text{(i.e. components along } u) \\newline \\text{Centrifugal/Radial Machines} \\newline \\text{Axial Machines} \\newline r = \\frac{R_i + R_o}{2}",
                                    "image_description": "The image contains diagrams of velocity triangles and sketches of centrifugal and axial machines. The velocity triangles depict angles \\alpha, \\beta_1, and \\beta_2, as well as the velocities V_1 and V_2. There is also a cross-sectional view of a machine showing the inner and outer radii (R_i and R_o) and the average radius r."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide covers the velocity diagrams and equations related to fluid flow through a turbine. It includes the inlet and outlet velocity triangles, which are used to analyze the flow of fluid through the turbine blades. The slide presents equations for axial and tangential velocity components at both inlet and outlet, such as $V_{a1} = V_{r1} \\cos \\beta_1 = V_1 \\cos \\alpha_1$ and $V_{t2} = V_{r2} \\sin \\beta_2 + u$. It also discusses the conservation of angular momentum, expressed as $\\dot{m} V_{t1} r - \\dot{m} V_{t2} r + T = 0$, and derives the torque $T = \\dot{m} (V_{t2} - V_{t1}) r$.",
                                    "text": "The slide contains diagrams of velocity triangles at the inlet and outlet of a turbine. The inlet velocity triangle is shown with vectors $V_{r1}$, $V_1$, and $u$, with angles $\\beta_1$ and $\\alpha$. The outlet velocity triangle includes vectors $V_{r2}$, $V_2$, and $u$, with angle $\\beta_2$. The equations for axial and tangential velocity components are given as: $V_{a1} = V_{r1} \\cos \\beta_1 = V_1 \\cos \\alpha_1$ and $V_{t1} = \\frac{V_1 \\sin \\alpha}{\\cos \\beta_1} + u$ for the inlet, and $V_{a2} = V_{r2} \\cos \\beta_2 = V_2 \\cos \\alpha_2$ and $V_{t2} = V_{r2} \\sin \\beta_2 + u$ for the outlet. The conservation of angular momentum is expressed as $\\dot{m} V_{t1} r - \\dot{m} V_{t2} r + T = 0$. The torque is derived as $T = \\dot{m} (V_{t2} - V_{t1}) r$.",
                                    "image_description": "The image shows velocity diagrams for a turbine, including inlet and outlet velocity triangles with labeled vectors $V_{r1}$, $V_1$, $u$, $V_{r2}$, $V_2$, and angles $\\alpha$, $\\beta_1$, $\\beta_2$. There are equations for axial and tangential velocities and annotations related to conservation of angular momentum."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the calculation of thrust and power in a fluid dynamics context, likely related to turbomachinery or propulsion systems. It provides equations for axial and radial velocities (V_{r1}, V_{r2}), thrust (T), power (P), work done per unit mass (\\omega), and head. The equations involve parameters such as flow angles (\\beta_1, \\beta_2), axial velocity (V_a), and mass flow rate (\\dot{m}). There's also a diagram showing fluid flow through a section of a machine, with annotations describing the front and back velocities, suggesting a focus on continuity and momentum change.",
                                    "text": "V_{r1} = \\frac{V_a}{\\cos\\beta_1}, \\quad V_{r2} = \\frac{V_a}{\\cos\\beta_2} \\newline T = \\dot{m}\\left( \\frac{V_a \\cos \\sin\\beta_2}{\\cos\\beta_2} - \\frac{V_a \\sin\\beta_1}{\\cos\\beta_1} \\right)r \\newline T = \\dot{m} V_a (\\tan\\beta_2 - \\tan\\beta_1) r \\newline \\dot{m}_{front} = \\dot{m}_{back} \\newline \\rho_f A_{fr} V_{afr} = \\rho_f A_{back} V_{aback} \\newline V_{afr} = V_{aback} \\newline P = \\dot{m} T w = \\dot{m} V_a (\\tan\\beta_2 - \\tan\\beta_1) U \\newline \\text{Work done per unit mass} \\quad \\omega = \\frac{P}{\\dot{m}} = V_a U (\\tan\\beta_2 - \\tan\\beta_1) \\newline \\text{Head} = \\frac{\\omega}{g} = \\frac{V_a U (\\tan\\beta_2 - \\tan\\beta_1)}{g}",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: A diagram showing a section of a machine such as a turbine or compressor with fluid flow depicted. Arrows indicate the direction of flow, and there are annotations indicating where the front and back mass flow rates are equal."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "This slide contains calculations related to airflow through a machine, likely a turbine or a compressor. The airflow rate, torque, and power are calculated using given parameters such as mass flow rate, blade angles, and rotational speed.",
                                    "text": "\\dot{m} = 10 \\text{ kg/s air} \\\\\n\\beta_1 = 30^\\circ \\\\\n\\beta_2 = 60^\\circ \\\\\nN = 1800 \\text{ rpm} \\\\\nD_i = 0.8 \\text{ m} \\quad D_o = 1.6 \\text{ m} \\\\\n\\text{Mean Diameter} = \\frac{0.8 + 1.6}{2} = 1.2 \\text{ m} \\\\\n\\text{u} = Rw = \\left(\\frac{1.2}{2}\\right) \\left(\\frac{1800}{60}\\right) 2\\pi = 113.1 \\text{ m/s} \\\\\nV_a \\equiv Q \\\\\nQ = V_a \\frac{\\pi}{4}(D_o^2 - D_i^2) \\\\\n\\rho = 1.25 \\text{ kg/m}^3 \\\\\nQ = \\frac{\\dot{m}}{\\rho} = \\frac{10}{1.25} = 8 \\text{ m}^3/\\text{s} \\\\\n8 = V_a \\frac{\\pi}{4}(1.6^2 - 0.8^2) \\Rightarrow V_a = 5.31 \\text{ m/s} \\\\\nT = \\dot{m} V_a (\\tan \\beta_2 - \\tan \\beta_1) r \\\\\n= (10)(5.31)(0.6)\\left(\\tan 60 - \\tan 30\\right) = 36.8 \\text{ N-m} \\\\\n\\text{Power} = T\\omega = \\boxed{36.8} \\times \\boxed{188.5} = \\boxed{6.94 \\text{ kW}} \\\\\n\\text{pressure rise across machine (blade)}",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: Diagram of a cylindrical object with an inner diameter (D_i) and outer diameter (D_o) labeled. The diagram is used to illustrate the airflow through the machine."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide deals with the concept of pressure rise in fluid mechanics, focusing on the equations and calculations related to changes in pressure and velocity across a fluid flow system. It elaborates on parameters such as pressure coefficient, velocity components, and angular velocity, providing detailed calculation steps. The slide also includes a diagram illustrating the relationship between stator vanes and rotor vanes in a flow system.",
                                    "text": "Pressure rise: \\[ \\frac{p_1}{\\rho} + \\frac{V_1^2}{2} + \\omega = \\frac{p_2}{\\rho} + \\frac{V_2^2}{2} \\] \\[ \\Delta p = \\frac{p_2 - p_1}{\\rho} = \\frac{V_1^2}{2} + \\omega - \\frac{V_2^2}{2} \\] \\[ \\omega = V_a u (\\tan \\beta_2 - \\tan \\beta_1) \\] \\[ = (5.31)(113)(\\tan 60 - \\tan 30) \\] \\[ = 692.8 \\text{ J/kg} \\] \\[ \\frac{\\Delta p}{\\rho} = 692.8 + \\frac{116.2^2}{2} - \\frac{122.2^2}{2} \\] \\[ = 692.8 - 715.2 \\] \\[ = -22.4 \\text{ J/kg} \\] \\[ V_a = 5.31 \\] \\[ \\beta_1 = 30^\\circ \\] \\[ V_{r1} = \\frac{V_a}{\\cos \\beta_1} = 6.13 \\text{ m/s} \\] \\[ V_{rt1} = u + V_{r1} \\sin \\beta_1 \\] \\[ = 113 + 6.13 \\sin 30 \\] \\[ = 116.1 \\text{ m/s} \\] \\[ V_1 = \\sqrt{V_{rt1}^2 + V_a^2} = 116.2 \\text{ m/s} \\] \\[ V_{r2} = \\frac{V_a}{\\cos 60} = \\frac{6.13}{2} = 3.07 \\text{ m/s} \\] \\[ V_{t2} = u + V_{r2} \\cos \\sin \\beta_2 \\] \\[ = 113 + 6.13 \\sin 60 \\] \\[ = 113 + 5.31 = 10.6 \\text{ m/s} \\] \\[ V_{r2} = \\frac{V_a}{\\cos 60} = \\frac{5.31}{\\cos 60} \\] \\[ V_{t2} = 113 + 10.62 \\sin 60 \\] \\[ = 122.2 \\text{ m/s} \\] \\[ V_2 = \\sqrt{122.2^2 + 5.31^2} \\approx 122.2 \\]",
                                    "image_description": "DESCRIPTION OF THE IMAGE OR CHART: The image contains a sketch illustrating the interaction between stator vanes and rotor vanes in a flow system, showing the fluid path and vector relationships."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide discusses scaling laws related to flow and power in a system, using variables such as flow rate (Q), pressure difference (Δp), power, and rotational speed (N). It presents relationships such as \\( Q \\sim D^3 N \\), \\( \\Delta p \\sim D^2 N^2 \\), and \\( \\text{Power} \\sim D^5 N^3 \\), where \\( D \\) is a characteristic dimension. The equations include factors like velocity (\\( V_a \\)), density (\\( \\rho \\)), and angle differences (\\( \\tan \\beta_2 - \\tan \\beta_1 \\)).",
                                    "text": "Scaling laws\\nu = Rw\\\\V_a \\sim ω\\\\(N = rpm)\\\\Q = V_a \\frac{\\pi}{4} (D_o^2 - D_i^2)\\\\ = Rw \\frac{\\pi}{4}(D_o^2 - D_i^2)\\\\Δp \\sim ω = V_a U (\\tan \\beta_1 - \\tan \\beta_2)\\\\\\text{Power} = \\dot{m} V_a (\\tan \\beta_2 - \\tan \\beta_1) u\\\\ = \\rho Q V_a (\\tan \\beta_2 - \\tan \\beta_1) u.\\\\\\text{Power} \\sim D^3 N (D N) (D N)\\\\\\boxed{\\text{Power} \\sim D^5 N^3}",
                                    "image_description": "The image is a handwritten slide showing various equations related to scaling laws. It includes equations for flow rate (Q), pressure difference (Δp), and power in terms of dimensions (D) and rotational speed (N). There are boxed equations highlighting relationships like \\( Q \\sim D^3 N \\), \\( Δp \\sim D^2 N^2 \\), and \\( \\text{Power} \\sim D^5 N^3 \\). The equations involve parameters like velocity (V_a), density (ρ), and angle differences (\\tan \\beta_2 - \\tan \\beta_1)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide focuses on the momentum balance for rockets. It describes the forces acting on a rocket, including the thrust force, gravitational force, and pressure differences at the nozzle exit. The main equations detail how these forces contribute to the overall momentum balance, leading to the calculation of thrust. Specific impulse is introduced as a measure of efficiency with units in seconds. The slide includes a diagram showing the forces on a rocket nozzle and detailed step-by-step derivations of the equations governing rocket thrust.",
                                    "text": "\\text{Rockets:} \\newline \\text{Momentum Balance} \\newline \\dot{L}_{\\text{in}} - \\dot{L}_{\\text{out}} + \\sum \\vec{F} = 0 \\newline \\dot{L}_{\\text{in}} = 0 \\newline \\dot{L}_{\\text{out}} = -\\dot{m}_e v_e \\newline F = F_{\\text{stand}} - mg + (p_e - p_a) A_e \\newline \\text{pressure at exit of nozzle} \\newline -\\dot{m}_e v_e + F_{\\text{stand}} - mg + (p_e - p_a) A_e = 0 \\newline F_{\\text{stand}} = \\dot{m}_e v_e + mg - (p_e - p_a) A_e \\newline \\text{If } mg \\text{ can be ignored} \\newline F_{\\text{thrust}} = (F_{\\text{stand}} - mg) \\newline = \\dot{m}_e v_e - (p_e - p_a) A_e \\newline \\frac{F_{\\text{thrust}}}{\\dot{m}_e g} = \\text{Specific impulse} \\rightarrow \\text{Units (in seconds)}",
                                    "image_description": "The image shows a diagram of a rocket nozzle with labels indicating the exhaust velocity (v_e), mass flow rate (\\dot{m}_e), atmospheric pressure (p_a), and pressure at the exit of the nozzle (p_e). It illustrates the forces involved in the momentum balance for rocket thrust."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the motion of a rocket using principles of dynamics and calculus. It explores the forces acting on the rocket, including thrust and gravity, and derives equations for the rocket's momentum and velocity. The rocket's mass is considered as a function of time due to fuel consumption. Equations are set up to describe the change in momentum and velocity over time, including the effects of exhaust velocity and gravitational force.",
                                    "text": "\\text{Rocket in motion}\\\\\n\\dot{L}_{\\text{in}} - \\dot{L}_{\\text{out}} + \\Sigma F = \\frac{dL_{\\text{Rocket}}}{dt}\\\\\n\\dot{L}_{\\text{in}} = 0\\\\\n\\dot{L}_{\\text{out}} = \\dot{m}_e\\,v_E =\\\\\n= \\dot{m}_e(-v_{E/R} + v_R)\\\\\nF = mg\\\\\nm(t) = M_R + m_f(t)\\\\\n= (M_R + m_{fo} - \\dot{m}_e t)\\\\\nL_{\\text{Rocket}} = m(t)\\,v_R(t)\\\\\n\\frac{dL_{\\text{Rocket}}}{dt} = \\frac{dm(t)}{dt}\\,v_R(t) + m(t)\\,\\frac{dv_R}{dt}\\\\\n= -\\dot{m}_e\\,v_R(t) + m(t)\\frac{dv_R}{dt}\\\\\n0 - \\dot{m}_e(-v_{E/R} + v_E) - mg = -\\dot{m}_e\\,v_R(t) + m(t)\\frac{dv_R}{dt}\\\\\n\\dot{m}_e\\,v_{E/R} - mg = m\\frac{dv_R}{dt}\\\\\n\\frac{\\dot{m}_e\\,v_{E/R}}{m} - g = \\frac{dv_R}{dt}",
                                    "image_description": "The image is a handwritten set of equations and a diagram related to the motion of a rocket. The diagram shows a simple rocket with labeled velocities \\( v_R \\hat{j} \\) and \\( v_{E/R} \\hat{j} \\). The equations include terms for momentum, force, mass as a function of time, and derivatives with respect to time. It also describes the relationship between the exhaust velocity, gravitational force, and the rocket's acceleration."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the rate of change of rocket velocity, \\( \\frac{d v_R}{dt} \\), factoring in the exhaust velocity \\( V_{e/R} \\), mass flow rates \\( \\dot{m}_e \\), \\( \\dot{m}_f \\), and gravitational acceleration \\( g \\). It presents the velocity equation \\( v_R = \\dot{m}_e V_{e/R} \\ln(M_R + m_{f_0} - \\dot{m}_e t) \\) and simplifies it to \\( v_R(t) = -V_{e/R} \\ln\\left(1 - \\frac{\\dot{m}_e t}{M_R + m_{f_0}}\\right) - gt \\). The time for fuel exhaustion is given by \\( t = \\frac{m_{f_0}}{\\dot{m}_e} \\). The slide concludes with the integral for displacement \\( h(t) = \\int_0^t v_R(t) \\, dt \\).",
                                    "text": "\\frac{d v_R}{dt} = \\frac{\\dot{m}_e V_{e/R}}{M_R + m_{f_0} - \\dot{m}_e t} - g\nv_R = \\dot{m}_e V_{e/R} \\ln(M_R + m_{f_0} - \\dot{m}_e t) \\bigg|_0^t - gt\n= -\\frac{V_{e/R}}{-\\dot{m}_e} \\left[ \\ln(M_R + m_{f_0} - \\dot{m}_e t) - \\ln(M_R + m_{f_0}) \\right] - gt\nv_R(t) = -V_{e/R} \\ln \\left( 1 - \\frac{\\dot{m}_e t}{M_R + m_{f_0}} \\right) - gt\n\n\\text{Time taken for fuel to burn up:} \\quad m_f^*(t) = m_{f_0} - (\\dot{m}_e)t = 0\n\\Rightarrow t = \\frac{m_{f_0}}{\\dot{m}_e}\n\nh(t) = \\int_0^t v_R(t) \\, dt",
                                    "image_description": "The image contains handwritten equations and text. It shows derivations and equations related to rocket propulsion, including the rate of change of velocity, velocity equations, and integrals. There are calculations and boxed results, emphasizing specific equations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_08\\Lecture_03_08_page_9.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_03_13": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Differential Analysis of Fluid Flow",
                    "lecture_subtitle": "Exploring Mass and Momentum Conservation in Fluid Dynamics",
                    "summary": "The lecture provides a comprehensive analysis of fluid flow through the principles of mass and momentum conservation. It begins with the differential analysis of mass conservation in one-dimensional, two-dimensional, and three-dimensional flows, introducing the continuity equation. The lecture then extends to the momentum balance, deriving the Navier-Stokes equation for different dimensions. Applications in various flow scenarios, including flow between plates and through pipes, are discussed to illustrate these principles. The lecture concludes with solving for velocity profiles and flow rates, emphasizing the importance of pressure gradients in fluid mechanics.",
                    "key_concepts": [
                        {
                            "keyword": "Continuity Equation",
                            "description": "The mathematical expression of mass conservation in a fluid, given by $\\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot (\\rho \\vec{u}) = 0$, showing that the rate of change of mass in a control volume is equal to the net mass flux across the control surface."
                        },
                        {
                            "keyword": "Navier-Stokes Equation",
                            "description": "A fundamental equation in fluid dynamics that describes how the velocity field of a fluid evolves over time, expressed as $\\rho \\frac{D\\vec{u}}{Dt} = -\\nabla p + \\mu \\nabla^2 \\vec{u}$, where $\\rho$ is the density, $p$ is the pressure, and $\\mu$ is the dynamic viscosity."
                        },
                        {
                            "keyword": "Momentum Balance",
                            "description": "The principle that the sum of the forces acting on a fluid element is equal to the rate of change of momentum of the fluid element, which is the basis for deriving the Navier-Stokes equation."
                        },
                        {
                            "keyword": "Incompressible Flow",
                            "description": "A flow condition where the fluid density is constant, simplifying the continuity equation to $\\nabla \\cdot \\vec{u} = 0$."
                        },
                        {
                            "keyword": "Pressure Gradient",
                            "description": "A spatial variation in pressure that drives fluid flow, often a critical factor in determining flow rates and velocity profiles in fluid mechanics."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Mass Conservation",
                            "description": "The principle that mass cannot be created or destroyed in a closed system, foundational for deriving the continuity equation."
                        },
                        {
                            "keyword": "Differential Calculus",
                            "description": "The branch of mathematics dealing with rates of change and slopes of curves, used extensively in formulating equations like the Navier-Stokes."
                        },
                        {
                            "keyword": "Vector Calculus",
                            "description": "A mathematical tool used to analyze vector fields, essential for expressing fluid dynamics equations in three dimensions."
                        }
                    ],
                    "search_keywords": [
                        "Continuity Equation in Fluid Dynamics",
                        "Navier-Stokes Equation Derivation",
                        "Pressure Gradient and Fluid Flow"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide is about differential analysis focusing on mass conservation in one dimension. It introduces the concept of mass flow across a control volume and derives the continuity equation for steady-state and incompressible flow conditions. The slide includes diagrams and equations to explain the mass conservation principle, leading to the derivation of the continuity equation.",
                                    "text": "Differential Analysis 1) Mass conservation 1-D \\[ \\dot{m}_{ABEF} - \\dot{m}_{CHGD} = \\frac{\\partial m_{CV}}{\\partial t} \\] \\[ (\\rho u)_x \\Delta y \\Delta z - (\\rho u)_{x+\\Delta x} \\Delta y \\Delta z = \\frac{\\partial}{\\partial t} (\\rho \\Delta x \\Delta y \\Delta z) \\] \\[ (\\rho u)_x \\Delta y \\Delta z - \\left[ (\\rho u)_x \\Delta y \\Delta z + \\frac{\\partial}{\\partial x} (\\rho u) \\Delta x \\Delta y \\Delta z \\right] = \\frac{\\partial}{\\partial t} (\\rho \\Delta x \\Delta y \\Delta z) \\] \\[ -\\frac{\\partial}{\\partial x} (\\rho u) = \\frac{\\partial}{\\partial t} (\\rho x) \\Rightarrow \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial}{\\partial x} (\\rho u) = 0 \\] (Continuity Equation in 1D) Steady State: \\[ \\frac{\\partial \\rho}{\\partial t} = 0 \\Rightarrow \\frac{\\partial}{\\partial x} (\\rho u) = 0 \\] Incompressible: \\[ \\rho \\frac{\\partial u}{\\partial x} = 0 \\Rightarrow \\frac{\\partial u}{\\partial x} = 0 \\Rightarrow u \\text{ is constant in } x \\]",
                                    "image_description": "The image contains a hand-drawn diagram of a control volume represented as a 3D rectangular box labeled with points A, B, C, D, E, F, G, and H. The box has dimensions \\( \\Delta x \\), \\( \\Delta y \\), and \\( \\Delta z \\). Arrows indicate mass flow across the surfaces of the box. Equations describing mass conservation and the continuity equation are handwritten around the diagram."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the concept of continuity in two-dimensional fluid flow. It begins with a mathematical expression representing the mass conservation principle, showing the change in mass flow rates across a control volume. The derivation involves breaking down the mass flow in terms of density (\\( \\rho \\)) and velocity (\\( u, v \\)) components across a differentially small volume element \\( \\Delta x \\Delta y \\Delta z \\). The equations are simplified to yield the continuity equation in 2D: \\( \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial (\\rho u)}{\\partial x} + \\frac{\\partial (\\rho v)}{\\partial y} = 0 \\). The slide also introduces the divergence operator and its application to the velocity field, expressing the continuity equation compactly as \\( \\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot \\rho \\vec{u} = 0 \\).",
                                    "text": "Continuity in 2D\n\\( \\dot{m}_{AB} - \\dot{m}_{CD} + \\dot{m}_{AD} - \\dot{m}_{CB} = \\frac{\\partial}{\\partial t} m_{CV} \\)\n\\[ (\\rho u)_x \\Delta y \\Delta z - (\\rho u)_{x+\\Delta x} \\Delta y \\Delta z + (\\rho v)_y \\Delta x \\Delta z - (\\rho v)_{y+\\Delta y} \\Delta x \\Delta z = \\frac{\\partial}{\\partial t} (\\rho \\Delta x \\Delta y \\Delta z) \\]\n\\[ (\\rho u)_x \\Delta y \\Delta z - \\left[(\\rho u)_x + \\frac{\\partial}{\\partial x} (\\rho u) \\Delta x \\right] \\Delta y \\Delta z + (\\rho v)_y \\Delta x \\Delta z - \\left[(\\rho v)_y + \\frac{\\partial}{\\partial y} (\\rho v) \\Delta y \\right] \\Delta x \\Delta z = \\Delta x \\Delta y \\Delta z \\frac{\\partial \\rho}{\\partial t} \\]\n\\[ -\\frac{\\partial}{\\partial x} (\\rho u) - \\frac{\\partial}{\\partial y} (\\rho v) = \\frac{\\partial \\rho}{\\partial t} \\]\n\\[ \\Rightarrow \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial (\\rho u)}{\\partial x} + \\frac{\\partial (\\rho v)}{\\partial y} = 0 \\]\nLet \\( \\rho \\vec{u} \\triangleq \\rho u \\hat{i} + \\rho v \\hat{j} \\) ; \\( \\nabla \\triangleq \\hat{i} \\frac{\\partial}{\\partial x} + \\hat{j} \\frac{\\partial}{\\partial y} \\) (Del operator)\n\\[ \\nabla \\cdot \\rho \\vec{u} = \\left( \\hat{i} \\frac{\\partial}{\\partial x} + \\hat{j} \\frac{\\partial}{\\partial y} \\right) \\cdot (\\rho u \\hat{i} + \\rho v \\hat{j}) = \\frac{\\partial}{\\partial x} \\rho u + \\frac{\\partial}{\\partial y} \\rho v \\]\n\\[ \\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot \\rho \\vec{u} = 0 \\]\n\\( \\nabla \\cdot \\mu \\) is called the divergence of \\( \\mu \\)",
                                    "image_description": null
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the concept of steady state and incompressibility in fluid dynamics. It begins by stating that in a steady state, the time derivative of pressure (\\( \\frac{\\partial \\rho}{\\partial t} \\)) is zero, leading to the continuity equation \\( \\nabla \\cdot (\\rho \\mathbf{u}) = 0 \\). For incompressible flows, the density \\( \\rho \\) is constant, resulting in \\( \\nabla \\cdot \\mathbf{u} = 0 \\), which can be expanded to \\( \\frac{\\partial u}{\\partial x} + \\frac{\\partial v}{\\partial y} = 0 \\). The slide then extends these concepts to three dimensions, where the continuity equation is \\( \\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot (\\rho \\mathbf{u}) = 0 \\). The velocity vector \\( \\mathbf{u} \\) is defined in terms of its components \\( \\rho u \\hat{i} + \\rho v \\hat{j} + \\rho w \\hat{k} \\), and the divergence operator \\( \\nabla \\) is defined in three dimensions. Incompressible steady state in 3D is given by \\( \\nabla \\cdot \\mathbf{u} = 0 \\), expanded to \\( \\frac{\\partial u}{\\partial x} + \\frac{\\partial v}{\\partial y} + \\frac{\\partial w}{\\partial z} = 0 \\).",
                                    "text": "Steady State: \\( \\frac{\\partial \\rho}{\\partial t} = 0 \\) implies \\( \\nabla \\cdot (\\rho \\mathbf{u}) = 0 \\).\nIncompressible: \\( \\rho \\nabla \\cdot \\mathbf{u} = 0 \\) implies \\( \\nabla \\cdot \\mathbf{u} = 0 \\), which implies \\( \\frac{\\partial u}{\\partial x} + \\frac{\\partial v}{\\partial y} = 0 \\).\nIn 3D: \\( \\frac{\\partial \\rho}{\\partial t} + \\nabla \\cdot (\\rho \\mathbf{u}) = 0 \\).\n\\( \\rho \\mathbf{u} = \\rho u \\hat{i} + \\rho v \\hat{j} + \\rho w \\hat{k} \\)\n\\( \\nabla = i \\frac{\\partial}{\\partial x} + j \\frac{\\partial}{\\partial y} + k \\frac{\\partial}{\\partial z} \\)\nIncompressible/Steady state: \\( \\nabla \\cdot \\mathbf{u} = 0 \\) implies \\( \\frac{\\partial u}{\\partial x} + \\frac{\\partial v}{\\partial y} + \\frac{\\partial w}{\\partial z} = 0 \\).",
                                    "image_description": "The image is a handwritten lecture slide containing mathematical equations related to fluid dynamics. It illustrates the continuity equation for steady state and incompressible flows, both in two and three dimensions, with definitions of the velocity vector and the divergence operator."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide presents the momentum balance in fluid dynamics. It explains the forces acting on a fluid element and derives the equations of motion using a control volume approach. The slide includes the derivation of the momentum balance equation using continuity and momentum conservation principles, resulting in the Navier-Stokes equations. The balance involves pressure and shear stress terms as well as the rate of change of linear momentum. Mathematical expressions are provided for the forces and the changes in momentum over time and space.",
                                    "text": "Momentum Balance:\n\\dot{L}_{AB} - \\dot{L}_{CD} + \\Sigma F = \\frac{\\partial}{\\partial t} L_{cv}\n\\dot{L}_{AB} = \\dot{m}_{AB} u = (\\rho u)(\\Delta y \\Delta z) u = (\\rho u^2)_x \\Delta y \\Delta z\n\\dot{L}_{CD} = \\dot{m}_{CD} u = (\\rho u^2)_{x+\\Delta x} \\Delta y \\Delta z\nF_{CD} = -p(x+\\Delta x) \\Delta y \\Delta z\nF_{AB} = p(x) \\Delta y \\Delta z\nF_{AD} = -\\tau(y) \\Delta x \\Delta z\nF_{BC} = \\tau(y+\\Delta y) \\Delta x \\Delta z\n\n(\\rho u^2)_x \\Delta y \\Delta z - (\\rho u^2)_{x+\\Delta x} \\Delta y \\Delta z + (p(x) \\Delta y \\Delta z - p(x+\\Delta x) \\Delta y \\Delta z) + (\\tau(y+\\Delta y) \\Delta x \\Delta z - \\tau(y) \\Delta x \\Delta z) = \\frac{\\partial}{\\partial t} (\\rho \\Delta x \\Delta y \\Delta z u)\n\n-\\frac{\\partial}{\\partial x} (\\rho u^2) \\Delta x \\Delta y \\Delta z - \\frac{\\partial p}{\\partial x} \\Delta x \\Delta y \\Delta z + \\frac{\\partial \\tau}{\\partial y} \\Delta x \\Delta y \\Delta z = \\frac{\\partial}{\\partial t} (\\rho u \\Delta x \\Delta y \\Delta z)\n\n-\\frac{\\partial}{\\partial x} (\\rho u^2) - \\frac{\\partial p}{\\partial x} + \\frac{\\partial \\tau}{\\partial y} = \\frac{\\partial}{\\partial t}(\\rho u)\n\n\\frac{\\partial}{\\partial x} (\\rho u^2) = \\frac{\\partial}{\\partial x}(\\rho u \\cdot u) = \\rho u \\frac{\\partial u}{\\partial x} + u \\frac{\\partial (\\rho u)}{\\partial x}\n\n\\frac{\\partial}{\\partial t}(\\rho u) = \\rho \\frac{\\partial u}{\\partial t} + u \\frac{\\partial \\rho}{\\partial t}\n",
                                    "image_description": "The image shows a rectangular control volume with sides labeled A, B, C, and D. Arrows indicate the forces acting on the sides, such as pressure and shear stress. The diagram is used to illustrate the momentum balance in the control volume. Mathematical expressions label the forces and changes in momentum."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide explains the derivation and transformation of fluid dynamics equations, particularly focusing on the continuity equation and the Navier-Stokes equation in one dimension. The slide elaborates on how the material derivative is used in fluid mechanics to describe changes in fluid properties as they move through space and time. The derivation starts from the basic continuity equation and utilizes the material derivative to arrive at the one-dimensional form of the Navier-Stokes equation for Newtonian fluids.",
                                    "text": "\\frac{\\partial}{\\partial t}(\\rho u) + \\frac{\\partial}{\\partial x}(\\rho u^2) = \\rho \\frac{\\partial u}{\\partial t} + u \\frac{\\partial \\rho}{\\partial t} + \\rho u \\frac{\\partial u}{\\partial x} + u \\left( \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial}{\\partial x}(\\rho u) \\right) \n\n= \\rho \\frac{\\partial u}{\\partial t} + \\rho u \\frac{\\partial u}{\\partial x} + u \\left( \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial}{\\partial x}(\\rho u) \\right) \n\n= \\rho \\left[ \\frac{\\partial u}{\\partial t} + u \\frac{\\partial u}{\\partial x} \\right] \n\n= \\rho \\left[ \\frac{\\partial}{\\partial t} + u \\frac{\\partial}{\\partial x} \\right] u \n\n= \\frac{D}{Dt} \\text{ (Material Derivative/ Substantive Derivative/ Total Derivative)} \n\n\\frac{D}{Dt} = \\frac{\\partial}{\\partial t} + u \\frac{\\partial}{\\partial x}\n\n\\rho \\frac{Du}{Dt} = -\\frac{\\partial p}{\\partial x} + \\frac{\\partial \\tau}{\\partial y} \n\n\\text{Newtonian fluid}\\ \\tau = \\mu \\frac{\\partial u}{\\partial y} \n\n\\rho \\frac{Du}{Dt} = -\\frac{\\partial p}{\\partial x} + \\mu \\frac{\\partial^2 u}{\\partial y^2} \\text{ (Navier-Stokes Equation 1D)}",
                                    "image_description": "The image shows handwritten notes deriving the Navier-Stokes equation in one dimension for a Newtonian fluid. It begins with the continuity equation, manipulating terms to introduce the concept of the material derivative. The derivation emphasizes the use of continuity (referring to an earlier slide) and introduces the notation \\( \\frac{D}{Dt} \\) for the material derivative, followed by the complete form of the Navier-Stokes equation for one-dimensional flow. The notes include boxed equations and annotations highlighting key steps and concepts."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide covers the derivation of the Navier-Stokes equations in two dimensions. It starts by expressing the momentum equations for the x and y directions, including terms for pressure and viscosity. The material then simplifies these equations using the substantial derivative and vector notation. The main result is the simplified form of the Navier-Stokes equation, which incorporates pressure gradient and viscosity terms. The slide also introduces the Laplacian operator for vector fields, providing a foundation for understanding fluid dynamics in a 2D context.",
                                    "text": "In 2D.\\\\\\n\n\\textbf{X:} \\quad \\rho \\left[ \\frac{\\partial u}{\\partial t} + u \\frac{\\partial u}{\\partial x} + v \\frac{\\partial u}{\\partial y} \\right] = -\\frac{\\partial p}{\\partial x} + \\mu \\left( \\frac{\\partial^2 u}{\\partial x^2} + \\frac{\\partial^2 u}{\\partial y^2} \\right) \\\\\\n\n\\textbf{Y:} \\quad \\rho \\left[ \\frac{Dv}{Dt} + u \\frac{\\partial v}{\\partial x} + v \\frac{\\partial v}{\\partial y} \\right] = -\\frac{\\partial p}{\\partial y} + \\mu \\left( \\frac{\\partial^2 v}{\\partial x^2} + \\frac{\\partial^2 v}{\\partial y^2} \\right) \\\\\\n\n\\frac{D\\vec{u}}{Dt} = \\left( \\frac{\\partial}{\\partial t} + u \\frac{\\partial}{\\partial x} + v \\frac{\\partial}{\\partial y} \\right) \\\\ \n\n= \\left( \\frac{\\partial}{\\partial t} + (u \\hat{i} + v \\hat{j}) \\cdot (\\hat{i} \\frac{\\partial}{\\partial x} + \\hat{j} \\frac{\\partial}{\\partial y}) \\right)\\\\\n\n= \\left( \\frac{\\partial}{\\partial t} + \\vec{u} \\cdot \\nabla \\right) \\\\\\n\n\\rho \\frac{D\\vec{u}}{Dt} = - \\nabla p + \\mu \\nabla^2 \\vec{u} \\\\\\n\n\\nabla^2 \\vec{u} = \\nabla \\cdot (\\nabla \\vec{u})\\\\\n\n\\nabla \\vec{u} = \\left( \\hat{i} \\frac{\\partial}{\\partial x} + \\hat{j} \\frac{\\partial}{\\partial y} \\right) \\vec{u}\\\\\n\n= \\left( \\hat{i} \\frac{\\partial u}{\\partial x} + \\hat{j} \\frac{\\partial v}{\\partial y} \\right) \\\\\n\n\\nabla \\cdot \\nabla \\vec{u} = \\left( \\hat{i} \\frac{\\partial}{\\partial x} + \\hat{j} \\frac{\\partial}{\\partial y} \\right) \\cdot \\left( \\hat{i} \\frac{\\partial u}{\\partial x} + \\hat{j} \\frac{\\partial u}{\\partial y} \\right)\\\\\n\n= \\left( \\frac{\\partial^2 u}{\\partial x^2} + \\frac{\\partial^2 u}{\\partial y^2} \\right)",
                                    "image_description": "The image is a handwritten lecture slide showing equations related to the Navier-Stokes equation in two dimensions. It includes several mathematical equations and derivations involving partial derivatives, the gradient, and the Laplacian operator. Key equations are boxed for emphasis. The slide also uses vector notation to simplify the expressions for fluid dynamics."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide presents the derivation of a fluid dynamics equation under the assumptions of steady-state and uniform flow. Starting with the Navier-Stokes equation for incompressible flow, the conditions of steady-state (partial derivative of velocity with respect to time is zero) and uniform flow (partial derivative of velocity with respect to x is zero) simplify the equation to a balance between pressure gradient and viscous forces. The slide illustrates the derivation of velocity profile for flow between two parallel plates (plane Couette flow), with boundary conditions leading to the determination of constants in the velocity equation.",
                                    "text": "\\rho \\frac{Du}{Dt} = -\\frac{\\partial p}{\\partial x} + \\mu \\frac{\\partial^2 u}{\\partial y^2} \\\\\n\\rho \\left[ \\frac{\\partial u}{\\partial t} + u \\frac{\\partial u}{\\partial x} \\right] = -\\frac{\\partial p}{\\partial x} + \\mu \\frac{\\partial^2 u}{\\partial y^2} \\\\\n\\text{Steady State: } \\frac{\\partial u}{\\partial t} = 0 \\\\\n\\text{Uniform flow: } \\frac{\\partial u}{\\partial x} = 0 \\\\\n-\\frac{\\partial p}{\\partial x} + \\mu \\frac{\\partial^2 u}{\\partial y^2} = 0 \\\\\n\\hline \\\\\n\\mu \\frac{d^2 u}{dy^2} = \\frac{dp}{dx} \\\\\n\\mu \\frac{du}{dy} = \\frac{dp}{dx} y + c_1 \\\\\n\\mu u = \\frac{dp}{dx} \\frac{y^2}{2} + c_1 y + c_2 \\\\\nu(y = 0) = 0 \\implies 0 = 0 + c_1(0) + c_2 \\implies c_2 = 0 \\\\\nu(y = \\delta) = V \\implies \\mu V = \\frac{dp}{dx} \\frac{\\delta^2}{2} + c_1 \\delta \\implies c_1 = \\mu \\frac{V}{\\delta} - \\frac{dp}{dx} \\frac{\\delta}{2}",
                                    "image_description": "The image includes handwritten notes and equations related to fluid dynamics. It begins with the Navier-Stokes equation for incompressible flow and shows the steps to simplify it under steady-state and uniform flow conditions. Below, a diagram depicts flow between two parallel plates (plane Couette flow), with the velocity profile described by boundary conditions. Constants are determined through these conditions."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses fluid mechanics, specifically the velocity profile in a channel. The key equation presented is the differential equation for velocity, \\( u(y) \\), derived from the Navier-Stokes equations. The boundary conditions are \\( u(0) = 0 \\) and \\( u(\\delta) = V \\). The shear stress at different points is also discussed, with diagrams illustrating the velocity profile and shear stress distribution across the channel depth, from \\( y = 0 \\) to \\( y = \\delta \\).",
                                    "text": "\\mu u(y) = \\frac{dp}{dx}\\frac{y^2}{2} + \\left(\\frac{\\mu V}{\\delta} - \\frac{dp}{dx}\\frac{\\delta}{2}\\right)y \n\\begin{align*}\nu(y) &= \\frac{1}{2\\mu}\\frac{dp}{dx}\\left(y^2 - \\delta y\\right) + \\frac{V}{\\delta}y \\\\\n&= \\frac{1}{2\\mu}\\left(-\\frac{dp}{dx}\\right)\\left(\\delta y - y^2\\right) + \\frac{V}{\\delta}y \\\\\n&= \\frac{1}{2\\mu}\\left(-\\frac{dp}{dx}\\right)\\delta^2\\left[\\frac{y}{\\delta} - \\left(\\frac{y}{\\delta}\\right)^2\\right] + \\left(\\frac{V}{\\delta}\\right)y \\end{align*}\nWhen \\( y = 0 \\); \\quad u(0) = 0\\\\\n\\quad y = \\delta ; \\quad u(\\delta) = V\n\\\\\n\\tau(y=0) = \\mu \\frac{\\partial u}{\\partial y}\\bigg|_{y=0}\\\\\n\\tau(y=\\delta) = \\mu \\frac{\\partial u}{\\partial y}\\bigg|_{y=\\delta}",
                                    "image_description": "The image contains two diagrams of velocity profiles in a channel. The first diagram shows a parabolic velocity distribution between \\( y = 0 \\) and \\( y = \\delta \\). The second diagram shows the shear stress distribution, with linear variation from \\( y = 0 \\) to \\( y = \\delta \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "This slide analyzes the flow rate of fluid between two parallel plates. It uses integral calculus to derive expressions for the volumetric flow rate (Q) of the fluid, considering variables such as the width (W) of the plates, the viscosity (μ) of the fluid, the pressure gradient (dp/dx), and the distance (δ) between the plates. The lecture provides a detailed mathematical derivation, eventually leading to an expression for the average velocity (u_{avg}) of the fluid. The important equations include the volumetric flow rate and the average velocity in terms of the given parameters.",
                                    "text": "Flow rate of fluid between the plates\nQ = \\int \\limits_{\\delta}^{} dA = \\int \\limits_{0}^{\\delta} (dy \\; W) \\; u(y) \\\\\nQ = W \\; \\int \\limits_{0}^{\\delta} \\left( \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\right) \\delta^2 \\left[ \\left( \\frac{y}{\\delta} \\right) - \\left( \\frac{y}{\\delta} \\right)^2 \\right] + \\frac{V}{g} \\; y \\; dy \\\\\nLet \\; \\eta = \\frac{y}{\\delta} \\Rightarrow d\\eta = \\frac{dy}{\\delta} \\Rightarrow dy = \\delta \\, d\\eta \\\\\nQ = W \\; \\int \\limits_{0}^{1} \\left( \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\right) \\delta^2 \\left[ \\eta - \\eta^2 \\right] + V \\eta \\; \\delta \\, d\\eta \\\\\n= W \\left[ \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\delta^2 \\left[ \\frac{\\eta^2}{2} - \\frac{\\eta^3}{3} \\right]_0^1 + \\frac{V \\eta}{2} \\right]_0^1 \\delta \\\\\n= W \\left[ \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\frac{\\delta^3}{6} + \\frac{V}{2} \\delta \\right] \\\\\n(u_{avg}) \\; A = Q \\\\\n(u_{avg}) \\; W \\delta = W \\left[ \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\frac{\\delta^3}{6} + \\frac{V}{2} \\delta \\right] \\\\\nu_{avg} = \\frac{1}{2 \\mu} \\left( - \\frac{dp}{dx} \\right) \\frac{\\delta^2}{6} + \\frac{V}{2}",
                                    "image_description": "The image is a diagram illustrating the flow of fluid between two parallel plates, labeled with dimensions and variables. The distance between the plates is marked as δ, and the width of the plates is marked as W. A small element dy is shown with an arrow indicating the velocity profile u(y) of the fluid between the plates. The diagram visually supports the mathematical derivation of the flow rate."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_9.png"
                            }
                        ]
                    },
                    {
                        "10": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the pressure gradient required to achieve a flow rate \\( Q \\). It begins with the equation for \\( Q \\) involving the pressure gradient \\( \\frac{dp}{dx} \\), viscosity \\( \\mu \\), and other parameters. The slide derives equations for \\( \\frac{dp}{dx} \\) by expressing it in terms of flow rate \\( Q \\), velocity \\( v \\), and geometrical parameters. Additionally, it describes how the pressure difference \\( \\frac{dp}{dx} \\) can be calculated using the dashpot model, relating it to the dimensions \\( D_o \\) and \\( D_i \\), and the pressure difference between two points.",
                                    "text": "Pressure gradient required to obtain a flow rate \\( Q \\) \\[ Q = W \\left[ \\frac{1}{2\\mu} \\left(-\\frac{dp}{dx}\\right) \\frac{\\delta^3}{6} + \\frac{v}{2} \\delta \\right] \\] \\( \\left(\\frac{dp}{dx}\\right) = \\left(-\\frac{Q}{W} + \\frac{v \\delta}{2}\\right) \\frac{6}{\\delta^3} 2\\mu \\) \\( \\frac{Q}{W} = \\frac{1}{2\\mu} \\left(-\\frac{dp}{dx}\\right) \\frac{\\delta^3}{6} + \\frac{v}{2} \\delta \\) \\( \\frac{1}{2\\mu} \\left(\\frac{dp}{dx}\\right) \\frac{\\delta^3}{6} = \\frac{v}{2} \\delta - \\frac{Q}{W} \\) Dashpot \\( \\delta = \\frac{D_o - D_i}{2} \\) \\( \\frac{dp}{dx} = \\frac{P_2 - P_1}{L} \\)",
                                    "image_description": "The image includes handwritten equations and a diagram labeled 'Dashpot' showing a piston-like object with dimensions labeled \\( V \\), \\( L \\), \\( D_o \\) (outer diameter), and \\( D_i \\) (inner diameter). The diagram is used to define \\( \\delta \\) as \\( \\frac{D_o - D_i}{2} \\) and shows the calculation of \\( \\frac{dp}{dx} \\) as \\( \\frac{P_2 - P_1}{L} \\). DESCRIPTION OF THE IMAGE OR CHART"
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_10.png"
                            }
                        ]
                    },
                    {
                        "11": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the flow in pipes, specifically focusing on steady and incompressible flow. It presents the mathematical formulation of the problem using differential equations to describe the balance of forces in the radial direction. The equations derive the relationship between pressure gradient and shear stress in cylindrical coordinates, leading to the expression for the velocity profile in the pipe. The boundary conditions specify that the velocity gradient is zero at the pipe center and that the velocity itself is zero at the pipe wall.",
                                    "text": "Flow in pipes \\[ \\rho(x) \\quad \\tau(r + \\Delta r) \\quad p(x+\\Delta x) \\quad \\tau(r) \\] \\[ p(x) 2\\pi r \\Delta r - p(x+\\Delta x) 2\\pi r \\Delta r + (\\tau(r) A(r)) - (\\tau(r) A(r))|_{r+\\Delta r} = 0 \\] \\[ \\Sigma F_x = 0. \\] Steady and incompressible flow. \\[ -\\frac{\\partial p}{\\partial x} 2\\pi r \\Delta x - \\frac{\\partial}{\\partial r}(\\tau A) \\Delta r = 0 \\] \\[ A = 2\\pi r \\Delta x \\] \\[ -\\frac{\\partial p}{\\partial x} 2\\pi r \\Delta x - \\frac{\\partial}{\\partial r} \\left(2\\pi r \\Delta x \\tau(r)\\right) \\Delta r = 0 \\] \\[ -\\frac{\\partial p}{\\partial x} r - \\frac{\\partial}{\\partial r}(\\tau(r) r) = 0 \\] \\[ \\frac{\\partial}{\\partial r}(\\tau(r) r) = -\\frac{\\partial p}{\\partial x} r \\] \\[ \\frac{\\partial}{\\partial r}(-\\mu r \\frac{\\partial u}{\\partial r}) = -\\frac{\\partial p}{\\partial x} r \\] \\[ \\Rightarrow \\frac{\\partial}{\\partial r} \\left( \\mu r \\frac{\\partial u}{\\partial r} \\right) = \\frac{\\partial p}{\\partial x} \\] \\[ u(R) = 0 \\quad ; \\quad \\frac{\\partial u}{\\partial r}|_{r=0} = 0 \\]",
                                    "image_description": "The image contains diagrams illustrating the flow in a cylindrical pipe. There are sketches showing a cylindrical element with pressure and shear forces labeled. The flow is characterized as steady and incompressible. Arrows indicate the direction of forces and flow within the pipe. Mathematical expressions for force balance are shown, and a velocity profile diagram is included, indicating a parabolic flow profile typical of laminar flow in a pipe."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_11.png"
                            }
                        ]
                    },
                    {
                        "12": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide outlines a series of tasks related to fluid dynamics. It involves solving for a variable \\( u \\), determining a quantity \\( Q \\), and deriving the equation for pressure drop \\( \\Delta p \\) in a fluid flow system. The equation for pressure drop is given as \\( \\Delta p = f \\frac{L}{D} \\frac{V^2}{2} \\), where \\( f \\) is the friction factor defined as \\( f = \\frac{64}{Re} \\) with \\( Re \\) being the Reynolds number. The slide likely pertains to the study of fluid flow in pipes, focusing on laminar flow conditions where the friction factor can be expressed as a function of the Reynolds number.",
                                    "text": "1) Solve for \\( u \\)\n2) & Determine \\( Q \\)\n3) Determine \\( \\text{wrong} \\) (possibly a typo or an incomplete task)\n4) Derive: \\( \\Delta p = f \\frac{L}{D} \\frac{V^2}{2} \\) where \\( f = \\frac{64}{Re} \\)",
                                    "image_description": "The slide contains handwritten text with four enumerated tasks related to fluid dynamics and an equation for pressure drop in a pipe flow system. There are no additional images or diagrams."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_13\\Lecture_03_13_page_12.png"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "Lecture_03_15": [
            {
                "pdf_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15"
            },
            {
                "lecture_summary": {
                    "lecture_name": "Laminar Flow in Circular Pipes",
                    "lecture_subtitle": "Derivation and Analysis of Velocity Profiles and Pressure Losses",
                    "summary": "The lecture covers the derivation of velocity profiles for laminar flow in circular pipes. Starting with the fundamental principles of fluid mechanics, it explores the steady-state flow conditions, no velocity gradient in the x-direction, and fully developed flow. The derivation uses the Navier-Stokes equations tailored for cylindrical coordinates to find the velocity distribution across the pipe's radius. The lecture further elaborates on the relationship between pressure gradient and velocity, leading to the formula for maximum velocity and average velocity. It also discusses the wall shear stress and frictional losses, and applies the concepts to calculate pressure drops in pipes using the Hagen-Poiseuille equation. Lastly, the material derivative is introduced to link time-dependent changes with spatial variations in fluid flow.",
                    "key_concepts": [
                        {
                            "keyword": "Laminar Flow",
                            "description": "Flow regime characterized by smooth, constant fluid motion, typically at low velocities and in small channels. Governed by Reynolds number below 2000."
                        },
                        {
                            "keyword": "Navier-Stokes Equations",
                            "description": "Fundamental equations of fluid dynamics describing the motion of viscous fluid substances. Used here in cylindrical coordinates for pipe flow analysis."
                        },
                        {
                            "keyword": "Velocity Profile",
                            "description": "The distribution of fluid velocities across a section of the pipe, typically parabolic for laminar flow in a circular pipe."
                        },
                        {
                            "keyword": "Pressure Gradient",
                            "description": "The rate of decrease of pressure along the flow direction, driving force behind fluid flow in pipes."
                        },
                        {
                            "keyword": "Hagen-Poiseuille Equation",
                            "description": "Describes the volumetric flow rate for laminar flow of a Newtonian fluid through a cylindrical pipe."
                        },
                        {
                            "keyword": "Wall Shear Stress",
                            "description": "The force per unit area exerted by the fluid against the pipe wall, related to velocity gradient at the wall."
                        },
                        {
                            "keyword": "Material Derivative",
                            "description": "Combines local and convective changes to describe the total change of a property in a fluid flow field."
                        }
                    ],
                    "foundational_concepts": [
                        {
                            "keyword": "Continuity Equation",
                            "description": "A fundamental principle of fluid dynamics that expresses the conservation of mass in a fluid flow."
                        },
                        {
                            "keyword": "Newtonian Fluid",
                            "description": "A fluid with a constant viscosity that does not change with the rate of deformation or shear rate."
                        },
                        {
                            "keyword": "Reynolds Number",
                            "description": "Dimensionless number that predicts flow regime, whether laminar or turbulent, based on fluid properties and flow conditions."
                        }
                    ],
                    "search_keywords": [
                        "Laminar flow velocity profile",
                        "Hagen-Poiseuille equation derivation",
                        "Navier-Stokes equations in cylindrical coordinates"
                    ]
                }
            },
            {
                "all_page_summaries": [
                    {
                        "1": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses pipe flow in a steady state, focusing on the balance of forces and the absence of a velocity gradient in the x-direction, indicating fully developed flow. It presents the derivation of the equation for pressure and shear stresses in cylindrical coordinates, with simplifications leading to the final expression for the shear stress distribution across the pipe radius.",
                                    "text": "Pipe Flow\n\nSteady State:\n$$L_{in} - L_{out} + \\sum F = \\frac{\\partial}{\\partial t} (\\rho u)$$\n\n$$L_{in} - L_{out} = 0 \\Rightarrow \\text{no velocity gradient in x-direction}$$\n\\text{(i.e., fully developed)}\n\nForces:\n$$p(x) 2 \\pi r \\Delta r - p(x + \\Delta x) 2 \\pi r \\Delta r - [\\tau(r) A(r)] + [\\tau(r + \\Delta r) A(r + \\Delta r)]$$\n\nEquations:\n$$- (\\tau A)_r + (\\tau A)_{r+\\Delta r} = 0$$\n$$p(x) 2 \\pi r \\Delta r - \\frac{\\partial p}{\\partial x} \\Delta x 2 \\pi r \\Delta r - (\\tau A)_r + (\\tau A)_r + \\frac{\\partial}{\\partial r} (\\tau A) \\Delta r = 0$$\n\nSimplification:\n$$- \\frac{\\partial p}{\\partial x} 2 \\pi r \\Delta r \\Delta x + \\frac{\\partial}{\\partial r} (\\tau A) \\Delta r = 0$$\n$$A = 2 \\pi r \\Delta x$$\n$$\\Rightarrow \\frac{\\partial}{\\partial r} (r \\tau) = \\frac{\\partial p}{\\partial x} r$$",
                                    "image_description": "The image contains diagrams illustrating pipe flow. The first diagram shows a section of a pipe with pressure $p(x)$ at the inlet and $p(x + \\Delta x)$ at the outlet, and shear stress $\\tau(r)$ across the radius. A circular cross-section is depicted, indicating the radial change $\\Delta r$. The annotations explain the steady-state conditions and the balance of forces within the pipe."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_1.png"
                            }
                        ]
                    },
                    {
                        "2": [
                            {
                                "page_summary": {
                                    "summary": "This lecture slide presents the derivation of the velocity profile for a fluid flow in a cylindrical coordinate system. It starts with the expression for shear stress, \\( \\tau = \\mu \\frac{\\partial u}{\\partial r} \\), and uses the concept of momentum balance to derive the velocity profile \\( u(r) \\). The slide includes steps involving integration and boundary conditions to arrive at the final expression for \\( u(r) \\).",
                                    "text": "\\tau = \\mu \\frac{\\partial u}{\\partial r} \\\\\n\\frac{\\partial}{\\partial r} \\left( r \\mu \\frac{\\partial u}{\\partial r} \\right) = \\frac{dp}{dx} r \\\\\n\\left(r \\mu \\frac{du}{dr} = 1\\right) \\quad \\frac{\\partial}{\\partial r}\\left( r \\frac{\\partial u}{\\partial r} \\right) = \\frac{1}{\\mu} \\frac{dp}{dx} r \\\\\nr \\frac{\\partial u}{\\partial r} = \\frac{1}{\\mu} \\frac{dp}{dx} \\frac{r^2}{2} + c_1 \\\\\n\\frac{\\partial u}{\\partial r} = \\frac{1}{\\mu} \\frac{dp}{dx} \\frac{r}{2} + \\frac{c_1}{r} \\\\\nu(r) = \\frac{1}{\\mu} \\frac{dp}{dx} \\frac{r^2}{4} + c_1 \\ln r + c_2 \\\\\n\\left(u |_{r=R} = 0\\right) \\quad d \\quad \\tau = \\mu \\frac{du}{dr} \\bigg|_{r=0} = 0 \\\\\nc_1 = 0 \\quad c_2 = -\\frac{1}{4\\mu} \\frac{dp}{dx} \\frac{R^2}{4} \\\\\nu(r) = \\frac{1}{\\mu} \\frac{dp}{dx} \\frac{r^2}{4} - \\frac{1}{4\\mu} \\frac{dp}{dx} \\frac{R^2}{4} \\\\\n= \\frac{1}{4\\mu} \\left(-\\frac{dp}{dx}\\right) \\left(R^2 - r^2\\right) \\\\\n\\boxed{u(r) = \\frac{1}{4\\mu} \\left(-\\frac{dp}{dx}\\right) R^2 \\left[1 - \\frac{r^2}{R^2}\\right]}",
                                    "image_description": "The image contains handwritten mathematical derivations involving fluid flow in cylindrical coordinates. It includes equations for shear stress, integration steps, and boundary conditions leading to the final velocity profile expression. No charts or diagrams are present."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_2.png"
                            }
                        ]
                    },
                    {
                        "3": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the velocity profile for flow through a pipe, focusing on the parabolic velocity distribution. It establishes the maximum velocity \\( U_{\\text{max}} \\) and average velocity \\( \\bar{U} \\) for fluid flow. The slide derives the flow rate \\( Q \\) by integrating the velocity profile over the circular cross-section of the pipe. The relationship between maximum and average velocities is also outlined.",
                                    "text": "Let \\( U_{\\text{max}} = \\frac{1}{4 \\mu} \\left( -\\frac{dp}{dx} \\right) R^2 \\)\n\n\\[ U(r) = U_{\\text{max}} \\left[ 1 - \\frac{r^2}{R^2} \\right] \\]\n\n(where \\( U(r) \\) is the velocity profile).\n\nFlow rate:\n\\[ Q = \\int dA = \\int_0^R \\left( 2 \\pi r \\Delta r \\right) u(r) \\]\n\n\\[ = 2 \\pi U_{\\text{max}} \\int_0^R \\left( r \\left[ 1 - \\frac{r^2}{R^2} \\right] \\right) dr \\]\n\n\\[ = 2 \\pi U_{\\text{max}} \\int_0^R \\left( r - \\frac{r^3}{R^2} \\right) dr \\]\n\n\\[ = 2 \\pi U_{\\text{max}} \\left( \\frac{R^2}{2} - \\frac{R^4}{4R^2} \\right) \\]\n\n\\[ = 2 \\pi U_{\\text{max}} \\frac{R^2}{4} \\]\n\n\\[ = \\frac{\\pi}{2} U_{\\text{max}} R^2 \\]\n\nAverage velocity \\( \\bar{U} \\):\n\n\\[ Q = A \\bar{U} = \\frac{\\pi}{2} R^2 U_{\\text{max}} \\]\n\n\\[ = \\frac{A U_{\\text{max}}}{2} \\]\n\n\\[ \\bar{U} = \\frac{U_{\\text{max}}}{2} \\]\n\n\\[ U_{\\text{max}} = 2 \\bar{U} \\]",
                                    "image_description": "The image shows a diagram with a parabolic velocity profile in a pipe, indicating maximum velocity \\( U_{\\text{max}} \\) at the center and decreasing towards the edges. There is also a cross-sectional view of the pipe with radius \\( R \\). The diagrams are labeled with variables used in the derivation of flow rate and velocity profile equations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_3.png"
                            }
                        ]
                    },
                    {
                        "4": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide explains the derivation of pressure drop in a pipe flow using the Hagen-Poiseuille equation and relates it to the head loss. It begins with the expression for maximum velocity in a pipe, $u_{\\text{max}}$, in terms of the pressure gradient $\\frac{dp}{dx}$ and the pipe radius $R$. The pressure drop per unit length $\\frac{p_1-p_2}{L}$ is derived and further manipulated to express it in terms of average velocity $\\bar{u}$ and diameter $D$. The derivation introduces the dimensionless Reynolds number $Re$ and ends with an expression for head loss in terms of velocity and gravitational acceleration $g$.",
                                    "text": "u_{max} = \\frac{1}{4\\mu} \\left(\\frac{dp}{dx}\\right) R^2 \\\\\n-\\frac{dp}{dx} = 4\\mu \\frac{u_{max}}{R^2} \\\\\n\\frac{p_1 - p_2}{L} = 4\\mu \\frac{2\\bar{u}}{R^2} = \\frac{4\\mu 2\\bar{u}}{(D/2)^2} = \\frac{32 \\mu \\bar{u}}{D^2} \\\\\n\\frac{p_1 - p_2}{L} = \\frac{32 \\mu \\bar{u}^2}{\\bar{u} D D} = \\frac{32 \\mu}{\\bar{u} D} \\frac{L}{D} \\bar{u}^{-2} \\\\\n\\frac{p_1 - p_2}{\\rho} = \\frac{64 \\mu}{\\rho \\bar{u} D} \\frac{L}{D} \\bar{u}^2 \\bar{u}^{-2} = \\frac{64}{Re} \\frac{L}{D} \\bar{u}^2 \\\\ \\Rightarrow \\frac{p_1 - p_2}{\\rho g} = \\frac{64}{Re} \\frac{L}{D} \\frac{\\bar{u}^2}{2g} \\quad \\text{head loss} \\quad f \\frac{L}{D} \\frac{\\bar{u}^2}{2g}",
                                    "image_description": "The image contains handwritten equations and a simple diagram of a pipe with points P1 and P2, indicating a flow from left to right over a length L. The equations describe the derivation of pressure drop in pipe flow and its relation to head loss. The diagram visually represents the flow and pressure points used in the equations."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_4.png"
                            }
                        ]
                    },
                    {
                        "5": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide discusses the concept of wall shear stress in fluid dynamics. It begins with the equation for wall shear stress, \\( \\tau = \\mu \\frac{du}{dr} \\bigg|_{r=R} \\), where \\( \\mu \\) is the dynamic viscosity and \\( \\frac{du}{dr} \\) is the velocity gradient at the wall. The velocity profile \\( u(r) \\) is given as \\( u_{\\text{max}} \\left[ 1 - \\frac{r^2}{R^2} \\right] \\), and its derivative \\( \\frac{du}{dr} \\) is calculated as \\( u_{\\text{max}} \\left[ -\\frac{2r}{R^2} \\right] \\). The wall shear stress \\( \\tau \\) is then found as \\( \\mu u_{\\text{max}} \\left( -\\frac{2}{R} \\right) \\). Finally, the wall friction loss (force) is described as \\( \\tau A = \\frac{\\tau}{\\text{area}} \\left( \\mu u_{\\text{max}} \\frac{2}{R} \\right) (2 \\pi R) L \\), where \\( A \\) is the area, and \\( L \\) is the length of the wall.",
                                    "text": "Wall shear stress: \n\\( \\tau = \\mu \\frac{du}{dr} \\bigg|_{r=R} \\) \n\n\\( u(r) = u_{\\text{max}} \\left[ 1 - \\frac{r^2}{R^2} \\right] \\) \n\n\\( \\frac{du}{dr} = u_{\\text{max}} \\left[ -\\frac{2r}{R^2} \\right] \\bigg|_{r=R} \\)\n\n\\( \\frac{du}{dr} \\bigg|_{r=R} = u_{\\text{max}} \\left[ -\\frac{2}{R} \\right] \\)\n\n\\( \\tau = \\mu u_{\\text{max}} \\left( -\\frac{2}{R} \\right) \\) \n\nWall friction loss (force): \n\\( \\tau A = \\frac{\\tau}{\\text{area}} \\left( \\mu u_{\\text{max}} \\frac{2}{R} \\right) (2 \\pi R) L \\)",
                                    "image_description": "The image contains handwritten equations explaining the concept of wall shear stress in fluid dynamics. The equations show the derivation of wall shear stress \\( \\tau \\) and wall friction loss. The velocity profile \\( u(r) \\), its derivative, and the final expressions for \\( \\tau \\) and wall friction loss in terms of viscosity \\( \\mu \\), maximum velocity \\( u_{\\text{max}} \\), and radius \\( R \\) are presented."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_5.png"
                            }
                        ]
                    },
                    {
                        "6": [
                            {
                                "page_summary": {
                                    "summary": "The slide discusses the derivation of the continuity equation in fluid dynamics. It starts with the mass flow rate equation, \\( \\dot{m} = \\rho A v \\), and applies it to a control volume represented by a rectangular prism. The slide derives the differential form of the continuity equation, \\( \\frac{\\partial \\rho}{\\partial t} + \\frac{\\partial}{\\partial x}(\\rho u) = 0 \\), using the conservation of mass principle within the control volume.",
                                    "text": "\\begin{align*}\n\\dot{m}_{AB} - \\dot{m}_{CD} &= \\frac{\\partial}{\\partial t} m_{cv} \\\\\n(\\rho u)_x \\Delta y \\Delta z - (\\rho u)_{x+\\Delta x} \\Delta y \\Delta z &= \\frac{\\partial}{\\partial t}(\\rho \\Delta x \\Delta y \\Delta z) \\\\\n(\\rho u)_x \\Delta y \\Delta z - \\left[(\\rho u)_x \\Delta y \\Delta z + \\frac{\\partial}{\\partial x}(\\rho u) \\Delta x \\Delta y \\Delta z\\right] &= \\frac{\\partial}{\\partial t}(\\rho \\Delta x \\Delta y \\Delta z) \\\\\n-\\frac{\\partial}{\\partial x}(\\rho u) &= \\frac{\\partial}{\\partial t}(\\rho) \\\\\n&\\Rightarrow \\boxed{\\frac{\\partial}{\\partial t} \\rho + \\frac{\\partial}{\\partial x} \\rho u = 0}\n\\end{align*}",
                                    "image_description": "The image contains diagrams of a control volume with labels A, B, C, and D, and dimensions \\( \\Delta x \\) and \\( \\Delta y \\). It shows the orientation of the control volume with respect to the coordinate axes \\( x \\) and \\( y \\), and it includes handwritten equations related to mass flow and the derivation of the continuity equation in fluid dynamics."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_6.png"
                            }
                        ]
                    },
                    {
                        "7": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide covers fluid dynamics and focuses on the derivation of the momentum equation. It includes the analysis of forces acting on a fluid element in a control volume, using variables like pressure \\(p\\), density \\(\\rho\\), velocity \\(u\\), and shear stress \\(\\tau\\). The equations describe the forces and momentum changes, considering pressure differences and shear stresses. It also mentions the gravitational force component \\(\\rho g \\sin \\theta\\). The final equation is a form of the Navier-Stokes equation in differential form, showing the change in momentum due to pressure, shear stress, and gravity.",
                                    "text": "L_{AB}^\\circ - L_{CD}^\\circ + \\Sigma F = \\frac{\\partial L_{cv}}{\\partial t} \n\nL_{AB}^\\circ = \\dot{m}_{AB} u(x) = (\\rho u) \\Delta y \\Delta z u = (\\rho u^2)_x \\Delta y \\Delta z \n\nL_{CD}^\\circ = \\dot{m}_{CD} u(x+\\Delta x) = (\\rho u^2)_{x+\\Delta x} \\Delta y \\Delta z \n\n\\Sigma F = p(x) \\Delta y \\Delta z - p(x + \\Delta x) \\Delta y \\Delta z + \\tau(y + \\Delta y) \\Delta x \\Delta z - \\tau(y) \\Delta x \\Delta z \n+ (\\Delta m) g \\sin \\theta \n\\Delta m = \\rho \\Delta x \\Delta y \\Delta z \n\nL_{cv} = \\Delta m \\ u = \\rho \\Delta x \\Delta y \\Delta z u \n\n(\\rho u^2)_x \\Delta y \\Delta t - (\\rho u^2)_{x+\\Delta x} \\Delta y \\Delta t + p(x) \\Delta y \\Delta z - p(x+\\Delta x) \\Delta y \\Delta z \n+ \\tau(y+\\Delta y) \\Delta x \\Delta t - \\tau(y) \\Delta x \\Delta t + \\rho \\Delta x \\Delta y \\Delta z g \\sin \\theta = \\frac{\\partial}{\\partial t}(\\rho u \\Delta x \\Delta y \\Delta z) \n\n- \\frac{\\partial}{\\partial x}(\\rho u^2) - \\frac{\\partial p}{\\partial x} + \\frac{\\partial \\tau}{\\partial y} + \\rho g \\sin \\theta = \\frac{\\partial}{\\partial t}(\\rho u) \n\n\\frac{\\partial}{\\partial t}(\\rho u) + \\frac{\\partial}{\\partial x} (\\rho u^2) = -\\frac{\\partial p}{\\partial x} + \\frac{\\partial \\tau}{\\partial y} + \\rho g \\sin \\theta.",
                                    "image_description": "The image is a diagram of a control volume in a fluid flow, represented as a parallelogram with vertices labeled A, B, C, and D. Arrows indicate the direction of forces and velocities, with labels such as \\(p(x)\\), \\(p(x+\\Delta x)\\), \\(\\tau(y)\\), and \\(\\tau(y+\\Delta y)\\). This diagram is used to visualize the forces acting on the control volume, which are described in the equations on the slide."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_7.png"
                            }
                        ]
                    },
                    {
                        "8": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide focuses on fluid dynamics, specifically the derivation of the Navier-Stokes equation in a simplified form. It begins with the equation of motion for fluid flow and simplifies it by introducing the material derivative. The slide highlights the conditions for steady-state and uniform flow, emphasizing the concept of a fully developed flow and boundary layer thickness. It includes equations for momentum conservation and defines the material derivative to simplify the fluid dynamics equations.",
                                    "text": "\\frac{\\partial}{\\partial t}(\\rho u) + \\frac{\\partial}{\\partial x}(\\rho u^2) = \\rho \\frac{\\partial u}{\\partial t} + u \\frac{\\partial \\rho}{\\partial t} + \\rho u \\frac{\\partial u}{\\partial x} + u \\rho \\frac{\\partial u}{\\partial x} \\newline \\text{Define} \\quad \\frac{D}{Dt} \\triangleq \\frac{\\partial}{\\partial t} + u \\frac{\\partial}{\\partial x} \\quad \\text{(Material Derivative)} \\newline \\rho \\frac{Du}{Dt} = -\\frac{\\partial p}{\\partial x} + \\mu \\frac{\\partial^2 u}{\\partial y^2} + \\rho g \\sin \\theta \\newline \\text{Steady state } \\frac{\\partial}{\\partial t} = 0 \\newline \\text{Uniform flow (Fully developed flow)} \\frac{\\partial}{\\partial x} = 0",
                                    "image_description": "The image contains handwritten notes with equations related to fluid dynamics, specifically a simplified form of the Navier-Stokes equation. There is a definition for the material derivative and conditions for steady-state and uniform flow. The diagram illustrates a boundary layer between two parallel lines, labeled with boundary layer thickness \\( \\delta \\) and flow direction \\( y \\to \\infty \\)."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_8.png"
                            }
                        ]
                    },
                    {
                        "9": [
                            {
                                "page_summary": {
                                    "summary": "The lecture slide derives the shear stress at the upper plate in a fluid dynamics context. The velocity profile is given by \\( u = u_m \\left(1 - \\left(\\frac{y}{\\delta}\\right)^2\\right) \\), and the derivative \\( \\frac{du}{dy} \\) is calculated. The shear stress \\( \\tau \\) at the upper plate is determined using the expression \\( \\tau = \\mu \\frac{du}{dy} \\bigg|_{y=\\delta} \\), leading to the final result \\( \\tau = -3 \\mu \\frac{\\bar{u}}{\\delta} \\), where \\( u_m = \\frac{3}{2} \\bar{u} \\).",
                                    "text": "\\( \\tau \\text{ at upper plate} = \\mu \\frac{du}{dy} \\bigg|_{y=\\delta} \\)\n\n\\( \\frac{du}{dy} = \\)\n\n\\( u = u_m \\left(1 - \\left(\\frac{y}{\\delta}\\right)^2\\right) \\)\n\n\\( \\frac{du}{dy} = u_m \\left(-\\frac{2y}{\\delta}\\right) \\)\n\n\\( \\frac{du}{dy} \\bigg|_{y=\\delta} = -u_m \\frac{2}{\\delta} \\)\n\n\\( \\tau \\text{ at upper plate} = -\\mu u_m \\frac{2}{\\delta} \\)\n\n\\( = -\\mu \\frac{3 \\bar{u}}{2} \\frac{2}{\\delta} \\)\n\n\\( = -3 \\mu \\frac{\\bar{u}}{\\delta} \\) since \\( u_m = \\frac{3}{2} \\bar{u} \\)",
                                    "image_description": "The image contains handwritten equations and calculations related to fluid dynamics, specifically deriving the shear stress at the upper plate. It includes steps to calculate the derivative of a velocity profile and the resulting shear stress formula. There are annotations and explanations alongside the equations, with a clear final result for shear stress."
                                }
                            },
                            {
                                "file_path": "c:\\Users\\lberm\\OneDrive\\Documents\\Github\\mechedu1.0\\src\\notebooks\\lecture_images\\Lecture_03_15\\Lecture_03_15_page_9.png"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]